window.normative_masters_record = {
  "lastUpdate_50m": "06/04/2025",
  "lastUpdate_25m": "10/01/2026",
  "normatives": {
    "male": {
      "50m_pool": {
        "butterfly": {
          "50m": {
            "25-29": {"time": "25.81", "name": "פושקר ויטלי", "club": "הפועל ירושלים מכון וינגייט", "record_date": "07/09/2010"},
            "30-34": {"time": "26.73", "name": "קופלב יהונתן", "club": "מכבי חיפה לאומית", "record_date": "03/12/2022"},
            "45-49": {"time": "27.68", "name": "כהן אלי", "club": "מכבי עולם המים לאומית", "record_date": "03/12/2022"},
            "50-54": {"time": "27.43", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה קאדיז", "record_date": "9/18/2009"},
            "55-59": {"time": "27.98", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה איינדהובן", "record_date": "09/05/2013"},
            "60-64": {"time": "28.91", "name": "קרבקוב איגור", "club": "מכבי קרית ביאליק סלובניה", "record_date": "09/06/2018"},
            "65-69": {"time": "28.92", "name": "קרבקוב איגור", "club": "מכבי שוהם פוקואוקה יפן", "record_date": "08/07/2023"},
            "70-74": {"time": "32.19", "name": "ניסמן דב", "club": "אקוותיקים לאומית", "record_date": "7/26/2024"},
            "75-79": {"time": "39.38", "name": "תדיר יונה", "club": "אקוותיקים לאומית", "record_date": "08/07/2021"},
            "80-84": {"time": "46.63", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "7/15/2023"}
          },
          "100m": {
            "35-39": {"time": "58.29", "name": "פיינברג עידו", "club": "SWIM TLV לאומית", "record_date": "7/20/2019"},
            "40-44": {"time": "01:00.78", "name": "פיינברג עידו", "club": "בני הרצליה לאומית", "record_date": "7/15/2023"},
            "45-49": {"time": "01:03.14", "name": "טיטינשניידר רומן", "club": "עמותת השחייה שוהם בריכת טוטו מכבייה", "record_date": "7/13/2017"},
            "50-54": {"time": "01:04.43", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה אוקראינה", "record_date": "09/06/2011"},
            "55-59": {"time": "01:05.37", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה איינדהובן", "record_date": "09/03/2013"},
            "60-64": {"time": "01:08.02", "name": "קרבקוב איגור", "club": "מכבי קרית ביאליק לאומית", "record_date": "7/14/2018"},
            "65-69": {"time": "01:09.86", "name": "קרבקוב איגור", "club": "מכבי שוהם פוקואוקה יפן", "record_date": "08/08/2023"},
            "75-79": {"time": "01:53.51", "name": "שבתאי זאב", "club": "אקוותיקים לאומית", "record_date": "7/14/2018"},
            "80-84": {"time": "02:33.75", "name": "רורקה דוד", "club": "אקוותיקים לאומית", "record_date": "7/21/2022"}
          },
          "200m": {
            "30-34": {"time": "02:11.27", "name": "קציר דניאל", "club": "מכבי קרית ביאליק לאומית", "record_date": "4/16/2016"},
            "35-39": {"time": "02:16.23", "name": "קציר דניאל", "club": "מכבי חיפה רומא, איטליה", "record_date": "09/02/2022"},
            "40-44": {"time": "02:16.51", "name": "טיטינשניידר רומן", "club": "הפועל עולם המים איטליה", "record_date": "6/16/2012"},
            "45-49": {"time": "02:19.99", "name": "טיטינשניידר רומן", "club": "מכבי עמותת השחייה שוהם הונגריה", "record_date": "8/14/2017"},
            "50-54": {"time": "02:25.88", "name": "טיטינשניידר רומן", "club": "מכבי שוהם פוקואוקה יפן", "record_date": "08/10/2023"},
            "55-59": {"time": "02:48.80", "name": "יובל הרי", "club": "פלגי מכבי חיפה לאומית", "record_date": "7/15/2023"},
            "60-64": {"time": "02:50.32", "name": "ניסמן דב", "club": "ירושלים רבתי RUS Kazan,", "record_date": "8/13/2015"},
            "65-69": {"time": "02:54.18", "name": "ניסמן דב", "club": "אקוותיקים דרום קוריאה", "record_date": "8/17/2019"},
            "70-74": {"time": "04:01.41", "name": "ארבל ראובן", "club": "אקוותיקים גבעת-חיים וינגייט", "record_date": "2/16/2007"},
            "75-79": {"time": "04:49.46", "name": "ארבל ראובן", "club": "הפועל דולפין נהריה אוקראינה", "record_date": "09/07/2011"},
            "80-84": {"time": "05:25.04", "name": "ארבל ראובן", "club": "מכבי נהריה מכון וינגייט", "record_date": "7/14/2018"}
          }
        },
        "backstroke": {
          "50m": {
            "30-34": {"time": "26.17", "name": "קופלב יהונתן", "club": "מכבי חיפה לאומית", "record_date": "08/06/2021"},
            "35-39": {"time": "28.15", "name": "פיינברג עידו", "club": "SWIM TLV לאומית", "record_date": "7/19/2019"},
            "40-44": {"time": "28.61", "name": "פיינברג עידו", "club": "בני הרצליה לאומית", "record_date": "7/14/2023"},
            "45-49": {"time": "30.23", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה שוויץ", "record_date": "8/17/2005"},
            "50-54": {"time": "30.32", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה קאדיז", "record_date": "9/19/2009"},
            "55-59": {"time": "31.11", "name": "קרבקוב איגור", "club": "מכבי קרית ביאליק RUS Kazan,", "record_date": "8/13/2015"},
            "60-64": {"time": "31.59", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "7/20/2019"},
            "65-69": {"time": "31.55", "name": "קרבקוב איגור", "club": "מכבי שוהם פוקואוקה יפן", "record_date": "08/11/2023"},
            "70-74": {"time": "38.47", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים לאומית טוטו", "record_date": "7/31/2015"},
            "75-79": {"time": "40.54", "name": "שפע גרשון", "club": "אקוותיקים לאומית טוטו", "record_date": "7/14/2018"},
            "80-84": {"time": "42.32", "name": "שפע גרשון", "club": "אקוותיקים פוקואוקה יפן", "record_date": "08/09/2023"},
            "85-89": {"time": "01:00.77", "name": "זק יצחק", "club": "עולם המים סלובניה", "record_date": "09/07/2018"},
            "90-94": {"time": "01:05.29", "name": "זק יצחק", "club": "מכבי עולם המים לאומית", "record_date": "7/27/2024"}
          },
          "100m": {
            "30-34": {"time": "59.75", "name": "קופלב יהונתן", "club": "מכבי חיפה לאומית", "record_date": "08/06/2021"},
            "35-39": {"time": "01:06.69", "name": "וייזר שי", "club": "עולם המים לאומית טוטו", "record_date": "07/01/2016"},
            "45-49": {"time": "01:06.35", "name": "קוטק אריק", "club": "מכבי עולם המים לאומית", "record_date": "08/06/2021"},
            "50-54": {"time": "01:06.83", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה קאדיז", "record_date": "9/19/2009"},
            "55-59": {"time": "01:06.62", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה טורינו", "record_date": "08/06/2013"},
            "60-64": {"time": "01:10.47", "name": "קרבקוב איגור", "club": "מכבי קרית ביאליק סלובניה", "record_date": "09/04/2018"},
            "65-69": {"time": "01:08.80", "name": "קרבקוב איגור", "club": "מכבי שוהם פוקואוקה יפן", "record_date": "08/10/2023"},
            "70-74": {"time": "01:25.10", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים מכון וינגייט", "record_date": "7/24/2013"},
            "75-79": {"time": "01:27.01", "name": "שפע גרשון", "club": "אקוותיקים סלובניה", "record_date": "09/04/2018"},
            "80-84": {"time": "01:31.29", "name": "שפע גרשון", "club": "אקוותיקים פוקואוקה יפן", "record_date": "08/10/2023"}
          },
          "200m": {
            "35-39": {"time": "02:18.72", "name": "אושרי בן", "club": "SWIM TLV לאומית", "record_date": "7/13/2018"},
            "40-44": {"time": "02:27.29", "name": "קוטק אריק", "club": "עולם המים לאומית", "record_date": "7/13/2018"},
            "45-49": {"time": "02:27.38", "name": "קוטק אריק", "club": "מכבי עולם המים לאומית", "record_date": "7/21/2022"},
            "50-54": {"time": "02:28.01", "name": "טיטינשניידר רומן", "club": "מכבי שוהם פוקואוקה יפן", "record_date": "08/06/2023"},
            "55-59": {"time": "02:36.39", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה טורינו", "record_date": "08/04/2013"},
            "60-64": {"time": "02:38.80", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "7/19/2019"},
            "65-69": {"time": "02:53.49", "name": "קרמן רון", "club": "מכבי חיפה לאומית", "record_date": "7/27/2024"},
            "70-74": {"time": "02:55.43", "name": "ניסמן דב", "club": "אקוותיקים בלגרד, סרביה", "record_date": "6/29/2024"},
            "75-79": {"time": "03:52.48", "name": "חן יצחק", "club": "אקוותיקים לאומית", "record_date": "03/11/2022"},
            "80-84": {"time": "04:07.02", "name": "שבתאי זאב", "club": "אקוותיקים לאומית", "record_date": "03/11/2022"},
            "85-89": {"time": "04:59.69", "name": "זק יצחק", "club": "עולם המים בריכת לאומית טוטו", "record_date": "7/13/2018"},
            "90-94": {"time": "05:27.70", "name": "זק יצחק", "club": "מכבי עולם המים לאומית", "record_date": "7/14/2023"}
          }
        },
        "breaststroke": {
          "50m": {
            "30-34": {"time": "30.47", "name": "זוסמן ערן", "club": "עולם המים לאומית", "record_date": "7/20/2019"},
            "35-39": {"time": "29.52", "name": "זוסמן ערן", "club": "מכבי עולם המים לאומית", "record_date": "08/06/2021"},
            "45-49": {"time": "30.47", "name": "בן חיים", "club": "אסף הפועל עירוני הוד השרון לאומית", "record_date": "7/22/2022"},
            "50-54": {"time": "32.64", "name": "כרמל אופיר", "club": "חיפה בריכת טוטו מכבייה", "record_date": "7/13/2017"},
            "55-59": {"time": "33.51", "name": "כרמל אופיר", "club": "מכבי חיפה לאומית", "record_date": "03/12/2022"},
            "60-64": {"time": "35.80", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "7/20/2019"},
            "65-69": {"time": "37.17", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים אוסטרליה", "record_date": "4/22/2008"},
            "70-74": {"time": "41.55", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים לאומית טוטו", "record_date": "08/01/2015"},
            "75-79": {"time": "44.48", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "7/13/2018"},
            "80-84": {"time": "46.91", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "7/14/2023"},
            "85-89": {"time": "01:05.23", "name": "זק יצחק", "club": "עולם המים לאומית", "record_date": "7/14/2018"},
            "90-94": {"time": "01:17.47", "name": "זק יצחק", "club": "אקוותיקים לאומית", "record_date": "7/15/2023"}
          },
          "100m": {
            "35-39": {"time": "01:09.06", "name": "זוסמן ערן", "club": "מכבי עולם המים לאומית", "record_date": "7/14/2023"},
            "40-44": {"time": "01:13.53", "name": "הר-שי לירון", "club": "מכבי עולם המים לאומית", "record_date": "7/20/2022"},
            "45-49": {"time": "01:14.75", "name": "אלדר גיא", "club": "אנשים וספורט גן שמואל לאומית", "record_date": "7/20/2022"},
            "50-54": {"time": "01:16.65", "name": "כרמל אופיר", "club": "חיפה בריכת טוטו מכבייה", "record_date": "7/13/2017"},
            "55-59": {"time": "01:18.37", "name": "כרמל אופיר", "club": "מכבי חיפה לאומית", "record_date": "03/12/2022"},
            "60-64": {"time": "01:21.69", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים", "record_date": "8/13/2006"},
            "65-69": {"time": "01:21.75", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים אוסטרליה", "record_date": "4/20/2008"},
            "70-74": {"time": "01:34.02", "name": "שפע גרשון", "club": "אקוותיקים סלובניה", "record_date": "09/07/2018"},
            "75-79": {"time": "01:33.33", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "7/13/2018"},
            "80-84": {"time": "01:38.90", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "7/14/2023"}
          },
          "200m": {
            "35-39": {"time": "02:33.58", "name": "לוין יורי", "club": "מועדון ספורט דניה לאומית", "record_date": "7/21/2022"},
            "40-44": {"time": "02:40.83", "name": "הר-שי לירון", "club": "מכבי עולם המים לאומית", "record_date": "7/26/2024"},
            "50-54": {"time": "02:50.22", "name": "מנשר גרשון", "club": "מכבי פ.מ. רעות לאומית", "record_date": "7/21/2022"},
            "55-59": {"time": "02:51.10", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים פאלמה דה מאיורקה", "record_date": "04/01/2001"},
            "60-64": {"time": "02:55.26", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים איטליה", "record_date": "07/01/2004"},
            "65-69": {"time": "02:59.99", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים אוסטרליה", "record_date": "4/22/2008"},
            "70-74": {"time": "03:19.11", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים לאומית טוטו", "record_date": "09/05/2014"},
            "75-79": {"time": "03:26.50", "name": "שפע גרשון", "club": "אקוותיקים סלובניה", "record_date": "09/04/2018"},
            "80-84": {"time": "03:42.00", "name": "שפע גרשון", "club": "אקוותיקים פוקואוקה יפן", "record_date": "08/10/2023"}
          }
        },
        "freestyle": {
          "50m": {
            "30-34": {"time": "24.51", "name": "קופלב יהונתן", "club": "מכבי חיפה לאומית", "record_date": "08/06/2021"},
            "60-64": {"time": "27.28", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "7/20/2019"},
            "65-69": {"time": "27.10", "name": "קרבקוב איגור", "club": "מכבי שוהם פוקואוקה יפן", "record_date": "08/09/2023"},
            "70-74": {"time": "30.84", "name": "תדיר יונה", "club": "אקוותיקים גבעת-חיים מכון וינגייט", "record_date": "7/25/2013"},
            "75-79": {"time": "31.99", "name": "תדיר יונה", "club": "אקוותיקים לאומית", "record_date": "7/20/2019"},
            "80-84": {
              "time": "33.59",
              "name": "תדיר יונה",
              "club": "אקוותיקים קליפורניה, ארה\"ב",
              "record_date": "8/24/2024"
            },
            "85-89": {"time": "39.76", "name": "קליגמן יוסף", "club": "מכבי שוהם לאומית", "record_date": "7/14/2023"},
            "90-94": {"time": "01:13.08", "name": "זק יצחק", "club": "מכבי עולם המים לאומית", "record_date": "7/27/2024"}
          },
          "100m": {
            "30-34": {"time": "53.68", "name": "קופלב יהונתן", "club": "מכבי חיפה לאומית", "record_date": "08/06/2021"},
            "35-39": {"time": "57.40", "name": "קציר דניאל", "club": "מכבי חיפה לאומית", "record_date": "7/21/2022"},
            "40-44": {"time": "57.50", "name": "שטרן משה", "club": "מכבי עולם המים לאומית", "record_date": "03/11/2022"},
            "45-49": {"time": "57.90", "name": "וייס זוהר", "club": "אקוותיקים גבעת-חיים וינגייט", "record_date": "2/16/2007"},
            "50-54": {"time": "58.82", "name": "כהן אלי", "club": "מכבי עולם המים לאומית", "record_date": "7/14/2023"},
            "55-59": {"time": "01:00.93", "name": "שנהר יזהר", "club": "מאסטרס רחובות לאומית", "record_date": "7/19/2019"},
            "60-64": {"time": "01:03.49", "name": "גרטל משה", "club": "ירושלים רבתי", "record_date": "8/13/2006"},
            "65-69": {"time": "01:03.39", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "7/14/2023"},
            "70-74": {"time": "01:10.57", "name": "גרטל משה", "club": "ירושלים רבתי הונגריה", "record_date": "8/14/2017"},
            "75-79": {"time": "01:16.62", "name": "גרטל משה", "club": "ירושלים רבתי לאומית", "record_date": "08/06/2021"},
            "90-94": {"time": "02:46.15", "name": "רמון אמנון", "club": "ירושלים רבתי לאומית", "record_date": "7/26/2024"}
          },
          "200m": {
            "35-39": {"time": "02:02.12", "name": "קציר דניאל", "club": "מכבי חיפה לאומית", "record_date": "08/07/2021"},
            "50-54": {"time": "02:12.92", "name": "טיטינשניידר רומן", "club": "מכבי שוהם לאומית", "record_date": "7/14/2023"},
            "55-59": {"time": "02:15.22", "name": "וייס זוהר", "club": "אסא תל-אביב בריכת טוטו מכבייה", "record_date": "07/12/2017"},
            "60-64": {"time": "02:21.27", "name": "גרטל משה", "club": "ירושלים רבתי", "record_date": "8/13/2006"},
            "65-69": {"time": "02:24.53", "name": "קרמן רון", "club": "מכבי חיפה לאומית", "record_date": "7/27/2024"},
            "70-74": {"time": "02:32.32", "name": "גרטל משה", "club": "ירושלים רבתי הונגריה", "record_date": "8/14/2017"},
            "75-79": {"time": "02:47.20", "name": "גרטל משה", "club": "ירושלים רבתי לאומית", "record_date": "08/07/2021"},
            "80-84": {"time": "03:26.61", "name": "שבתאי זאב", "club": "אקוותיקים לאומית", "record_date": "7/20/2022"},
            "85-89": {"time": "03:16.32", "name": "קליגמן יוסף", "club": "מכבי שוהם פוקואוקה יפן", "record_date": "08/07/2023"}
          },
          "400m": {
            "25-29": {"time": "04:25.34", "name": "דגש רומן", "club": "חיפה מכון וינגייט", "record_date": "7/26/2013"},
            "30-34": {"time": "04:17.96", "name": "קציר דניאל", "club": "הפועל עמק-יזרעאל/נ.ע.ג RUS Kazan,", "record_date": "8/14/2015"},
            "35-39": {"time": "04:19.36", "name": "קציר דניאל", "club": "מכבי חיפה לאומית", "record_date": "7/21/2021"},
            "65-69": {"time": "05:07.78", "name": "ניסמן דב", "club": "אקוותיקים לאומית", "record_date": "08/06/2021"},
            "70-74": {"time": "05:26.71", "name": "גרטל משה", "club": "ירושלים רבתי הונגריה", "record_date": "8/14/2017"},
            "75-79": {"time": "05:56.32", "name": "גרטל משה", "club": "ירושלים רבתי לאומית", "record_date": "08/06/2021"},
            "80-84": {"time": "07:18.85", "name": "לנדאו יאיר", "club": "אקוותיקים לאומית", "record_date": "7/26/2024"},
            "85-89": {"time": "07:11.40", "name": "קליגמן יוסף", "club": "מכבי שוהם פוקואוקה יפן", "record_date": "08/11/2023"}
          },
          "800m": {
            "35-39": {"time": "08:58.31", "name": "קציר דניאל", "club": "מכבי חיפה לאומית", "record_date": "7/23/2021"},
            "40-44": {"time": "10:00.40", "name": "סלע אורי", "club": "עולם המים לאומית טוטו", "record_date": "6/30/2016"},
            "45-49": {"time": "09:53.68", "name": "טיטינשניידר רומן", "club": "מכבי שוהם לאומית", "record_date": "7/13/2018"},
            "75-79": {"time": "12:18.32", "name": "גרטל משה", "club": "ירושלים רבתי לאומית", "record_date": "08/07/2021"},
            "80-84": {"time": "14:41.61", "name": "קליגמן יוסף", "club": "מכבי שוהם דרום קוריאה", "record_date": "08/12/2019"},
            "85-89": {"time": "14:57.37", "name": "קליגמן יוסף", "club": "מכבי שוהם לאומית", "record_date": "7/15/2023"}
          },
          "1500m": {
            "25-29": {"time": "19:10.58", "name": "עופר אמיר", "club": "מכבי פ.מ. רעות מכון וינגייט", "record_date": "07/10/2012"},
            "30-34": {"time": "17:49.06", "name": "קציר דניאל", "club": "הפועל עמק-יזרעאל/נ.ע.ג לאומית טוטו", "record_date": "08/01/2015"},
            "35-39": {"time": "17:44.55", "name": "קציר דניאל", "club": "מכבי חיפה לאומית", "record_date": "18/07/2023"},
            "40-44": {"time": "19:04.15", "name": "סלע אורי", "club": "הפועל עולם המים לאומית טוטו", "record_date": "08/01/2015"},
            "45-49": {"time": "18:04.93", "name": "וייס זוהר", "club": "אקוותיקים גבעת-חיים מכון וינגייט", "record_date": "7/21/2010"},
            "50-54": {"time": "20:36.24", "name": "סנונית טל", "club": "אקוותיקים גבעת-חיים לאומית טוטו", "record_date": "08/01/2015"},
            "55-59": {"time": "22:01.08", "name": "מנור טומי", "club": "אקוותיקים גבעת-חיים מכון וינגייט", "record_date": "7/21/2010"},
            "60-64": {"time": "21:18.37", "name": "גרטל משה", "club": "ירושלים רבתי מכון וינגייט", "record_date": "7/22/2008"},
            "65-69": {"time": "22:34.54", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים מכון וינגייט", "record_date": "7/21/2010"},
            "70-74": {"time": "25:56.77", "name": "הרדי עמוס", "club": "אקוותיקים גבעת-חיים מכון וינגייט", "record_date": "07/10/2012"},
            "75-79": {"time": "33:32.30", "name": "ארבל ראובן", "club": "הפועל דולפין נהריה מכון וינגייט", "record_date": "08/06/2013"}
          }
        },
        "individual_medley": {
          "200m": {
            "60-64": {"time": "02:39.35", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "7/20/2019"},
            "65-69": {"time": "02:42.67", "name": "ניסמן דב", "club": "אקוותיקים לאומית", "record_date": "7/20/2022"},
            "70-74": {"time": "02:49.16", "name": "ניסמן דב", "club": "אקוותיקים בלגרד, סרביה", "record_date": "6/27/2024"},
            "75-79": {"time": "03:07.76", "name": "שפע גרשון", "club": "אקוותיקים סלובניה", "record_date": "09/05/2018"},
            "80-84": {"time": "03:20.69", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "7/15/2023"}
          },
          "400m": {
            "30-34": {"time": "04:53.61", "name": "קציר דניאל", "club": "מכבי קרית ביאליק לאומית", "record_date": "04/09/2016"},
            "35-39": {"time": "04:57.49", "name": "חליקה מיכאל", "club": "הפועל ירושלים לאומית טוטו", "record_date": "7/31/2015"},
            "40-44": {"time": "05:12.50", "name": "ליפשיץ יוחאי", "club": "אקוותיקים גבעת-חיים וינגייט", "record_date": "08/06/2007"},
            "45-49": {"time": "05:35.07", "name": "סלע אורי", "club": "עולם המים לאומית", "record_date": "7/14/2018"},
            "50-54": {"time": "05:23.85", "name": "סלע אורי", "club": "מכבי עולם המים לאומית", "record_date": "7/14/2023"},
            "55-59": {"time": "05:41.61", "name": "ליפשיץ יוחאי", "club": "אקוותיקים לאומית", "record_date": "03/11/2022"},
            "60-64": {"time": "05:45.86", "name": "ניסמן דב", "club": "ירושלים רבתי לאומית טוטו", "record_date": "07/01/2016"},
            "65-69": {"time": "05:51.00", "name": "ניסמן דב", "club": "אקוותיקים דרום קוריאה", "record_date": "8/14/2019"},
            "70-74": {"time": "05:59.49", "name": "ניסמן דב", "club": "אקוותיקים בלגרד, סרביה", "record_date": "6/28/2024"},
            "75-79": {"time": "08:04.26", "name": "שפע ראובן", "club": "אקוותיקים גבעת-חיים לאומית טוטו", "record_date": "7/29/2014"}
          }
        }
      },
      "25m_pool": {
        "butterfly": {
          "50m": {
            "35-39": {"time": "26.30", "name": "זוסמן ערן", "club": "מכבי עולם המים לאומית", "record_date": "04/05/2024"},
            "40-44": {"time": "26.44", "name": "זוסמן ערן", "club": "מכבי עולם המים לאומית", "record_date": "10/01/2026"},
            "85-89": {"time": "01:06.93", "name": "רורקה דוד", "club": "אקוותיקים לאומית", "record_date": "04/01/2025"},
            "25-29": {
              "time": "25.20",
              "name": "חוזמן אריאל",
              "club": "מתנ\"ס רמת הנגב לאומית",
              "record_date": "10/01/2026"
            },
            "30-34": {"time": "24.77", "name": "בלחסן ויקטור", "club": "מכבי חיפה לאומית", "record_date": "04/05/2024"},
            "45-49": {"time": "27.71", "name": "כהן אלי", "club": "עולם המים לאומית", "record_date": "3/19/2021"},
            "50-54": {"time": "28.01", "name": "כהן אלי", "club": "מכבי עולם המים לאומית", "record_date": "02/03/2023"},
            "55-59": {"time": "28.53", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה אולימפית", "record_date": "02/07/2014"},
            "60-64": {"time": "29.39", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "2/15/2019"},
            "65-69": {"time": "30.82", "name": "קרבקוב איגור", "club": "מכבי שוהם לובלין, פולין", "record_date": "11/12/2025"},
            "70-74": {"time": "33.40", "name": "ניסמן דב", "club": "אקוותיקים לאומית", "record_date": "04/01/2025"},
            "75-79": {"time": "37.25", "name": "תדיר יונה", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": "2/24/2018"},
            "80-84": {"time": "41.62", "name": "תדיר יונה", "club": "אקוותיקים לאומית", "record_date": "02/03/2023"}
          },
          "100m": {
            "25-29": {"time": "58.69", "name": "מלכינסון שיר", "club": "בני הרצליה לאומית", "record_date": "2/15/2020"},
            "30-34": {"time": "56.01", "name": "בלחסן ויקטור", "club": "מכבי חיפה לאומית", "record_date": "04/05/2024"},
            "70-74": {"time": "01:15.05", "name": "ניסמן דב", "club": "אקוותיקים פונטוודרה, ספרד", "record_date": "10/02/2024"},
            "85-89": {"time": "02:59.35", "name": "רורקה דוד", "club": "אקוותיקים לאומית", "record_date": "05/04/2025"},
            "35-39": {"time": "57.46", "name": "פיינברג עידו", "club": "שחייני מאסטרס לאומית", "record_date": "2/16/2019"},
            "40-44": {"time": "59.04", "name": "זוסמן ערן", "club": "מכבי עולם המים לאומית", "record_date": "09/01/2026"},
            "45-49": {"time": "01:02.77", "name": "זילברברג אהוד", "club": "מכבי פ.מ. רעות בית-אייל", "record_date": "2/22/2013"},
            "50-54": {"time": "01:04.79", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה ירושלים", "record_date": "6/25/2011"},
            "55-59": {"time": "01:05.58", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה בית-אייל", "record_date": "2/22/2013"},
            "60-64": {"time": "01:07.21", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "2/16/2019"},
            "65-69": {"time": "01:12.62", "name": "ניסמן דב", "club": "אקוותיקים לאומית", "record_date": "12/17/2021"},
            "75-79": {"time": "02:03.00", "name": "ארבל ראובן", "club": "מכבי נהריה עין גדי", "record_date": "3/18/2011"},
            "80-84": {"time": "02:35.15", "name": "ארבל ראובן", "club": "מכבי נהריה לאומית", "record_date": "2/24/2018"}
          },
          "200m": {
            "25-29": {"time": "02:12.15", "name": "קייזלר מכבי", "club": "חיפה לאומית", "record_date": "04/01/2025"},
            "30-34": {"time": "02:10.38", "name": "קציר דניאל", "club": "הפועל עמק-יזרעאל/נ.ע.ג לאומית", "record_date": "2/28/2015"},
            "35-39": {"time": "02:13.27", "name": "קציר דניאל", "club": "מכבי חיפה לאומית", "record_date": "02/04/2023"},
            "40-44": {"time": "02:14.48", "name": "קציר דניאל", "club": "מכבי חיפה לובלין, פולין", "record_date": "13/12/2025"},
            "45-49": {"time": "02:21.01", "name": "טיטינשניידר רומן", "club": "מכבי שוהם לאומית", "record_date": "2/15/2019"},
            "50-54": {"time": "02:28.61", "name": "טיטינשניידר רומן", "club": "מכבי שוהם לאומית", "record_date": "02/04/2023"},
            "55-59": {"time": "02:40.14", "name": "קרבקוב איגור", "club": "מכבי קרית ביאליק בית-אייל", "record_date": "2/21/2016"},
            "60-64": {"time": "02:46.03", "name": "ניסמן דב", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": "01/07/2017"},
            "65-69": {"time": "02:50.56", "name": "ניסמן דב", "club": "אקוותיקים לאומית", "record_date": "02/04/2023"},
            "70-74": {"time": "02:50.92", "name": "ניסמן דב", "club": "אקוותיקים לאומית", "record_date": "04/06/2024"},
            "80-84": {"time": "05:15.89", "name": "ארבל ראובן", "club": "מכבי נהריה לאומית", "record_date": "2/24/2018"}
          }
        },
        "backstroke": {
          "50m": {
            "25-29": {"time": "24.78", "name": "חירותי מירון", "club": "מכבי חיפה לאומית", "record_date": "04/05/2024"},
            "30-34": {"time": "24.51", "name": "טומרקין יעקב", "club": "מכבי אשדוד לאומית", "record_date": "04/05/2024"},
            "35-39": {"time": "25.88", "name": "קופלב יהונתן", "club": "מכבי עולם המים לאומית", "record_date": "10/01/2026"},
            "40-44": {"time": "29.22", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה", "record_date": "10/19/1998"},
            "45-49": {"time": "29.36", "name": "קוטק אריק", "club": "WEST SWIM לאומית", "record_date": "2/15/2020"},
            "50-54": {"time": "29.98", "name": "קוטק אריק", "club": "מכבי עולם המים לאומית", "record_date": "03/01/2025"},
            "55-59": {"time": "30.68", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה אולימפית", "record_date": "02/07/2014"},
            "60-64": {"time": "31.21", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "2/15/2020"},
            "65-69": {"time": "31.72", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "04/05/2024"},
            "70-74": {"time": "39.47", "name": "טוביס אילון", "club": "מכבי חיפה לאומית", "record_date": "2/15/2020"},
            "75-79": {"time": "39.67", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "2/16/2019"},
            "80-84": {"time": "42.13", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "02/04/2023"},
            "85-89": {"time": "01:01.57", "name": "זק יצחק", "club": "WEST SWIM לאומית", "record_date": "2/14/2020"},
            "90-94": {"time": "01:05.63", "name": "זק יצחק", "club": "מכבי עולם המים לאומית", "record_date": "02/04/2023"}
          },
          "100m": {
            "25-29": {"time": "56.86", "name": "מלכה אורן", "club": "מכבי חיפה לאומית", "record_date": "02/03/2023"},
            "40-44": {"time": "01:01.82", "name": "זוסמן ערן", "club": "מכבי עולם המים לאומית", "record_date": "09/01/2026"},
            "85-89": {"time": "02:15.01", "name": "זק יצחק", "club": "WEST SWIM לאומית", "record_date": "2/15/2020"},
            "90-94": {"time": "02:23.51", "name": "זק יצחק", "club": "מכבי עולם המים לאומית", "record_date": "02/03/2023"},
            "30-34": {"time": "56.89", "name": "קופלב יהונתן", "club": "מכבי חיפה לאומית", "record_date": "12/17/2021"},
            "35-39": {"time": "57.75", "name": "קופלב יהונתן", "club": "מכבי עולם המים לאומית", "record_date": "09/01/2026"},
            "45-49": {"time": "01:03.51", "name": "קוטק אריק", "club": "WEST SWIM לאומית", "record_date": "2/15/2020"},
            "50-54": {"time": "01:04.88", "name": "קוטק אריק", "club": "מכבי עולם המים לאומית", "record_date": "03/01/2025"},
            "55-59": {"time": "01:08.32", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה אולימפית", "record_date": "02/07/2014"},
            "60-64": {"time": "01:08.01", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "2/16/2019"},
            "65-69": {"time": "01:09.47", "name": "קרבקוב איגור", "club": "מכבי שוהם לובלין, פולין", "record_date": "12/12/2025"},
            "70-74": {"time": "01:21.63", "name": "ניסמן דב", "club": "אקוותיקים לאומית", "record_date": "04/06/2024"},
            "75-79": {"time": "01:26.38", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "2/15/2020"},
            "80-84": {"time": "01:32.63", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "02/03/2023"}
          },
          "200m": {
            "25-29": {"time": "02:09.55", "name": "רויחל סלבו", "club": "אסא תל-אביב לאומית", "record_date": "2/28/2015"},
            "30-34": {"time": "02:13.35", "name": "רויחל סלבו", "club": "אסא תל-אביב לאומית", "record_date": "2/14/2020"},
            "35-39": {"time": "02:12.16", "name": "אושרי בן", "club": "SWIM TLV לאומית", "record_date": "2/24/2018"},
            "40-44": {"time": "02:18.98", "name": "קוטק אריק", "club": "עולם המים לאומית", "record_date": "2/15/2019"},
            "45-49": {"time": "02:17.65", "name": "קוטק אריק", "club": "WEST SWIM לאומית", "record_date": "2/14/2020"},
            "50-54": {"time": "02:21.63", "name": "קוטק אריק", "club": "מכבי עולם המים לאומית", "record_date": "04/01/2025"},
            "55-59": {"time": "02:28.44", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה בית-אייל", "record_date": "2/22/2013"},
            "60-64": {"time": "02:34.84", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "2/15/2019"},
            "65-69": {"time": "02:39.11", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "02/04/2023"},
            "70-74": {"time": "02:50.28", "name": "ניסמן דב", "club": "אקוותיקים לאומית", "record_date": "10/01/2026"},
            "75-79": {"time": "03:38.34", "name": "שפע ראובן", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": "2/28/2015"},
            "80-84": {"time": "03:27.39", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "04/05/2024"},
            "85-89": {"time": "04:51.26", "name": "זק יצחק", "club": "WEST SWIM לאומית", "record_date": "2/14/2020"},
            "90-94": {"time": "05:08.21", "name": "זק יצחק", "club": "מכבי עולם המים לאומית", "record_date": "02/04/2023"}
          }
        },
        "breaststroke": {
          "50m": {
            "25-29": {"time": "29.21", "name": "רובינשטיין פליקס", "club": "ספורטן פתח-תקוה לאומית", "record_date": "2/28/2015"},
            "40-44": {"time": "29.24", "name": "זוסמן ערן", "club": "מכבי עולם המים לאומית", "record_date": "03/01/2025"},
            "30-34": {"time": "28.90", "name": "זוסמן ערן", "club": "הפועל דולפין נתניה לאומית", "record_date": "2/28/2015"},
            "35-39": {"time": "28.70", "name": "זוסמן ערן", "club": "מכבי עולם המים לאומית", "record_date": "12/19/2022"},
            "45-49": {"time": "30.05", "name": "בן חיים", "club": "אסף SWIM TLV לובלין, פולין", "record_date": "10/12/2025"},
            "50-54": {"time": "32.47", "name": "כרמל אופיר", "club": "מכבי חיפה לאומית", "record_date": "3/20/2021"},
            "55-59": {"time": "33.05", "name": "כרמל אופיר", "club": "מכבי חיפה לאומית", "record_date": "02/03/2023"},
            "60-64": {"time": "34.24", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים גבעת חיים", "record_date": "10/19/2003"},
            "65-69": {"time": "35.05", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "04/06/2024"},
            "70-74": {"time": "39.32", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": "2/28/2015"},
            "75-79": {"time": "43.15", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "8/15/2020"},
            "80-84": {"time": "48.27", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "09/01/2026"},
            "85-89": {"time": "54.76", "name": "שבתאי זאב", "club": "אקוותיקים לאומית", "record_date": "09/01/2026"},
            "90-94": {"time": "01:12.49", "name": "זק יצחק", "club": "מכבי עולם המים לאומית", "record_date": "02/03/2023"}
          },
          "100m": {
            "25-29": {"time": "01:06.99", "name": "חביב אמיר", "club": "הפועל בת ים לאומית", "record_date": "04/04/2025"},
            "30-34": {"time": "01:05.87", "name": "שגלוב ירון", "club": "מכבי חיפה לאומית", "record_date": "02/04/2023"},
            "85-89": {"time": "01:56.09", "name": "רורקה דוד", "club": "אקוותיקים לאומית", "record_date": "10/01/2026"},
            "35-39": {"time": "01:05.40", "name": "זוסמן ערן", "club": "מכבי עולם המים לאומית", "record_date": "12/18/2021"},
            "40-44": {"time": "01:06.17", "name": "זוסמן ערן", "club": "מכבי עולם המים לאומית", "record_date": "04/01/2025"},
            "45-49": {"time": "01:10.04", "name": "הר-שי לירון", "club": "מכבי עולם המים לובלין, פולין", "record_date": "11/12/2025"},
            "50-54": {"time": "01:13.36", "name": "כרמל אופיר", "club": "מכבי חיפה לאומית", "record_date": "03/04/2018"},
            "55-59": {"time": "01:14.96", "name": "קרבקוב איגור", "club": "מכבי קרית ביאליק לאומית", "record_date": "2/27/2015"},
            "60-64": {"time": "01:17.97", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים אילת", "record_date": "10/02/2003"},
            "65-69": {"time": "01:20.41", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים גבעת חיים", "record_date": "6/27/2008"},
            "70-74": {"time": "01:26.54", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": "2/27/2015"},
            "75-79": {"time": "01:30.97", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "2/24/2018"},
            "80-84": {"time": "01:50.64", "name": "שבתאי זאב", "club": "אקוותיקים לאומית", "record_date": "02/04/2023"}
          },
          "200m": {
            "25-29": {"time": "02:32.01", "name": "דמבינסקי עומר", "club": "מכבי פ.מ. רעות בית-אייל", "record_date": "02/12/2010"},
            "30-34": {"time": "02:32.66", "name": "דמבינסקי עומר", "club": "מכבי פ.מ. רעות לאומית", "record_date": "2/27/2015"},
            "45-49": {"time": "02:32.19", "name": "הר-שי לירון", "club": "מכבי עולם המים לאומית", "record_date": "03/01/2025"},
            "85-89": {"time": "04:19.05", "name": "שבתאי זאב", "club": "אקוותיקים לאומית", "record_date": "09/01/2026"},
            "35-39": {"time": "02:29.45", "name": "לוין יורי", "club": "מועדון ספורט דניה לאומית", "record_date": "04/05/2024"},
            "40-44": {"time": "02:31.12", "name": "הר-שי לירון", "club": "מכבי עולם המים לאומית", "record_date": "04/05/2024"},
            "50-54": {"time": "02:41.83", "name": "מנשר גרשון", "club": "מכבי פ.מ. רעות לאומית", "record_date": "12/17/2021"},
            "55-59": {"time": "02:47.66", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים אילת", "record_date": "10/19/2001"},
            "60-64": {"time": "02:56.63", "name": "ליפשיץ יוחאי", "club": "אקוותיקים לאומית", "record_date": "04/05/2024"},
            "65-69": {"time": "02:54.56", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים גבעת חיים", "record_date": "6/27/2008"},
            "70-74": {"time": "03:10.86", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים בית-אייל", "record_date": "2/22/2013"},
            "75-79": {"time": "03:26.40", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "2/15/2019"},
            "80-84": {"time": "04:25.25", "name": "כרמל דן", "club": "הפועל עולם המים", "record_date": "2/24/2012"}
          }
        },
        "freestyle": {
          "50m": {
            "25-29": {"time": "23.77", "name": "קלונטרוב זיו", "club": "הפועל כפר סבא ב. ב. לאומית", "record_date": "09/01/2026"},
            "35-39": {"time": "24.47", "name": "וייס זוהר", "club": "אקוותיקים גבעת-חיים ירושלים", "record_date": "10/19/2000"},
            "40-44": {"time": "24.49", "name": "שטרן משה", "club": "מכבי עולם המים לאומית", "record_date": "02/04/2023"},
            "45-49": {"time": "25.16", "name": "שטרן משה", "club": "מכבי עולם המים לובלין, פולין", "record_date": "13/12/2025"},
            "50-54": {"time": "25.24", "name": "משקיף טל", "club": "מכבי חיפה לאומית", "record_date": "2/24/2018"},
            "55-59": {"time": "26.32", "name": "קרבקוב איגור", "club": "מכבי קרית ביאליק לאומית", "record_date": "2/28/2015"},
            "30-34": {"time": "22.99", "name": "בלחסן ויקטור", "club": "מכבי חיפה לאומית", "record_date": "04/06/2024"},
            "60-64": {"time": "27.09", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "2/15/2020"},
            "65-69": {"time": "27.41", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "04/06/2024"},
            "70-74": {"time": "30.86", "name": "תדיר יונה", "club": "אקוותיקים גבעת-חיים קליפורניה", "record_date": "12/05/2014"},
            "75-79": {"time": "31.68", "name": "תדיר יונה", "club": "אקוותיקים לאומית", "record_date": "2/24/2018"},
            "80-84": {"time": "33.46", "name": "תדיר יונה", "club": "אקוותיקים לאומית", "record_date": "02/04/2023"},
            "85-89": {"time": "49.28", "name": "אביגד ראובן", "club": "חברת חשמל צפון גבעת חיים", "record_date": "04/07/2005"},
            "90-94": {"time": "50.94", "name": "זק יצחק", "club": "מכבי עולם המים לאומית", "record_date": "10/01/2026"}
          },
          "100m": {
            "25-29": {"time": "52.28", "name": "קיזלר מכבי", "club": "חיפה לאומית", "record_date": "02/03/2023"},
            "80-84": {"time": "01:21.94", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "04/01/2025"},
            "85-89": {"time": "01:37.25", "name": "קליגמן יוסף", "club": "מכבי שוהם פוקואוקה יפן", "record_date": "08/07/2023"},
            "30-34": {"time": "51.47", "name": "בלחסן ויקטור", "club": "מכבי חיפה לאומית", "record_date": "04/05/2024"},
            "35-39": {"time": "51.99", "name": "קופלב יהונתן", "club": "מכבי עולם המים לאומית", "record_date": "10/01/2026"},
            "40-44": {"time": "54.30", "name": "וייס זוהר", "club": "אקוותיקים גבעת-חיים עירונית אילת", "record_date": "10/27/2004"},
            "45-49": {"time": "55.72", "name": "שטרן משה", "club": "מכבי עולם המים לובלין, פולין", "record_date": "14/12/2025"},
            "50-54": {"time": "56.72", "name": "כהן אלי", "club": "מכבי עולם המים לאומית", "record_date": "02/03/2023"},
            "55-59": {"time": "59.11", "name": "שנהר יזהר", "club": "מאסטרס רחובות לאומית", "record_date": "03/04/2018"},
            "60-64": {"time": "01:01.88", "name": "נבון גיא", "club": "מכבי חיפה לאומית", "record_date": "10/01/2026"},
            "65-69": {"time": "01:05.65", "name": "גרטל משה", "club": "ירושלים רבתי עין גדי", "record_date": "3/18/2011"},
            "70-74": {"time": "01:08.15", "name": "גרטל משה", "club": "ירושלים רבתי לאומית", "record_date": "01/06/2017"},
            "75-79": {"time": "01:13.46", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": "03/04/2018"},
            "90-94": {"time": "02:32.48", "name": "רמון אמנון", "club": "ירושלים רבתי לאומית", "record_date": "10/01/2026"}
          },
          "200m": {
            "25-29": {"time": "01:56.76", "name": "קיזלר מכבי", "club": "חיפה לאומית", "record_date": "03/01/2025"},
            "30-34": {"time": "01:58.02", "name": "קציר דניאל", "club": "הפועל עמק-יזרעאל/נ.ע.ג לאומית", "record_date": "2/27/2015"},
            "40-44": {"time": "01:58.64", "name": "וייס זוהר", "club": "אקוותיקים גבעת-חיים גבעת חיים", "record_date": "10/19/2003"},
            "45-49": {"time": "02:05.24", "name": "כהן אלי", "club": "עולם המים לאומית", "record_date": "3/20/2021"},
            "35-39": {"time": "01:57.61", "name": "קופלב יהונתן", "club": "מכבי עולם המים לאומית", "record_date": "09/01/2026"},
            "50-54": {"time": "02:07.53", "name": "כהן אלי", "club": "מכבי עולם המים לאומית", "record_date": "02/04/2023"},
            "55-59": {"time": "02:12.64", "name": "וייס זוהר", "club": "אסא תל-אביב לאומית", "record_date": "03/04/2018"},
            "60-64": {"time": "02:20.98", "name": "ליפשיץ יוחאי", "club": "אקוותיקים לאומית", "record_date": "04/06/2024"},
            "65-69": {"time": "02:21.12", "name": "קרמן רון", "club": "מכבי חיפה לאומית", "record_date": "04/06/2024"},
            "70-74": {"time": "02:31.37", "name": "גרטל משה", "club": "ירושלים רבתי לאומית", "record_date": "01/06/2017"},
            "75-79": {"time": "02:57.53", "name": "גרטל משה", "club": "ירושלים רבתי לאומית", "record_date": "04/06/2024"},
            "80-84": {"time": "03:13.81", "name": "לנדאו יאיר", "club": "אקוותיקים לאומית", "record_date": "04/06/2024"}
          },
          "400m": {
            "40-44": {"time": "04:14.81", "name": "קציר דניאל", "club": "מכבי חיפה לובלין, פולין", "record_date": "13/12/2025"},
            "45-49": {"time": "04:33.63", "name": "טיטינשניידר רומן", "club": "מכבי עמותת השחייה שהם לאומית", "record_date": "01/07/2017"},
            "50-54": {"time": "04:34.88", "name": "כהן אלי", "club": "מכבי עולם המים לאומית", "record_date": "04/06/2024"},
            "55-59": {"time": "04:36.35", "name": "וייס זוהר", "club": "אסא תל-אביב לאומית", "record_date": "01/07/2017"},
            "60-64": {"time": "05:00.56", "name": "ניסמן דב", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": "01/07/2017"},
            "25-29": {
              "time": "04:16.77",
              "name": "איילון שילו",
              "club": "ממ\"ג שורק אשדות יעקב",
              "record_date": "11/14/2006"
            },
            "30-34": {"time": "04:13.40", "name": "קציר דניאל", "club": "מכבי קרית ביאליק לאומית", "record_date": "2/24/2018"},
            "35-39": {"time": "04:14.10", "name": "קציר דניאל", "club": "מכבי חיפה לאומית", "record_date": "12/19/2022"},
            "65-69": {"time": "05:03.89", "name": "ניסמן דב", "club": "אקוותיקים לאומית", "record_date": "12/18/2021"},
            "70-74": {"time": "05:19.39", "name": "ניסמן דב", "club": "אקוותיקים לאומית", "record_date": "09/01/2026"},
            "75-79": {"time": "06:00.91", "name": "גרטל משה", "club": "ירושלים רבתי לאומית", "record_date": "3/19/2021"},
            "80-84": {"time": "07:15.03", "name": "שבתאי זאב", "club": "אקוותיקים לאומית", "record_date": "02/04/2023"}
          },
          "800m": {
            "25-29": {"time": "09:25.96", "name": "כהן שגיא", "club": "מכבי חיפה לאומית", "record_date": "12/17/2021"},
            "30-34": {"time": "08:50.25", "name": "קציר דניאל", "club": "מכבי קרית ביאליק לאומית", "record_date": "2/24/2018"},
            "50-54": {"time": "09:39.94", "name": "סלע אורי", "club": "מכבי עולם המים לאומית", "record_date": "04/05/2024"},
            "55-59": {"time": "09:40.28", "name": "וייס זוהר", "club": "אסא תל-אביב לאומית", "record_date": "2/24/2018"},
            "60-64": {"time": "10:15.77", "name": "ניסמן דב", "club": "ירושלים רבתי בית-אייל", "record_date": "2/21/2016"},
            "65-69": {"time": "10:32.88", "name": "ניסמן דב", "club": "אקוותיקים דרום קוריאה", "record_date": "08/12/2019"},
            "70-74": {"time": "10:50.03", "name": "ניסמן דב", "club": "אקוותיקים בלגרד, סרביה", "record_date": "6/26/2024"},
            "35-39": {"time": "08:50.13", "name": "קציר דניאל", "club": "מכבי חיפה לאומית", "record_date": "12/19/2022"},
            "40-44": {"time": "08:48.97", "name": "קציר דניאל", "club": "מכבי חיפה לובלין, פולין", "record_date": "10/12/2025"},
            "45-49": {"time": "09:18.22", "name": "חליקה מיכאל", "club": "הפועל עירוני מודיעין לאומית", "record_date": "04/05/2024"},
            "75-79": {"time": "12:51.10", "name": "גרטל משה", "club": "ירושלים רבתי לאומית", "record_date": "04/05/2024"},
            "80-84": {"time": "14:58.28", "name": "שבתאי זאב", "club": "אקוותיקים לאומית", "record_date": "12/17/2021"}
          },
          "1500m": {
            "30-34": {"time": "17:33.68", "name": "עופר אמיר", "club": "מכבי פ.מ. רעות וינגייט", "record_date": "2/21/2015"},
            "40-44": {"time": "18:46.45", "name": "סלע אורי", "club": "הפועל עולם המים וינגייט", "record_date": "2/21/2015"},
            "45-49": {"time": "20:35.32", "name": "גרנות שגיא", "club": "אקוותיקים גבעת-חיים וינגייט", "record_date": "2/21/2015"},
            "50-54": {"time": "20:09.01", "name": "סנונית טל", "club": "אקוותיקים גבעת-חיים וינגייט", "record_date": "2/21/2015"}
          }
        },
        "individual_medley": {
          "200m": {
            "25-29": {"time": "02:11.74", "name": "קייזלר מכבי", "club": "חיפה לאומית", "record_date": "03/01/2025"},
            "30-34": {"time": "02:11.61", "name": "קופלב יהונתן", "club": "מכבי חיפה לאומית", "record_date": "12/18/2021"},
            "35-39": {"time": "02:15.54", "name": "קציר דניאל", "club": "הפועל עמק יזרעאל לאומית", "record_date": "2/15/2020"},
            "40-44": {"time": "02:18.98", "name": "הר-שי לירון", "club": "עולם המים לאומית", "record_date": "3/19/2021"},
            "45-49": {"time": "02:20.14", "name": "הר-שי לירון", "club": "מכבי עולם המים לאומית", "record_date": "03/01/2025"},
            "50-54": {"time": "02:26.59", "name": "כרמל אופיר", "club": "מכבי חיפה לאומית", "record_date": "2/16/2019"},
            "55-59": {"time": "02:29.41", "name": "כרמל אופיר", "club": "מכבי חיפה לאומית", "record_date": "02/04/2023"},
            "60-64": {"time": "02:36.84", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "2/15/2020"},
            "65-69": {"time": "02:39.54", "name": "קרמן רון", "club": "מכבי חיפה לאומית", "record_date": "04/06/2024"},
            "70-74": {"time": "02:43.64", "name": "ניסמן דב", "club": "אקוותיקים פונטוודרה, ספרד", "record_date": "08/02/2024"},
            "75-79": {"time": "03:01.83", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "2/16/2019"},
            "80-84": {"time": "03:23.52", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "02/04/2023"},
            "85-89": {"time": "04:27.77", "name": "שבתאי זאב", "club": "אקוותיקים לאומית", "record_date": "10/01/2026"}
          },
          "400m": {
            "25-29": {"time": "05:14.38", "name": "קימל אלון", "club": "מכבי פ.מ. רעות לאומית טוטו", "record_date": "7/31/2015"},
            "80-84": {"time": "09:58.50", "name": "ארבל ראובן", "club": "מכבי נהריה בית-אייל", "record_date": "2/21/2016"},
            "30-34": {"time": "04:48.81", "name": "קציר דניאל", "club": "מכבי קרית ביאליק לאומית", "record_date": "2/23/2018"},
            "35-39": {"time": "04:46.77", "name": "קציר דניאל", "club": "הפועל עמק יזרעאל לאומית", "record_date": "8/19/2020"},
            "40-44": {"time": "04:57.17", "name": "קציר דניאל", "club": "מכבי חיפה לאומית", "record_date": "04/01/2025"},
            "45-49": {"time": "05:02.24", "name": "הר-שי לירון", "club": "מכבי עולם המים לאומית", "record_date": "04/01/2025"},
            "50-54": {"time": "05:16.29", "name": "טיטינשניידר רומן", "club": "מכבי שוהם לאומית", "record_date": "02/04/2023"},
            "55-59": {"time": "05:23.95", "name": "ליפשיץ יוחאי", "club": "אקוותיקים לאומית", "record_date": "3/20/2021"},
            "60-64": {"time": "05:33.74", "name": "ניסמן דב", "club": "ירושלים רבתי בית-אייל", "record_date": "2/21/2016"},
            "65-69": {"time": "05:40.37", "name": "ניסמן דב", "club": "אקוותיקים לאומית", "record_date": "02/04/2023"},
            "70-74": {"time": "05:54.02", "name": "ניסמן דב", "club": "אקוותיקים פונטוודרה, ספרד", "record_date": "10/02/2024"}
          },
          "100m": {
            "25-29": {
              "time": "58.59",
              "name": "חוזמן אריאל",
              "club": "מתנ\"ס רמת הנגב לאומית",
              "record_date": "09/01/2026"
            },
            "30-34": {"time": "54.79", "name": "טומרקין יעקב", "club": "מכבי אשדוד לאומית", "record_date": "04/05/2024"},
            "35-39": {"time": "59.23", "name": "זוסמן ערן", "club": "מכבי עולם המים לאומית", "record_date": "12/18/2021"},
            "40-44": {"time": "59.31", "name": "זוסמן ערן", "club": "מכבי עולם המים לאומית", "record_date": "03/01/2025"},
            "45-49": {"time": "01:04.50", "name": "הר-שי לירון", "club": "מכבי עולם המים לובלין, פולין", "record_date": "10/12/2025"},
            "50-54": {"time": "01:05.67", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה עין גדי", "record_date": "3/18/2011"},
            "55-59": {"time": "01:05.70", "name": "קרבקוב איגור", "club": "הפועל דולפין נהריה בית-אייל", "record_date": "2/22/2013"},
            "60-64": {"time": "01:07.85", "name": "קרבקוב איגור", "club": "מכבי קרית ביאליק לאומית", "record_date": "2/24/2018"},
            "65-69": {"time": "01:10.14", "name": "קרבקוב איגור", "club": "מכבי שוהם לאומית", "record_date": "02/03/2023"},
            "70-74": {"time": "01:17.31", "name": "ניסמן דב", "club": "אקוותיקים פונטוודרה, ספרד", "record_date": "09/02/2024"},
            "75-79": {"time": "01:22.84", "name": "שפע גרשון", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": "2/24/2018"},
            "80-84": {"time": "01:28.67", "name": "שפע גרשון", "club": "אקוותיקים לאומית", "record_date": "02/03/2023"},
            "85-89": {"time": "01:51.93", "name": "שבתאי זאב", "club": "אקוותיקים לאומית", "record_date": "09/01/2026"}
          }
        }
      }
    },
    "female": {
      "25m_pool": {
        "butterfly": {
          "50m": {
            "25-29": {"time": "29.94", "name": "אלוני סהר", "club": "הפועל עמק-חפר", "record_date": "10/20/2000"},
            "30-34": {"time": "28.55", "name": "גוסטמלסקי אניה", "club": "הפועל דולפין נתניה אולימפית", "record_date": "02/07/2014"},
            "35-39": {"time": "31.15", "name": "בירקאן ליאור", "club": "הפועל ירושלים ירושלים", "record_date": "10/20/2001"},
            "40-44": {"time": "28.66", "name": "גוסטמלסקי אניה", "club": "מכבי עולם המים לאומית", "record_date": ""},
            "45-49": {"time": "29.07", "name": "גוסטמלסקי אניה", "club": "מכבי עולם המים לאומית", "record_date": "10/01/2026"},
            "50-54": {"time": "32.28", "name": "פסמני אולגה", "club": "מאסטרס רחובות לאומית", "record_date": "02/03/2023"},
            "55-59": {"time": "33.85", "name": "טוביס-לאונוב איבונה", "club": "הפועל גבעתיים אילת", "record_date": "10/02/2003"},
            "60-64": {"time": "37.39", "name": "ניסמן רונדה", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": "01/07/2017"},
            "65-69": {"time": "38.04", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": ""},
            "70-74": {"time": "40.79", "name": "טוביס לאונוב", "club": "איבונה מאסטרס רחובות לאומית", "record_date": "2/15/2019"},
            "75-79": {"time": "53.67", "name": "ברנשטיין לאה", "club": "מכבי פ.מ. רעות לאומית", "record_date": "3/19/2021"},
            "80-84": {"time": "56.91", "name": "ברנשטיין לאה", "club": "מכבי פ.מ. רעות לאומית", "record_date": "10/01/2026"}
          },
          "100m": {
            "25-29": {"time": "01:06.94", "name": "קרטין ליהי", "club": "עולם המים לאומית", "record_date": ""},
            "30-34": {"time": "01:09.56", "name": "בירקאן ליאור", "club": "הפועל ירושלים", "record_date": "10/20/1993"},
            "35-39": {"time": "01:07.69", "name": "בירקאן ליאור", "club": "הפועל ירושלים ירושלים", "record_date": "10/20/2001"},
            "40-44": {"time": "01:10.52", "name": "סגל דורי", "club": "עדי מכבי חיפה לאומית", "record_date": "02/03/2023"},
            "45-49": {"time": "01:13.53", "name": "בירקאן ליאור", "club": "הפועל ירושלים בית-אייל", "record_date": "2/24/2012"},
            "55-59": {"time": "01:20.75", "name": "קוסביצקי יעל", "club": "מכבי שוהם לאומית", "record_date": "09/01/2026"},
            "60-64": {"time": "01:25.60", "name": "ניסמן רונדה", "club": "אקוותיקים גבעת-חיים אולימפית", "record_date": "02/07/2014"},
            "65-69": {"time": "01:46.54", "name": "זיורוב לובוב", "club": "מכבי כפר המכביה לאומית", "record_date": "09/01/2026"},
            "70-74": {"time": "01:49.14", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "03/01/2025"},
            "75-79": {"time": "02:13.95", "name": "ברנשטיין לאה", "club": "מכבי פ.מ. רעות לאומית", "record_date": ""}
          },
          "200m": {
            "25-29": {"time": "02:40.42", "name": "צהרי מיכל", "club": "ירושלים", "record_date": "10/20/2000"},
            "30-34": {"time": "02:39.47", "name": "גוטמן מאירי", "club": "זיוית מכבי חיפה מכון וינגייט", "record_date": "7/21/2012"},
            "35-39": {"time": "02:30.60", "name": "גוטמן מאירי", "club": "זיוית מכבי חיפה לאומית", "record_date": "2/28/2015"},
            "40-44": {"time": "02:46.85", "name": "גוטמן מאירי", "club": "זיוית אקוותיקים גבעת-חיים לאומית", "record_date": ""},
            "45-49": {"time": "02:42.94", "name": "גוטמן מאירי", "club": "זיוית אקוותיקים לאומית", "record_date": "04/06/2024"},
            "50-54": {"time": "03:03.51", "name": "קוסביצקי יעל", "club": "מכבי שוהם לאומית", "record_date": "04/01/2025"},
            "55-59": {"time": "03:05.04", "name": "קוסביצקי יעל", "club": "מכבי שוהם לאומית", "record_date": "10/01/2026"}
          }
        },
        "backstroke": {
          "50m": {
            "25-29": {
              "time": "31.87",
              "name": "שפייזר טל",
              "club": "הפועל ירושלים ארה\"ב",
              "record_date": ""
            },
            "30-34": {"time": "30.52", "name": "גוסטמלסקי אניה", "club": "הפועל דולפין נתניה אולימפית", "record_date": "02/07/2014"},
            "35-39": {"time": "30.73", "name": "נטליה אדייקינה", "club": "מכבי חיפה לאומית", "record_date": "04/01/2025"},
            "70-74": {"time": "42.48", "name": "טוביס לאונוב", "club": "איבונה מאסטרס רחובות לאומית", "record_date": "2/15/2019"},
            "40-44": {"time": "30.22", "name": "גוסטמלסקי אניה", "club": "מכבי עולם המים לאומית", "record_date": "04/05/2024"},
            "45-49": {"time": "33.19", "name": "פאור עדינה", "club": "מכבי שוהם לאומית", "record_date": ""},
            "50-54": {"time": "34.43", "name": "פאור עדינה", "club": "מכבי שוהם לאומית", "record_date": "04/06/2024"},
            "55-59": {"time": "35.48", "name": "אלרי סילבי", "club": "מכבי עולם המים לאומית", "record_date": "09/01/2026"},
            "60-64": {"time": "40.29", "name": "יופה רונה", "club": "אקוותיקים גבעת-חיים עין גדי", "record_date": "3/18/2011"},
            "65-69": {"time": "42.65", "name": "יופה רונה", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": ""},
            "75-79": {"time": "46.47", "name": "טוביס לאונוב", "club": "איבונה מאסטרס רחובות לאומית", "record_date": "04/05/2024"},
            "80-84": {"time": "55.14", "name": "טיין אידית", "club": "מרכז ישראלי לרפואת ספורט ושיקום פלמה דה מיורקה", "record_date": "10/19/2001"},
            "85-89": {"time": "01:06.58", "name": "טיין אידית", "club": "מכבי חיפה אילת", "record_date": "10/27/2004"}
          },
          "100m": {
            "40-44": {"time": "01:05.42", "name": "גוסטמלסקי אניה", "club": "מכבי עולם המים לאומית", "record_date": "04/06/2024"},
            "25-29": {"time": "01:08.15", "name": "שפייזר טל", "club": "הפועל ירושלים ניו-יורק", "record_date": "12/08/2009"},
            "30-34": {"time": "01:03.22", "name": "גוסטמלסקי אניה", "club": "הפועל דולפין נתניה אולימפית", "record_date": "02/07/2014"},
            "35-39": {"time": "01:08.89", "name": "נטליה אדייקינה", "club": "מכבי חיפה לאומית", "record_date": "03/01/2025"},
            "45-49": {"time": "01:06.36", "name": "גוסטמלסקי אניה", "club": "מכבי עולם המים לאומית", "record_date": "09/01/2026"},
            "50-54": {"time": "01:13.71", "name": "פאור עדינה", "club": "מכבי שוהם לאומית", "record_date": "04/06/2024"},
            "55-59": {"time": "01:18.39", "name": "אלרי סילבי", "club": "מכבי עולם המים לאומית", "record_date": "09/01/2026"},
            "60-64": {"time": "01:28.51", "name": "טוביס-לאונוב איבונה", "club": "הפועל עירוני הוד-השרון עירונית אילת", "record_date": "9/18/2008"},
            "65-69": {"time": "01:33.08", "name": "יופה רונה", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": "01/06/2017"},
            "70-74": {"time": "01:38.18", "name": "יופה רונה", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": "3/19/2021"},
            "75-79": {"time": "01:42.18", "name": "טוביס-לאונוב איבונה", "club": "מאסטרס רחובות לאומית", "record_date": "04/06/2024"},
            "80-84": {"time": "02:01.48", "name": "טיין אדית", "club": "מרכז ישראלי לרפואת ספורט פלמה דה מיורקה", "record_date": "10/19/2001"},
            "85-89": {"time": "02:23.95", "name": "טיין אידית", "club": "מכבי חיפה אילת", "record_date": "10/27/2004"}
          },
          "200m": {
            "25-29": {"time": "02:25.75", "name": "שפייזר טל", "club": "הפועל ירושלים ניו-יורק", "record_date": "12/08/2009"},
            "30-34": {"time": "02:35.60", "name": "פאור עדינה", "club": "הפועל ירושלים סלובניה", "record_date": "08/02/2007"},
            "35-39": {"time": "02:32.30", "name": "גזית מיכל", "club": "הפועל שחייני הנגב לאומית", "record_date": "2/14/2020"},
            "40-44": {"time": "02:38.03", "name": "פאור עדינה", "club": "מכבי שוהם בית-אייל", "record_date": "2/22/2016"},
            "45-49": {"time": "02:43.01", "name": "פאור עדינה", "club": "מכבי שוהם לאומית", "record_date": "02/04/2023"},
            "50-54": {"time": "02:45.05", "name": "פאור עדינה", "club": "מכבי שוהם לאומית", "record_date": "04/01/2025"},
            "55-59": {"time": "02:55.85", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "12/18/2021"},
            "60-64": {"time": "02:57.95", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "04/05/2024"},
            "65-69": {"time": "03:19.06", "name": "יופה רונה", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": "2/24/2018"},
            "70-74": {"time": "03:30.19", "name": "יופה רונה", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": "3/19/2021"},
            "75-79": {"time": "03:45.19", "name": "טוביס-לאונוב איבונה", "club": "מאסטרס רחובות לאומית", "record_date": "02/04/2023"},
            "80-84": {"time": "04:18.22", "name": "טיין אדית", "club": "מרכז ישראלי לרפואת ספורט פלמה דה מיורקה", "record_date": "10/20/2001"},
            "85-89": {"time": "04:18.50", "name": "טיין אדית", "club": "מרכז ישראלי לרפואת ספורט מטולה", "record_date": "10/20/2003"}
          }
        },
        "breaststroke": {
          "100m": {
            "50-54": {"time": "01:20.23", "name": "אפרתי אירית", "club": "הפועל שחייני הנגב לאומית", "record_date": "2/14/2020"},
            "25-29": {"time": "01:19.46", "name": "שץ מיקה", "club": "הפועל גליל-עליון עין גדי", "record_date": "3/18/2011"},
            "30-34": {"time": "01:16.29", "name": "בנפשי ענת", "club": "מכבי עולם המים לאומית", "record_date": "02/04/2023"},
            "35-39": {"time": "01:18.53", "name": "טבת אילנה", "club": "הפועל עירוני הוד השרון אולימפית", "record_date": "02/07/2014"},
            "40-44": {"time": "01:23.28", "name": "מוסקונה שני", "club": "מכבי עולם המים לאומית", "record_date": "10/01/2026"},
            "45-49": {"time": "01:22.12", "name": "אפרתי אירית", "club": "מכבי שוהם לאומית", "record_date": "2/15/2019"},
            "55-59": {"time": "01:31.87", "name": "טוביס-לאונוב איבונה", "club": "אקוותיקים גבעת-חיים אילת", "record_date": "10/20/2005"},
            "60-64": {"time": "01:35.86", "name": "הולדשטיין אסתר", "club": "אקוותיקים גבעת-חיים עירונית אילת", "record_date": "10/16/2009"},
            "65-69": {"time": "01:39.66", "name": "הולדשטיין אסתר", "club": "אקוותיקים גבעת-חיים בית-אייל", "record_date": "2/22/2013"},
            "70-74": {"time": "01:43.14", "name": "הולדשטיין אסתר", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": "01/06/2017"},
            "75-79": {"time": "01:52.41", "name": "הולדשטיין אסתר", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": "04/01/2025"}
          },
          "200m": {
            "50-54": {"time": "02:55.53", "name": "אפרתי אירית", "club": "הפועל שחייני הנגב לאומית", "record_date": "2/15/2020"},
            "55-59": {"time": "03:25.25", "name": "הולדשטיין אסתר", "club": "אקוותיקים גבעת-חיים ירושלים", "record_date": "10/19/2003"},
            "60-64": {"time": "03:30.36", "name": "הולדשטיין אסתר", "club": "אקוותיקים גבעת-חיים אילת", "record_date": "10/17/2009"},
            "65-69": {"time": "03:34.41", "name": "הולדשטיין אסתר", "club": "אקוותיקים גבעת-חיים בית-אייל", "record_date": "2/24/2012"},
            "25-29": {"time": "02:50.41", "name": "עדן דנה", "club": "הפועל עולם המים בית-אייל", "record_date": "02/12/2010"},
            "30-34": {"time": "03:00.98", "name": "שץ מיקה", "club": "הפועל גליל עליון אולימפית", "record_date": "02/09/2014"},
            "35-39": {"time": "02:57.84", "name": "מוסקונה שני", "club": "מכבי עולם המים לאומית", "record_date": "12/17/2021"},
            "40-44": {"time": "03:00.19", "name": "מרן רעות", "club": "אקוותיקים לאומית", "record_date": "04/05/2024"},
            "45-49": {"time": "03:01.14", "name": "אפרתי אירית", "club": "מכבי עמותת השחייה שהם לאומית", "record_date": "01/06/2017"},
            "75-79": {"time": "05:08.78", "name": "שניידמן ג׳אן", "club": "אקוותיקים לאומית", "record_date": "2/14/2020"}
          },
          "50m": {
            "25-29": {"time": "36.50", "name": "שץ מיקה", "club": "הפועל גליל-עליון עין גדי", "record_date": "3/18/2011"},
            "30-34": {"time": "34.42", "name": "בנפשי ענת", "club": "מכבי עולם המים לאומית", "record_date": "02/03/2023"},
            "35-39": {"time": "36.87", "name": "מוסקונה שני", "club": "מאסטרס רחובות לאומית", "record_date": "2/15/2020"},
            "40-44": {"time": "37.62", "name": "מוסקונה שני", "club": "מכבי עולם המים לאומית", "record_date": "09/01/2026"},
            "45-49": {"time": "38.03", "name": "אפרתי אירית", "club": "מכבי עמותת השחייה שהם לאומית", "record_date": "01/07/2017"},
            "50-54": {"time": "37.42", "name": "אפרתי אירית", "club": "הפועל שחייני הנגב לאומית", "record_date": "2/15/2020"},
            "55-59": {"time": "41.85", "name": "טוביס-לאונוב איבונה", "club": "אקוותיקים גבעת-חיים אשדות יעקב", "record_date": "11/15/2006"},
            "60-64": {"time": "43.30", "name": "הולדשטיין אסתר", "club": "אקוותיקים גבעת-חיים עירונית אילת", "record_date": "10/16/2009"},
            "65-69": {"time": "45.92", "name": "טוביס-לאונוב איבונה", "club": "הפועל עירוני הוד השרון בית-אייל", "record_date": "2/22/2013"},
            "70-74": {"time": "50.15", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים לאומית", "record_date": "2/14/2020"},
            "75-79": {"time": "51.73", "name": "טוביס-לאונוב איבונה", "club": "מאסטרס רחובות לאומית", "record_date": "02/03/2023"},
            "80-84": {"time": "01:34.21", "name": "בראונר חוה", "club": "שירותי בריאות כללית אילת", "record_date": "10/19/2001"},
            "85-89": {"time": "01:18.69", "name": "טיין אדית", "club": "מכבי חיפה אילת", "record_date": "10/28/2004"}
          }
        },
        "freestyle": {
          "50m": {
            "25-29": {"time": "27.81", "name": "בנפשי ענת", "club": "מכבי עולם המים לאומית", "record_date": "3/19/2021"},
            "30-34": {"time": "26.28", "name": "גוסטמלסקי אניה", "club": "הפועל דולפין נתניה אולימפית", "record_date": "02/07/2014"},
            "35-39": {"time": "28.20", "name": "אדייקינה נטליה", "club": "מכבי חיפה לאומית", "record_date": "04/01/2025"},
            "40-44": {"time": "27.09", "name": "גוסטמלסקי אניה", "club": "מכבי עולם המים לאומית", "record_date": "02/04/2023"},
            "45-49": {"time": "27.23", "name": "גוסטמלסקי אניה", "club": "מכבי עולם המים לאומית", "record_date": "10/01/2026"},
            "50-54": {"time": "29.29", "name": "פסמני אולגה", "club": "מאסטרס רחובות לאומית", "record_date": "02/04/2023"},
            "55-59": {"time": "31.90", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "2/15/2020"},
            "60-64": {"time": "31.91", "name": "ניסמן רונדה", "club": "אקוותיקים גבעת-חיים אולימפית", "record_date": "02/07/2014"},
            "65-69": {"time": "32.53", "name": "הולדשטיין אסתר", "club": "אקוותיקים גבעת-חיים בית אייל", "record_date": "2/24/2012"},
            "70-74": {"time": "34.04", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "04/06/2024"},
            "75-79": {"time": "41.53", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים לאומית", "record_date": "02/04/2023"},
            "80-84": {"time": "46.71", "name": "ברנשטיין לאה", "club": "מכבי פ.מ. רעות לאומית", "record_date": "10/01/2026"},
            "85-89": {"time": "01:03.44", "name": "טיין אידית", "club": "מכבי חיפה אילת", "record_date": "10/27/2004"}
          },
          "100m": {
            "25-29": {"time": "59.52", "name": "בנפשי ענת", "club": "עולם המים לאומית", "record_date": "3/19/2021"},
            "30-34": {"time": "01:01.38", "name": "בנפשי ענת", "club": "מכבי עולם המים לאומית", "record_date": "04/01/2025"},
            "35-39": {"time": "01:03.03", "name": "גוטמן מאירי", "club": "זיוית מכבי חיפה אולימפית", "record_date": "02/07/2014"},
            "40-44": {"time": "01:05.12", "name": "פסמני אולגה", "club": "מאסטרס רחובות אולימפית", "record_date": "02/07/2014"},
            "45-49": {"time": "01:04.26", "name": "פסמני אולגה", "club": "מאסטרס רחובות לאומית", "record_date": "2/15/2019"},
            "50-54": {"time": "01:05.83", "name": "זילברברג מיכל", "club": "מכבי פ.מ. רעות לאומית", "record_date": "04/01/2025"},
            "55-59": {"time": "01:09.69", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "8/15/2020"},
            "60-64": {"time": "01:14.06", "name": "ניסמן רונדה", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": "01/06/2017"},
            "65-69": {"time": "01:15.95", "name": "ניסמן רונדה", "club": "אקוותיקים גבעת-חיים לאומית", "record_date": "8/15/2020"},
            "70-74": {"time": "01:18.48", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "04/05/2024"},
            "75-79": {"time": "01:25.58", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים לאומית", "record_date": "02/03/2023"},
            "80-84": {"time": "02:26.08", "name": "יערי זיוה", "club": "תעשיה אווירית לאומית", "record_date": "3/20/2021"},
            "85-89": {"time": "02:17.60", "name": "טיין אידית", "club": "מכבי חיפה אילת", "record_date": "10/27/2004"}
          },
          "200m": {
            "25-29": {"time": "02:10.25", "name": "בכר עמית", "club": "מכבי פ.מ. רעות לאומית וינגייט", "record_date": "01/06/2017"},
            "30-34": {"time": "02:13.34", "name": "בנפשי ענת", "club": "מכבי עולם המים לאומית", "record_date": "03/01/2025"},
            "35-39": {"time": "02:16.42", "name": "גוטמן מאירי", "club": "זיוית מכבי חיפה בית-אייל", "record_date": "2/22/2013"},
            "85-89": {"time": "04:20.18", "name": "טיין אדית", "club": "מרכז ישראלי לרפואת ספורט מטולה", "record_date": "10/19/2003"},
            "40-44": {"time": "02:17.41", "name": "סגל דורי", "club": "עדי מכבי חיפה לאומית", "record_date": "02/04/2023"},
            "45-49": {"time": "02:19.41", "name": "גוטמן מאירי", "club": "זיוית אקוותיקים לאומית", "record_date": "02/04/2023"},
            "50-54": {"time": "02:25.05", "name": "פאור עדינה", "club": "מכבי שוהם לאומית", "record_date": "04/06/2024"},
            "55-59": {"time": "02:31.08", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "2/14/2020"},
            "60-64": {"time": "02:33.79", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "04/06/2024"},
            "65-69": {"time": "02:53.40", "name": "הולדשטיין אסתר", "club": "אקוותיקים גבעת-חיים בית-אייל", "record_date": "2/22/2013"},
            "70-74": {"time": "03:00.76", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "04/06/2024"},
            "75-79": {"time": "03:07.53", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים לאומית", "record_date": "02/04/2023"},
            "80-84": {"time": "05:08.13", "name": "יערי זיוה", "club": "תעשיה אווירית לאומית", "record_date": "3/20/2021"}
          },
          "400m": {
            "25-29": {"time": "04:44.40", "name": "בנפשי ענת", "club": "עולם המים לאומית", "record_date": "3/19/2021"},
            "30-34": {"time": "04:49.52", "name": "בנפשי ענת", "club": "מכבי עולם המים לאומית", "record_date": "03/01/2025"},
            "35-39": {"time": "04:41.59", "name": "גוטמן מאירי", "club": "זיוית מכבי חיפה לאומית", "record_date": "2/28/2015"},
            "40-44": {"time": "05:03.98", "name": "מיטל עינת", "club": "Nemos TLV לאומית", "record_date": "02/04/2023"},
            "45-49": {"time": "04:56.03", "name": "נגלי איילת", "club": "WEST SWIM לאומית", "record_date": "2/15/2020"},
            "50-54": {"time": "05:07.36", "name": "מיכל זילברברג", "club": "מכבי פ.מ. רעות לאומית", "record_date": "03/01/2025"},
            "55-59": {"time": "05:26.91", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "2/15/2020"},
            "60-64": {"time": "05:30.03", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "04/06/2024"},
            "65-69": {"time": "06:43.50", "name": "מזור אוה", "club": "הפועל בת ים לאומית", "record_date": "02/04/2023"},
            "70-74": {"time": "06:08.82", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "04/06/2024"},
            "75-79": {"time": "06:48.94", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים לאומית", "record_date": "02/04/2023"},
            "80-84": {"time": "09:10.42", "name": "טיין אדית", "club": "מרכז ישראלי לרפואת ספורט פלמה דה מיורקה", "record_date": "10/19/2001"}
          },
          "800m": {
            "25-29": {"time": "09:25.23", "name": "בכר עמית", "club": "מכבי פ.מ. רעות לאומית", "record_date": "01/07/2017"},
            "30-34": {"time": "10:16.58", "name": "גוטמן מאירי", "club": "זיוית מכבי חיפה מכון וינגייט", "record_date": "07/10/2012"},
            "35-39": {"time": "09:41.90", "name": "גוטמן מאירי", "club": "זיוית מכבי חיפה וינגייט", "record_date": "2/28/2015"},
            "40-44": {"time": "10:17.85", "name": "גוטמן מאירי", "club": "זיוית אקוותיקים גבעת-חיים לאומית", "record_date": "2/24/2018"},
            "45-49": {"time": "10:04.05", "name": "נגלי איילת", "club": "עולם המים לאומית", "record_date": "2/15/2019"},
            "55-59": {"time": "11:12.94", "name": "קוסביצקי יעל", "club": "מכבי שוהם לאומית", "record_date": "10/01/2026"},
            "60-64": {"time": "11:15.05", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "04/05/2024"},
            "65-69": {"time": "13:09.11", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים גבעת-חיים וינגייט", "record_date": "2/28/2015"},
            "70-74": {"time": "12:22.72", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "04/05/2024"},
            "75-79": {"time": "13:44.04", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים לאומית", "record_date": "02/03/2023"},
            "85-89": {"time": "24:05.00", "name": "יערי זיוה", "club": "תעשייה אווירית לאומית", "record_date": "04/05/2024"}
          },
          "1500m": {
            "25-29": {"time": "21:58.60", "name": "גורנשטיין קארן", "club": "בני הרצליה וינגייט", "record_date": "2/21/2015"},
            "30-34": {"time": "23:14.82", "name": "דאון מויאל", "club": "ימית מאסטרס כפר שמריהו וינגייט", "record_date": "2/21/2015"},
            "35-39": {"time": "19:22.36", "name": "גוטמן מאירי", "club": "זיוית מכבי חיפה לאומית טוטו", "record_date": "08/01/2015"},
            "40-44": {"time": "20:01.65", "name": "גוטמן מאירי", "club": "זיוית אקוותיקים ריצ׳מונד ורג׳יניה", "record_date": "08/03/2022"},
            "60-64": {"time": "23:13.13", "name": "ניסמן רונדה", "club": "אקוותיקים גבעת-חיים לאומית טוטו", "record_date": "08/01/2015"},
            "65-69": {"time": "24:51.03", "name": "הולדשטיין אסתר", "club": "אקוותיקים גבעת-חיים וינגייט", "record_date": "2/21/2015"}
          }
        },
        "individual_medley": {
          "200m": {
            "25-29": {"time": "02:31.39", "name": "בכר נעם", "club": "מכבי פ.מ. רעות לאומית", "record_date": "01/06/2017"},
            "30-34": {"time": "02:29.85", "name": "בנפשי ענת", "club": "מכבי עולם המים לאומית", "record_date": "02/04/2023"},
            "50-54": {"time": "02:48.32", "name": "פסמני אולגה", "club": "מאסטרס רחובות לאומית", "record_date": "05/04/2025"},
            "55-59": {"time": "02:55.32", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "02/04/2023"},
            "60-64": {"time": "03:10.39", "name": "טוביס-לאונוב איבונה", "club": "הפועל עירוני הוד-השרון עין גדי", "record_date": "3/18/2011"},
            "35-39": {"time": "02:39.77", "name": "פאור עדינה", "club": "בני הרצליה בית-אייל", "record_date": "2/22/2013"},
            "40-44": {"time": "02:43.31", "name": "פסמני אולגה", "club": "שירותי בריאות כללית עירונית אילת", "record_date": "10/23/2014"},
            "45-49": {"time": "02:38.31", "name": "פסמני אולגה", "club": "מאסטרס רחובות לאומית", "record_date": "2/15/2020"},
            "65-69": {"time": "03:20.73", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "8/15/2020"},
            "70-74": {"time": "03:27.72", "name": "טוביס לאונוב", "club": "איבונה מאסטרס רחובות לאומית", "record_date": "2/16/2019"},
            "75-79": {"time": "03:48.81", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים לאומית", "record_date": "02/04/2023"},
            "80-84": {"time": "04:37.51", "name": "ברנשטיין לאה", "club": "מכבי פ.מ. רעות לאומית", "record_date": "09/01/2026"}
          },
          "400m": {
            "25-29": {"time": "05:21.87", "name": "בכר עמית", "club": "מכבי פ.מ. רעות לאומית טוטו", "record_date": "05/12/2017"},
            "30-34": {"time": "05:49.48", "name": "מרמור טל", "club": "הפועל עולם המים וינגייט", "record_date": "2/21/2015"},
            "35-39": {"time": "05:47.47", "name": "ביכמן עדי", "club": "מכבי שוהם לאומית", "record_date": "7/14/2018"},
            "40-44": {"time": "05:49.45", "name": "גוטמן מאירי", "club": "זיוית אקוותיקים גבעת-חיים לאומית", "record_date": "03/04/2018"},
            "45-49": {"time": "05:49.07", "name": "קטן רונית", "club": "הפועל גליל עליון איטליה", "record_date": "06/12/2012"},
            "50-54": {"time": "06:03.23", "name": "אפרתי אירית", "club": "הפועל שחייני הנגב לאומית", "record_date": "2/14/2020"},
            "55-59": {"time": "06:40.79", "name": "ניסמן רונדה", "club": "אקוותיקים גבעת-חיים מכון וינגייט", "record_date": "08/02/2011"},
            "60-64": {"time": "06:49.66", "name": "ניסמן רונדה", "club": "אקוותיקים גבעת-חיים לאומית טוטו", "record_date": "07/01/2016"},
            "65-69": {"time": "08:16.61", "name": "גולדשטיין לריסה", "club": "מכבי שוהם לאומית", "record_date": "02/04/2023"},
            "70-74": {"time": "07:27.04", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "04/01/2025"}
          },
          "100m": {
            "25-29": {"time": "01:12.53", "name": "פאור עדינה", "club": "הפועל ירושלים גבעת חיים", "record_date": "6/15/2002"},
            "30-34": {"time": "01:08.48", "name": "בנפשי ענת", "club": "מכבי עולם המים לאומית", "record_date": "02/03/2023"},
            "35-39": {"time": "01:11.81", "name": "פאור עדינה", "club": "בני הרצליה בית-אייל", "record_date": "2/22/2013"},
            "40-44": {"time": "01:13.91", "name": "פאור עדינה", "club": "מכבי שוהם בית-אייל", "record_date": "2/22/2016"},
            "45-49": {"time": "01:13.73", "name": "פסמני אולגה", "club": "מאסטרס רחובות לאומית", "record_date": "2/15/2019"},
            "50-54": {"time": "01:13.65", "name": "פסמני אולגה", "club": "מאסטרס רחובות לאומית", "record_date": "02/03/2023"},
            "55-59": {"time": "01:20.00", "name": "טוביס-לאונוב איבונה", "club": "הפועל גבעתיים אילת", "record_date": "10/01/2003"},
            "60-64": {"time": "01:25.38", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "09/01/2026"},
            "65-69": {"time": "01:30.58", "name": "הולדשטיין אסתר", "club": "אקוותיקים גבעת-חיים אולימפית", "record_date": "02/07/2014"},
            "70-74": {"time": "01:31.88", "name": "טוביס לאונוב", "club": "איבונה מאסטרס רחובות לאומית", "record_date": "2/15/2019"},
            "75-79": {"time": "01:43.89", "name": "הולדשטיין אסתר", "club": "אקוותיקים לאומית", "record_date": "03/01/2025"},
            "80-84": {"time": "02:05.39", "name": "ברנשטיין לאה", "club": "מכבי פ.מ. רעות לאומית", "record_date": "09/01/2026"},
            "85-89": {"time": "03:08.86", "name": "יערי זיוה", "club": "תעשייה אווירית אגודה לאומית", "record_date": "02/03/2023"}
          }
        }
      },
      "50m_pool": {
        "butterfly": {
          "50m": {
            "30-34": {"time": "30.60", "name": "קרטין ליהי", "club": "מכבי עולם המים לאומית", "record_date": "7/26/2024"},
            "35-39": {"time": "30.17", "name": "אלוני סהר", "club": "עולם המים מכון וינגייט", "record_date": "7/26/2013"},
            "40-44": {"time": "28.87", "name": "גוסטמלסקי אניה", "club": "מכבי עולם המים לאומית", "record_date": "7/14/2023"},
            "45-49": {"time": "32.13", "name": "בירקאן ליאור", "club": "הפועל ירושלים מכון וינגייט", "record_date": "7/20/2009"},
            "50-54": {"time": "32.68", "name": "בירקאן ליאור", "club": "הפועל ירושלים לאומית טוטו", "record_date": "09/05/2014"},
            "55-59": {"time": "35.13", "name": "טוביס-לאונוב איבונה", "club": "אקוותיקים גבעת-חיים סלובניה", "record_date": "09/02/2007"},
            "60-64": {"time": "35.62", "name": "טוביס-לאונוב איבונה", "club": "הפועל עירוני הוד-השרון קאדיז", "record_date": "9/18/2009"},
            "65-69": {"time": "39.38", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "03/12/2022"},
            "70-74": {"time": "40.61", "name": "טוביס לאונוב", "club": "איבונה מכבי וייסגל רחובות סלובניה", "record_date": "09/06/2018"},
            "75-79": {"time": "44.54", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים לאומית", "record_date": "7/20/2022"}
          },
          "100m": {
            "40-44": {"time": "01:15.61", "name": "גוטמן מאירי", "club": "זיוית אקוותיקים לאומית", "record_date": "6/17/2022"},
            "45-49": {"time": "01:12.13", "name": "בירקאן ליאור", "club": "הפועל ירושלים מכון וינגייט", "record_date": "7/22/2009"},
            "50-54": {"time": "01:12.73", "name": "בירקאן ליאור", "club": "הפועל ירושלים אולימפית", "record_date": ""},
            "55-59": {"time": "01:21.45", "name": "כהן חגית", "club": "אקוותיקים לאומית", "record_date": "03/11/2022"},
            "60-64": {"time": "01:31.90", "name": "ניסמן רונדה", "club": "אקוותיקים גבעת-חיים בריכת טוטו מכבייה", "record_date": "7/13/2017"},
            "65-69": {"time": "01:41.10", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "08/06/2021"},
            "70-74": {"time": "02:09.61", "name": "ברנשטיין לאה", "club": "מכבי פ.מ. רעות GBR London,", "record_date": "5/26/2016"},
            "75-79": {"time": "01:58.01", "name": "ברנע דניאלה", "club": "אקוותיקים פוקואוקה יפן", "record_date": "08/07/2023"}
          },
          "200m": {
            "45-49": {"time": "02:50.88", "name": "גוטמן מאירי", "club": "זיוית אקוותיקים לאומית", "record_date": "7/15/2023"},
            "50-54": {"time": "02:47.50", "name": "בירקאן ליאור", "club": "הפועל ירושלים איינדהובן", "record_date": "09/04/2013"},
            "60-64": {"time": "03:54.64", "name": "טליה אקוותיקים", "club": "לאומית", "record_date": "03/12/2022"},
            "65-69": {"time": "04:02.00", "name": "ניסמן רונדה", "club": "אקוותיקים רומא, איטליה", "record_date": "09/02/2022"},
            "75-79": {"time": "04:14.76", "name": "ברנע דניאלה", "club": "אקוותיקים רומא, איטליה", "record_date": "09/02/2022"}
          }
        },
        "backstroke": {
          "50m": {
            "40-44": {"time": "31.87", "name": "גוסטמלסקי אניה", "club": "מכבי עולם המים לאומית", "record_date": "7/14/2023"},
            "45-49": {"time": "33.97", "name": "פסמני אולגה", "club": "מכבי וייסגל רחובות לאומית", "record_date": "7/13/2018"},
            "50-54": {"time": "35.76", "name": "פסמני אולגה", "club": "מאסטרס רחובות לאומית", "record_date": "03/11/2022"},
            "55-59": {"time": "37.73", "name": "טוביס-לאונוב איבונה", "club": "אקוותיקים גבעת-חיים שבדיה", "record_date": "08/12/2005"},
            "60-64": {"time": "38.57", "name": "טוביס-לאונוב איבונה", "club": "הפועל עירוני הוד-השרון קאדיז", "record_date": "9/17/2009"},
            "65-69": {"time": "42.63", "name": "טוביס לאונוב", "club": "איבונה עירוני הוד השרון מכון וינגייט", "record_date": "7/26/2013"},
            "75-79": {"time": "50.04", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים לאומית", "record_date": "7/27/2024"},
            "80-84": {"time": "56.54", "name": "טיין אדית", "club": "מכבי חיפה גרמניה", "record_date": "7/29/2000"},
            "85-89": {"time": "01:04.51", "name": "טיין אדית", "club": "מכבי חיפה איטליה", "record_date": "07/01/2004"}
          },
          "100m": {
            "25-29": {"time": "01:11.22", "name": "פאור עדינה", "club": "בני-הרצליה צרפת", "record_date": "04/01/2003"},
            "30-34": {"time": "01:10.08", "name": "פאור עדינה", "club": "הפועל ירושלים סלובניה", "record_date": "08/02/2007"},
            "35-39": {"time": "01:11.44", "name": "פאור עדינה", "club": "בני-הרצליה אוקראינה", "record_date": "09/09/2011"},
            "45-49": {"time": "01:14.40", "name": "פאור עדינה", "club": "מכבי שוהם לאומית", "record_date": "7/20/2019"},
            "50-54": {"time": "01:23.15", "name": "בירקאן ליאור", "club": "הפועל ירושלים לאומית טוטו", "record_date": "09/06/2014"},
            "55-59": {"time": "01:23.75", "name": "טוביס-לאונוב איבונה", "club": "אקוותיקים גבעת-חיים שבדיה", "record_date": "08/11/2005"},
            "60-64": {"time": "01:27.06", "name": "טוביס-לאונוב איבונה", "club": "הפועל עירוני הוד-השרון קאדיז", "record_date": "9/19/2009"},
            "65-69": {"time": "01:34.42", "name": "יופה רונה", "club": "אקוותיקים גבעת-חיים GBR London,", "record_date": "5/28/2016"},
            "70-74": {"time": "01:34.68", "name": "טוביס לאונוב", "club": "איבונה מכבי וייסגל רחובות סלובניה", "record_date": "09/04/2018"},
            "75-79": {"time": "01:56.34", "name": "טיין אדית", "club": "מכבי חיפה בריטניה", "record_date": "6/25/1996"},
            "80-84": {"time": "02:01.49", "name": "טיין אדית", "club": "מכבי חיפה גרמניה", "record_date": "7/30/2000"},
            "85-89": {"time": "02:10.44", "name": "טיין אדית", "club": "מכבי חיפה איטליה", "record_date": "07/03/2004"}
          },
          "200m": {
            "50-54": {"time": "02:57.53", "name": "קטן רונית", "club": "הפועל גליל עליון לאומית טוטו", "record_date": "6/30/2016"},
            "55-59": {"time": "02:56.45", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "7/21/2022"},
            "60-64": {"time": "02:59.06", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "7/27/2024"},
            "65-69": {"time": "03:22.51", "name": "יופה רונה", "club": "אקוותיקים גבעת-חיים לאומית טוטו", "record_date": "6/30/2016"},
            "70-74": {"time": "03:31.72", "name": "יופה רונה", "club": "אקוותיקים רומא, איטליה", "record_date": "09/01/2022"},
            "75-79": {"time": "04:01.29", "name": "טיין אדית", "club": "מכבי חיפה בריטניה", "record_date": "07/01/1996"},
            "80-84": {"time": "04:11.83", "name": "טיין אדית", "club": "מכבי חיפה גרמניה", "record_date": "08/02/2000"},
            "85-89": {"time": "04:52.29", "name": "טיין אדית", "club": "מכבי חיפה איטליה", "record_date": "07/12/2004"}
          }
        },
        "breaststroke": {
          "50m": {
            "25-29": {"time": "36.79", "name": "גת רוני", "club": "עולם המים דרום קוריאה", "record_date": "8/18/2019"},
            "30-34": {"time": "37.11", "name": "מוסקונה שני", "club": "מאסטרס רחובות לאומית", "record_date": "7/20/2019"},
            "35-39": {"time": "37.33", "name": "מוסקונה שני", "club": "מכבי עולם המים לאומית", "record_date": "08/06/2021"},
            "40-44": {"time": "38.97", "name": "רביב תמר", "club": "ירושלים מכון וינגייט", "record_date": "7/25/2013"},
            "45-49": {"time": "38.11", "name": "אפרתי אירית", "club": "מכבי שוהם סלובניה", "record_date": "09/03/2018"},
            "50-54": {"time": "42.22", "name": "קטן רונית", "club": "הפועל גליל עליון איטליה", "record_date": "06/09/2015"},
            "55-59": {"time": "43.52", "name": "קונסטנטיני נעמה", "club": "ירושלים מכון וינגייט", "record_date": "7/25/2013"},
            "60-64": {"time": "42.98", "name": "טוביס-לאונוב איבונה", "club": "הפועל עירוני הוד-השרון קאדיז", "record_date": "9/16/2009"},
            "65-69": {"time": "46.05", "name": "הולדשטיין אסתר", "club": "אקוותיקים גבעת-חיים מכון וינגייט", "record_date": "7/21/2012"},
            "70-74": {"time": "46.50", "name": "הולדשטיין אסתר", "club": "אקוותיקים גבעת-חיים לאומית טוטו", "record_date": "5/13/2017"},
            "75-79": {"time": "48.59", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים לאומית", "record_date": "7/22/2022"}
          },
          "100m": {
            "25-29": {"time": "01:19.78", "name": "ביכמן עדי", "club": "מכבי שוהם מכון וינגייט", "record_date": "7/15/2011"},
            "30-34": {"time": "01:21.00", "name": "כהן ליאב", "club": "מכבי פ.מ. רעות GBR London,", "record_date": "5/26/2016"},
            "35-39": {"time": "01:24.72", "name": "מוסקונה שני", "club": "מכבי עולם המים לאומית", "record_date": "08/07/2021"},
            "40-44": {"time": "01:25.80", "name": "מרן רעות", "club": "אקוותיקים פוקואוקה יפן", "record_date": "08/06/2023"},
            "45-49": {"time": "01:23.07", "name": "אפרתי אירית", "club": "מכבי שוהם סלובניה", "record_date": "09/07/2018"},
            "55-59": {"time": "01:36.79", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "08/07/2021"},
            "60-64": {"time": "01:35.50", "name": "הולדשטיין אסתר", "club": "אקוותיקים גבעת-חיים אוקראינה", "record_date": "09/07/2011"},
            "65-69": {"time": "01:35.75", "name": "הולדשטיין אסתר", "club": "אקוותיקים גבעת-חיים איטליה", "record_date": "06/11/2012"},
            "70-74": {"time": "01:44.85", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים סלובניה", "record_date": "09/07/2018"},
            "75-79": {"time": "01:44.46", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים רומא, איטליה", "record_date": "8/30/2022"}
          },
          "200m": {
            "25-29": {"time": "02:55.81", "name": "ביכמן עדי", "club": "מכבי פ.מ. רעות מכון וינגייט", "record_date": "02/08/2008"},
            "30-34": {"time": "02:57.60", "name": "כהן ליאב", "club": "מכבי פ.מ. רעות GBR London,", "record_date": "5/29/2016"},
            "35-39": {"time": "03:07.51", "name": "מוסקונה שני", "club": "מכבי עולם המים לאומית", "record_date": "08/06/2021"},
            "40-44": {"time": "03:04.29", "name": "מרן רעות", "club": "אקוותיקים לאומית", "record_date": "7/26/2024"},
            "45-49": {"time": "03:02.98", "name": "אפרתי אירית", "club": "מכבי שוהם GBR London,", "record_date": "5/29/2016"},
            "70-74": {"time": "03:50.05", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים לאומית", "record_date": "2/16/2019"},
            "75-79": {"time": "03:55.88", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים לאומית", "record_date": "7/21/2022"}
          }
        },
        "freestyle": {
          "50m": {
            "40-44": {"time": "27.97", "name": "גוסטמלסקי אניה", "club": "מכבי עולם המים לאומית", "record_date": "7/15/2023"},
            "45-49": {"time": "29.73", "name": "פסמני אולגה", "club": "מאסטרס רחובות לאומית טוטו", "record_date": "5/13/2017"},
            "50-54": {"time": "30.46", "name": "זילברברג מיכל", "club": "מכבי פ.מ. רעות לאומית", "record_date": "7/26/2024"},
            "55-59": {"time": "31.91", "name": "ניסמן רונדה", "club": "אקוותיקים גבעת-חיים מכון וינגייט", "record_date": "7/21/2012"},
            "60-64": {"time": "32.36", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "7/27/2024"},
            "65-69": {"time": "33.81", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "03/11/2022"},
            "70-74": {"time": "34.70", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "7/27/2024"},
            "75-79": {"time": "36.43", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים לאומית", "record_date": "7/21/2022"},
            "80-84": {"time": "01:00.76", "name": "יערי זיוה", "club": "תעשיה אווירית לאומית", "record_date": "6/18/2021"},
            "85-89": {"time": "01:16.04", "name": "יערי זיוה", "club": "תעשיה אווירית לאומית", "record_date": "6/18/2021"}
          },
          "100m": {
            "40-44": {"time": "01:01.46", "name": "גוסטמלסקי אניה", "club": "מכבי עולם המים לאומית", "record_date": "7/26/2024"},
            "45-49": {"time": "01:03.83", "name": "פסמני אולגה", "club": "מכבי וייסגל רחובות לאומית", "record_date": "7/13/2018"},
            "50-54": {"time": "01:06.36", "name": "זילברברג מיכל", "club": "מכבי פ.מ. רעות לאומית", "record_date": "7/26/2024"},
            "55-59": {"time": "01:10.92", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "7/21/2022"},
            "60-64": {"time": "01:11.12", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "7/26/2024"},
            "65-69": {"time": "01:16.29", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "08/06/2021"},
            "70-74": {"time": "01:20.73", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "7/26/2024"},
            "75-79": {"time": "01:26.01", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים לאומית", "record_date": "7/26/2024"},
            "80-84": {"time": "02:46.81", "name": "שיבלין ז׳אנה", "club": "מכבי נהריה לאומית", "record_date": "08/06/2021"}
          },
          "200m": {
            "40-44": {"time": "02:21.69", "name": "דקל אילנה", "club": "אקוותיקים לאומית", "record_date": "7/27/2024"},
            "45-49": {"time": "02:22.90", "name": "זילברברג מיכל", "club": "פ.מ. רעות בריכת טוטו מכבייה", "record_date": "07/12/2017"},
            "50-54": {"time": "02:27.27", "name": "קטן רונית", "club": "גליל עליון בריכת טוטו מכבייה", "record_date": "07/12/2017"},
            "55-59": {"time": "02:33.77", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "7/20/2022"},
            "60-64": {"time": "02:34.81", "name": "קטן רונית", "club": "אקוותיקים בלגרד, סרביה", "record_date": "6/27/2024"},
            "65-69": {"time": "02:50.73", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "7/20/2019"},
            "70-74": {"time": "03:05.05", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "7/26/2024"},
            "75-79": {"time": "03:05.65", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים לאומית", "record_date": "7/20/2022"},
            "80-84": {"time": "05:52.91", "name": "שיבלין ז׳אנה", "club": "מכבי נהריה לאומית", "record_date": "7/20/2022"}
          },
          "400m": {
            "40-44": {"time": "05:05.86", "name": "גוטמן מאירי", "club": "זיוית אקוותיקים לאומית", "record_date": "7/22/2022"},
            "45-49": {"time": "04:58.11", "name": "קטן רונית", "club": "הפועל גליל עליון איטליה", "record_date": "6/16/2012"},
            "50-54": {"time": "05:16.19", "name": "קטן רונית", "club": "גליל עליון בריכת טוטו מכבייה", "record_date": "7/14/2017"},
            "55-59": {"time": "05:31.62", "name": "קטן רונית", "club": "אקוותיקים לאומית", "record_date": "7/14/2023"},
            "60-64": {"time": "05:26.39", "name": "קטן רונית", "club": "אקוותיקים בלגרד, סרביה", "record_date": "07/02/2024"},
            "65-69": {"time": "05:58.07", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "7/22/2022"},
            "70-74": {"time": "06:17.62", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "7/27/2024"},
            "75-79": {"time": "06:39.23", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים לאומית", "record_date": "7/22/2022"},
            "80-84": {"time": "08:43.54", "name": "טיין אדית", "club": "מכבי חיפה גרמניה", "record_date": "7/29/2000"}
          },
          "800m": {
            "45-49": {"time": "10:18.63", "name": "נגלי איילת", "club": "עולם המים לאומית", "record_date": "7/13/2018"},
            "50-54": {"time": "10:47.70", "name": "בירקאן ליאור", "club": "הפועל ירושלים לאומית", "record_date": "2/28/2015"},
            "55-59": {"time": "11:31.71", "name": "ניסמן רונדה", "club": "אקוותיקים גבעת-חיים אוקראינה", "record_date": "09/05/2011"},
            "60-64": {"time": "11:25.28", "name": "קטן רונית", "club": "אקוותיקים בלגרד, סרביה", "record_date": "6/26/2024"},
            "65-69": {"time": "12:13.13", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "7/19/2019"},
            "70-74": {"time": "12:44.81", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "7/27/2024"},
            "75-79": {"time": "16:52.18", "name": "ברנשטיין לאה", "club": "מכבי פ.מ. רעות לאומית", "record_date": "6/18/2021"},
            "80-84": {"time": "18:07.12", "name": "טיין אדית", "club": "מכבי חיפה גרמניה", "record_date": "7/29/2000"}
          }
        },
        "individual_medley": {
          "200m": {
            "35-39": {"time": "02:41.97", "name": "ביכמן עדי", "club": "מכבי שוהם לאומית", "record_date": "7/14/2018"},
            "40-44": {"time": "02:47.77", "name": "פסמני אולגה", "club": "מאסטרס רחובות לאומית טוטו", "record_date": "08/01/2015"},
            "45-49": {"time": "02:39.40", "name": "פסמני אולגה", "club": "מכבי וייסגל רחובות סלובניה", "record_date": "09/05/2018"},
            "65-69": {"time": "03:20.32", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "7/20/2019"},
            "70-74": {"time": "03:23.37", "name": "טוביס לאונוב", "club": "איבונה מכבי וייסגל רחובות לאומית", "record_date": "7/14/2018"},
            "75-79": {"time": "03:37.26", "name": "הולדשטיין סטלה", "club": "אסתר אקוותיקים לאומית", "record_date": "03/12/2022"}
          },
          "400m": {
            "65-69": {"time": "07:35.27", "name": "ניסמן רונדה", "club": "אקוותיקים לאומית", "record_date": "03/11/2022"},
            "75-79": {"time": "08:09.76", "name": "ברנע דניאלה", "club": "אקוותיקים פוקואוקה יפן", "record_date": "08/07/2023"}
          }
        }
      }
    }
  }
};