window.normative_age_record = {
  "normatives": {
    "male": {
      "25m_pool": {
        "freestyle": {
          "50m": {
            "10": {
              "time": "29.81",
              "name": "מיכאל סמירנוב",
              "club": "הפועל בית שמש",
              "country": "ISR",
              "record_date": "21/12/2011"
            },
            "11": {
              "time": "28.01",
              "name": "יונתן חייטוב",
              "club": "הפועל פתח תקוה",
              "country": "ISR",
              "record_date": "24/12/2004"
            },
            "12": {
              "time": "26.29",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "06/12/2014"
            },
            "13": {
              "time": "25.11",
              "name": "מיכאל בכר",
              "club": "הפועל עמק חפר",
              "country": "ISR",
              "record_date": "28/12/2024"
            },
            "14": {
              "time": "23.59",
              "name": "קווין סיזיי",
              "club": "הפועל שחייני הנגב",
              "country": "ISR",
              "record_date": "27/12/2019"
            },
            "15": {
              "time": "22.80",
              "name": "מיכאל סמירנוב",
              "club": "הפועל בית שמש",
              "country": "ISR",
              "record_date": "31/12/2016"
            },
            "16": {
              "time": "22.16",
              "name": "בן פאחט",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "27/12/2024"
            },
            "17": {
              "time": "21.99",
              "name": "מרטין קרטאבי",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "25/12/2021"
            },
            "18": {
              "time": "21.68",
              "name": "מרטין קרטאבי",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "21/12/2022"
            },
            "ISR": {
              "time": "21.08",
              "name": "מירון חרותי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "27/12/2019"
            }
          },
          "100m": {
            "10": {
              "time": "01:06.93",
              "name": "יונתן חייטוב",
              "club": "הפועל פתח תקוה",
              "country": "ISR",
              "record_date": "26/12/2003"
            },
            "11": {
              "time": "01:01.25",
              "name": "יונתן חייטוב",
              "club": "הפועל פתח תקוה",
              "country": "ISR",
              "record_date": "13/12/2004"
            },
            "12": {
              "time": "57.45",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "06/12/2014"
            },
            "13": {
              "time": "54.93",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "14/11/2015"
            },
            "14": {
              "time": "51.59",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "25/12/2014"
            },
            "15": {
              "time": "50.40",
              "name": "מיכאל סמירנוב",
              "club": "הפועל בית שמש",
              "country": "ISR",
              "record_date": "29/12/2016"
            },
            "16": {
              "time": "49.20",
              "name": "עמית קסטן מגורי",
              "club": "מכבי א.ס. רמת השרון",
              "country": "ISR",
              "record_date": "24/12/2025"
            },
            "17": {
              "time": "48.28",
              "name": "יהלי כהן",
              "club": "מכבי מרום רמת גן",
              "country": "ISR",
              "record_date": "25/12/2025"
            },
            "18": {
              "time": "48.28",
              "name": "יהלי כהן",
              "club": "מכבי מרום רמת גן",
              "country": "ISR",
              "record_date": "25/12/2025"
            },
            "ISR": {
              "time": "46.90",
              "name": "דניאל קריצ׳בסקי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "26/12/2024"
            }
          },
          "200m": {
            "10": {
              "time": "02:23.16",
              "name": "דניאל רבינוביץ׳",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "25/12/2016"
            },
            "11": {
              "time": "02:13.06",
              "name": "נתניאל פושקה",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "06/12/2018"
            },
            "12": {
              "time": "02:05.67",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "06/12/2014"
            },
            "13": {
              "time": "01:59.85",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "14/11/2015"
            },
            "14": {
              "time": "01:52.81",
              "name": "דניס לוקטב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "26/12/2014"
            },
            "15": {
              "time": "01:48.82",
              "name": "דניס לוקטב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "18/12/2015"
            },
            "16": {
              "time": "01:47.18",
              "name": "דניס לוקטב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "30/12/2016"
            },
            "17": {
              "time": "01:44.71",
              "name": "דניס לוקטב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "30/12/2017"
            },
            "18": {
              "time": "01:43.50",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "29/12/2018"
            },
            "ISR": {
              "time": "01:43.24",
              "name": "דניאל קריצ׳בסקי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "27/12/2024"
            }
          },
          "400m": {
            "10": {
              "time": "05:15.43",
              "name": "יהב חלג׳",
              "club": "מכבי קרית אונו",
              "country": "ISR",
              "record_date": "09/12/2015"
            },
            "11": {
              "time": "04:46.48",
              "name": "עידן ז׳ורבסקי",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "18/02/2018"
            },
            "12": {
              "time": "04:28.91",
              "name": "דניס לוקטב",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "25/11/2021"
            },
            "13": {
              "time": "04:13.34",
              "name": "איליה איזנשטוק",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "27/12/2001"
            },
            "14": {
              "time": "03:55.40",
              "name": "שון פומברג",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "26/12/2024"
            },
            "15": {
              "time": "03:50.08",
              "name": "דניס לוקטב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "16/12/2015"
            },
            "16": {
              "time": "03:47.25",
              "name": "דניס לוקטב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "28/12/2016"
            },
            "17": {
              "time": "03:45.13",
              "name": "דניס לוקטב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "27/12/2017"
            },
            "18": {
              "time": "03:42.86",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "26/12/2018"
            },
            "ISR": {
              "time": "03:42.86",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "26/12/2018"
            }
          },
          "800m": {
            "11": {
              "time": "10:10.48",
              "name": "עומר הופמן",
              "club": "הפועל שחייני הנגב",
              "country": "ISR",
              "record_date": "25/12/2004"
            },
            "12": {
              "time": "09:30.14",
              "name": "נתן נמרוד",
              "club": "מכ. פ.מ. רעות",
              "country": "ISR",
              "record_date": "06/12/1997"
            },
            "13": {
              "time": "09:01.59",
              "name": "ניר חי",
              "club": "הפועל פתח תקוה",
              "country": "ISR",
              "record_date": "28/12/2018"
            },
            "14": {
              "time": "08:05.90",
              "name": "שון פומברג",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "28/12/2024"
            },
            "15": {
              "time": "08:05.90",
              "name": "שון פומברג",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "28/12/2024"
            },
            "16": {
              "time": "08:02.42",
              "name": "מאור גורלניק",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "25/12/2021"
            },
            "17": {
              "time": "07:56.84",
              "name": "יואב רומנו",
              "club": "מכבי שהם",
              "country": "ISR",
              "record_date": "25/12/2021"
            },
            "18": {
              "time": "07:52.79",
              "name": "יואב רומנו",
              "club": "מכבי שוהם",
              "country": "ISR",
              "record_date": "21/12/2022"
            },
            "ISR": {
              "time": "07:49.29",
              "name": "מתן רודיטי",
              "club": "בני הרצליה",
              "country": "ISR",
              "record_date": "21/12/2022"
            }
          },
          "1500m": {
            "12": {
              "time": "18:17.49",
              "name": "נמרוד שפירא בר-אור",
              "club": "ירושלים רבתי",
              "country": "ISR",
              "record_date": "29/12/2001"
            },
            "13": {
              "time": "16:58.32",
              "name": "טום קיצ׳ב",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "27/12/2019"
            },
            "14": {
              "time": "15:39.12",
              "name": "שון פומברג",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "24/12/2024"
            },
            "15": {
              "time": "15:32.09",
              "name": "מרק חינאוי",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "29/12/2012"
            },
            "16": {
              "time": "15:18.57",
              "name": "מרק חינאוי",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": ""
            },
            "17": {
              "time": "15:05.14",
              "name": "מרק חינאוי",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "27/12/2014"
            },
            "18": {
              "time": "15:00.71",
              "name": "גל נבו",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "10/12/2005"
            },
            "ISR": {
              "time": "14:52.83",
              "name": "גיל קיזלר",
              "club": "בני הרצליה",
              "country": "ISR",
              "record_date": "31/12/2016"
            }
          },
          "4X50m": {
            "10": {
              "time": "02:10.06",
              "name": "",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "28/12/2005"
            },
            "11": {
              "time": "02:07.25",
              "name": "סטשבסקי, יונתן קאירי גורל, בנימין צ׳רנובסקי, דוד",
              "club": "רשקוב מכבי אשדוד",
              "country": "ISR",
              "record_date": "05/05/2023"
            },
            "12": {
              "time": "01:52.92",
              "name": "אלכס וולקוב, דניאל וולקוב, דוד לוין, אחמד דיאב",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "05/12/2014"
            },
            "13": {
              "time": "01:42.17",
              "name": "למר רודוב, מתו תוצ׳ילובסקי, בר סולובייצ׳יק, סטיבן שיימן",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "05/12/2014"
            },
            "14": {
              "time": "01:39.79",
              "name": "נתניאל פושקה, עידו שפירא, נתנאל נובוסד, עידן ז׳ורבסקי",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "23/12/2021"
            },
            "15": {
              "time": "01:36.68",
              "name": "אברהם אבישי, אורי אבישי, ענבר רפאל יוסקוביץ-לב ארי,",
              "club": "תומר רוזנר מכבי א.ס. רמת השרון",
              "country": "ISR",
              "record_date": "26/12/2025"
            },
            "16": {
              "time": "01:33.78",
              "name": "עמית קסטן מגורי, ענבר מסילתי, ענבר רפאל יוסקוביץ-לב",
              "club": "ארי מכבי א.ס. רמת השרון",
              "country": "ISR",
              "record_date": "26/12/2025"
            },
            "17": {
              "time": "01:32.44",
              "name": "שגיא כהן, ניל כרמלי, ירין שמאי, יהונתן שילר",
              "club": "מכבי ראשון לציון",
              "country": "ISR",
              "record_date": "27/12/2024"
            },
            "18": {
              "time": "01:31.90",
              "name": "זיו קלונטרוב, עומר מטלון, איתי קרול, טל רבינוביץ׳ בץ",
              "club": "הפועל עומר",
              "country": "ISR",
              "record_date": "16/12/2015"
            },
            "ISR": {
              "time": "01:26.90",
              "name": "מירון חירותי, מרקוס ג׳ון שלזינגר, תומר פרנקל, גל כהן",
              "club": "גרומי נבחרת ישראל",
              "country": "ISR",
              "record_date": "04/12/2019"
            },
            "adults": {
              "time": "01:27.61",
              "name": "ריבינסקי, מרקוס ג׳ון שלזינגר, סטיבן פרידמן, אהרון",
              "club": "גרינברג הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "26/12/2018"
            }
          },
          "4X100m": {
            "13": {
              "time": "09:02.86",
              "name": "",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "28/12/2012"
            },
            "14": {
              "time": "08:04.76",
              "name": "לירן סימנדייב, מרטין קרטאבי, חן מולר, דניאל יוסיפוב",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "29/12/2018"
            },
            "15": {
              "time": "08:04.76",
              "name": "לירן סימנדייב, מרטין קרטאבי, חן מולר, דניאל יוסיפוב",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "29/12/2018"
            },
            "16": {
              "time": "07:35.32",
              "name": "אחמד פדיליה,ארז דרור, יוחי ברוש, אשכול מזור",
              "club": "הפועל כפר סבא ב. ב.",
              "country": "ISR",
              "record_date": "23/12/2023"
            },
            "17": {
              "time": "07:35.32",
              "name": "אחמד פדיליה,ארז דרור, יוחי ברוש, אשכול מזור",
              "club": "הפועל כפר סבא ב. ב.",
              "country": "ISR",
              "record_date": "23/12/2023"
            },
            "18": {
              "time": "07:32.30",
              "name": "מאור גורלניק, נתניאל פושקה, אלן טרייבוך, דניאל רבינוביץ׳",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "30/12/2011"
            },
            "ISR": {
              "time": "07:28.94",
              "name": "דניאל אייכל, שון וורונקוב, שון פומברג, איתי רוזנפלד",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "07/12/2024"
            },
            "adults": {
              "time": "07:28.94",
              "name": "דניאל אייכל, שון וורונקוב, שון פומברג, איתי רוזנפלד",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "07/12/2024"
            }
          }
        },
        "breaststroke": {
          "50m": {
            "10": {
              "time": "39.06",
              "name": "לביא גפן משיח",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "15/10/2021"
            },
            "11": {
              "time": "36.39",
              "name": "דוד מנשר",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "28/12/2013"
            },
            "12": {
              "time": "32.65",
              "name": "טלר מרק",
              "club": "מכבי תל אביב",
              "country": "ISR",
              "record_date": "17/08/2020"
            },
            "13": {
              "time": "30.87",
              "name": "דניאל יוסיפוב",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "27/12/2017"
            },
            "14": {
              "time": "29.20",
              "name": "דניאל יוסיפוב",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "26/12/2018"
            },
            "15": {
              "time": "28.53",
              "name": "דניאל יוסיפוב",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "25/12/2019"
            },
            "16": {
              "time": "27.85",
              "name": "מרק טלר",
              "club": "מכבי מרום רמת גן",
              "country": "ISR",
              "record_date": "26/12/2024"
            },
            "17": {
              "time": "27.60",
              "name": "מרק טלר",
              "club": "מכבי מרום רמת גן",
              "country": "ISR",
              "record_date": "25/12/2025"
            },
            "18": {
              "time": "27.42",
              "name": "כריס פיצ׳וגין",
              "club": "ירושלים רבתי",
              "country": "ISR",
              "record_date": "25/12/2019"
            },
            "ISR": {
              "time": "26.21",
              "name": "כריס פיצ׳וגין",
              "club": "ירושלים רבתי",
              "country": "ISR",
              "record_date": "06/11/2021"
            }
          },
          "100m": {
            "10": {
              "time": "01:24.33",
              "name": "מיכאל מגרלישוילי",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "23/12/2003"
            },
            "11": {
              "time": "01:17.10",
              "name": "דוד מנשר",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "28/12/2013"
            },
            "12": {
              "time": "01:10.52",
              "name": "מרק טלר",
              "club": "מכבי כפר המכבייה",
              "country": "ISR",
              "record_date": "18/08/2020"
            },
            "13": {
              "time": "01:07.48",
              "name": "גילי רותם",
              "club": "מכבי ראשון לציון",
              "country": "ISR",
              "record_date": "22/12/2022"
            },
            "14": {
              "time": "01:03.93",
              "name": "דניאל יוסיפוב",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "29/12/2018"
            },
            "15": {
              "time": "01:02.48",
              "name": "דניאל יוסיפוב",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "28/12/2019"
            },
            "16": {
              "time": "01:00.20",
              "name": "מרק טלר",
              "club": "מכבי מרום רמת גן",
              "country": "ISR",
              "record_date": "26/12/2024"
            },
            "17": {
              "time": "01:00.10",
              "name": "מרק טלר",
              "club": "מכבי מרום רמת גן",
              "country": "ISR",
              "record_date": "27/12/2025"
            },
            "18": {
              "time": "59.95",
              "name": "איתי גולדפדן",
              "club": "הפועל עמק חפר",
              "country": "ISR",
              "record_date": "26/12/2014"
            },
            "ISR": {
              "time": "57.56",
              "name": "יהונתן יצחקי",
              "club": "מכבי מרום רמת גן",
              "country": "ISR",
              "record_date": "27/12/2024"
            }
          },
          "200m": {
            "10": {
              "time": "03:03.41",
              "name": "לביא גפן משיח",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "19/11/2021"
            },
            "11": {
              "time": "02:47.44",
              "name": "דוד מנשר",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "27/12/2013"
            },
            "12": {
              "time": "02:35.21",
              "name": "יבגני רדצ׳נקו",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "28/12/2012"
            },
            "13": {
              "time": "02:21.40",
              "name": "דניאל יוסיפוב",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "28/12/2017"
            },
            "14": {
              "time": "02:18.65",
              "name": "דניאל יוסיפוב",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "27/12/2018"
            },
            "15": {
              "time": "02:13.87",
              "name": "גילי רותם",
              "club": "מכבי ראשון לציון",
              "country": "ISR",
              "record_date": "25/12/2024"
            },
            "16": {
              "time": "02:11.65",
              "name": "רון פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "28/12/2017"
            },
            "17": {
              "time": "02:09.57",
              "name": "איליה גלדישב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "25/12/2014"
            },
            "18": {
              "time": "02:09.57",
              "name": "איליה גלדישב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": ""
            },
            "ISR": {
              "time": "02:05.87",
              "name": "יעקב טומרקין",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "26/12/2019"
            }
          }
        },
        "backstroke": {
          "50m": {
            "10": {
              "time": "34.67",
              "name": "רון מורגוליס",
              "club": "מכבי וייסגל רחובות",
              "country": "ISR",
              "record_date": "25/12/2016"
            },
            "11": {
              "time": "32.20",
              "name": "איליה איזנשטוק",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "09/12/1999"
            },
            "12": {
              "time": "29.93",
              "name": "איליה איזנשטוק",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "30/12/2000"
            },
            "13": {
              "time": "27.93",
              "name": "איליה איזנשטוק",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "29/12/2001"
            },
            "14": {
              "time": "25.62",
              "name": "מיכאל בכר",
              "club": "הפועל עמק חפר",
              "country": "ISR",
              "record_date": "24/12/2025"
            },
            "15": {
              "time": "25.31",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "20/12/2022"
            },
            "16": {
              "time": "25.12",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "22/12/2023"
            },
            "17": {
              "time": "24.34",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "25/12/2024"
            },
            "18": {
              "time": "24.20",
              "name": "וינר עומר",
              "club": "הפועל עמק חפר",
              "country": "ISR",
              "record_date": "23/12/2021"
            },
            "ISR": {
              "time": "23.27",
              "name": "גיא ברנע",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "06/12/2015"
            }
          },
          "100m": {
            "10": {
              "time": "01:14.51",
              "name": "רון מורגוליס",
              "club": "מכבי וייסגל רחובות",
              "country": "ISR",
              "record_date": "26/12/2016"
            },
            "11": {
              "time": "01:09.43",
              "name": "דניאל רבינוביץ׳",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "19/12/2017"
            },
            "12": {
              "time": "01:05.15",
              "name": "ערן גרובמן",
              "club": "מכבי וייסגל רחובות",
              "country": "ISR",
              "record_date": "09/11/2019"
            },
            "13": {
              "time": "01:00.03",
              "name": "גילי רותם",
              "club": "מכבי ראשון לציון",
              "country": "ISR",
              "record_date": "21/12/2022"
            },
            "14": {
              "time": "55.06",
              "name": "מיכאל בכר",
              "club": "הפועל עמק חפר",
              "country": "ISR",
              "record_date": "26/12/2025"
            },
            "15": {
              "time": "53.94",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "21/12/2022"
            },
            "16": {
              "time": "53.94",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "21/12/2022"
            },
            "17": {
              "time": "52.43",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "28/12/2024"
            },
            "18": {
              "time": "51.91",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "04/12/2025"
            },
            "ISR": {
              "time": "50.64",
              "name": "דוד גמבורג",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "03/12/2014"
            }
          },
          "200m": {
            "10": {
              "time": "02:37.93",
              "name": "רון מורגוליס",
              "club": "מכבי וייסגל רחובות",
              "country": "ISR",
              "record_date": "26/12/2016"
            },
            "11": {
              "time": "02:29.32",
              "name": "דניס לוקטב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "21/12/2011"
            },
            "12": {
              "time": "02:20.20",
              "name": "ערן גרובמן",
              "club": "מכבי וייסגל רחובות",
              "country": "ISR",
              "record_date": "09/11/2019"
            },
            "13": {
              "time": "02:11.88",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "27/12/2013"
            },
            "14": {
              "time": "02:01.83",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "22/12/2021"
            },
            "15": {
              "time": "01:56.03",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "19/12/2022"
            },
            "16": {
              "time": "01:56.03",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "19/12/2022"
            },
            "17": {
              "time": "01:52.54",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "26/12/2024"
            },
            "18": {
              "time": "01:51.77",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": ""
            },
            "ISR": {
              "time": "01:49.84",
              "name": "יעקב טומרקין",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "04/12/2015"
            }
          }
        },
        "butterfly": {
          "50m": {
            "10": {
              "time": "33.02",
              "name": "יונתן חייטוב",
              "club": "הפועל פתח תקוה",
              "country": "ISR",
              "record_date": "26/12/2003"
            },
            "11": {
              "time": "30.11",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "28/12/2013"
            },
            "12": {
              "time": "27.81",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "06/12/2014"
            },
            "13": {
              "time": "26.43",
              "name": "דניאל דרבצוב",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "28/12/2019"
            },
            "14": {
              "time": "25.51",
              "name": "דניאל דרבצוב",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "17/08/2020"
            },
            "15": {
              "time": "24.69",
              "name": "דניאל דרבצוב",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "24/12/2021"
            },
            "16": {
              "time": "24.19",
              "name": "שון וורונקוב",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "27/12/2025"
            },
            "17": {
              "time": "24.19",
              "name": "שון וורונקוב",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "27/12/2025"
            },
            "18": {
              "time": "23.45",
              "name": "מירון חרותי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "18/12/2015"
            },
            "ISR": {
              "time": "22.59",
              "name": "מירון חרותי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "02/12/2025"
            }
          },
          "100m": {
            "10": {
              "time": "01:16.20",
              "name": "דניאל רבינוביץ׳",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "25/12/2015"
            },
            "11": {
              "time": "01:08.92",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "27/12/2013"
            },
            "12": {
              "time": "01:01.63",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "05/12/2014"
            },
            "13": {
              "time": "58.94",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "13/11/2015"
            },
            "14": {
              "time": "54.90",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "24/12/2014"
            },
            "15": {
              "time": "53.76",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "27/12/2017"
            },
            "16": {
              "time": "53.41",
              "name": "שון וורונקוב",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "25/12/2025"
            },
            "17": {
              "time": "51.82",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "27/12/2017"
            },
            "18": {
              "time": "51.82",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "27/12/2017"
            },
            "ISR": {
              "time": "50.57",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "22/12/2021"
            }
          },
          "200m": {
            "11": {
              "time": "02:38.66",
              "name": "נמרוד חייט",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "27/12/2002"
            },
            "12": {
              "time": "02:22.36",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "06/12/2014"
            },
            "13": {
              "time": "02:14.80",
              "name": "בנימין זלצמן",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "26/12/2016"
            },
            "14": {
              "time": "02:03.37",
              "name": "בנימין זלצמן",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "02/12/2017"
            },
            "15": {
              "time": "01:58.19",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "17/12/2015"
            },
            "16": {
              "time": "01:57.80",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "27/12/2018"
            },
            "17": {
              "time": "01:55.62",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "28/12/2017"
            },
            "18": {
              "time": "01:53.72",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": ""
            },
            "ISR": {
              "time": "01:53.07",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "23/12/2021"
            }
          }
        },
        "individual_medley": {
          "100m": {
            "10": {
              "time": "01:19.03",
              "name": "יעקב טומרקין",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "05/12/2002"
            },
            "11": {
              "time": "01:08.65",
              "name": "יונתן חייטוב",
              "club": "הפועל פתח תקוה",
              "country": "ISR",
              "record_date": "15/12/2004"
            },
            "12": {
              "time": "01:04.04",
              "name": "יונתן חייטוב",
              "club": "הפועל פתח תקווה",
              "country": "ISR",
              "record_date": "29/12/2005"
            },
            "13": {
              "time": "01:01.29",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "17/10/2015"
            },
            "14": {
              "time": "58.86",
              "name": "מייקל לוזין",
              "club": "מכבי ראשון לציון",
              "country": "ISR",
              "record_date": "24/12/2025"
            },
            "15": {
              "time": "57.29",
              "name": "מרק סגלוביץ",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "24/12/2025"
            },
            "16": {
              "time": "56.60",
              "name": "בן פאחט",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "25/12/2024"
            },
            "17": {
              "time": "55.59",
              "name": "דניאל אייכל",
              "club": "מכבי קירת ביאליק",
              "country": "ISR",
              "record_date": "23/12/2021"
            },
            "18": {
              "time": "54.11",
              "name": "רון פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "26/12/2019"
            },
            "ISR": {
              "time": "52.17",
              "name": "יעקב טומרקין",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "28/10/2021"
            }
          },
          "200m": {
            "10": {
              "time": "02:40.97",
              "name": "יונתן חייטוב",
              "club": "הפועל פתח תקוה",
              "country": "ISR",
              "record_date": "26/12/2003"
            },
            "11": {
              "time": "02:30.24",
              "name": "יונתן חייטוב",
              "club": "הפועל פתח תקוה",
              "country": "ISR",
              "record_date": "15/12/2004"
            },
            "12": {
              "time": "02:19.84",
              "name": "יונתן חייטוב",
              "club": "הפועל פתח תקוה",
              "country": "ISR",
              "record_date": "29/12/2005"
            },
            "13": {
              "time": "02:08.02",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "19/12/2015"
            },
            "14": {
              "time": "02:06.54",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "31/12/2016"
            },
            "15": {
              "time": "02:00.93",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "29/12/2017"
            },
            "16": {
              "time": "01:59.50",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "28/12/2018"
            },
            "17": {
              "time": "01:56.98",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "27/12/2019"
            },
            "18": {
              "time": "01:56.36",
              "name": "איתן בן שטרית",
              "club": "ירושלים רבתי",
              "country": "ISR",
              "record_date": "05/11/2021"
            },
            "ISR": {
              "time": "01:53.17",
              "name": "יעקב טומרקין",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "15/11/2020"
            }
          },
          "400m": {
            "11": {
              "time": "05:27.70",
              "name": "נמרוד חייט",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "28/12/2002"
            },
            "12": {
              "time": "04:56.45",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "05/12/2014"
            },
            "13": {
              "time": "04:48.77",
              "name": "גל הדר",
              "club": "קרית אונו/גבעתיים",
              "country": "ISR",
              "record_date": "27/12/2012"
            },
            "14": {
              "time": "04:30.51",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "26/12/2014"
            },
            "15": {
              "time": "04:19.57",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "30/12/2017"
            },
            "16": {
              "time": "04:17.48",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "29/12/2018"
            },
            "17": {
              "time": "04:15.80",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "28/12/2019"
            },
            "18": {
              "time": "04:07.55",
              "name": "איתן בן שטרית",
              "club": "ירושלים רבתי",
              "country": "ISR",
              "record_date": ""
            },
            "ISR": {
              "time": "04:03.50",
              "name": "גל נבו",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "13/12/2013"
            }
          },
          "4X50m": {
            "10": {
              "time": "02:28.27",
              "name": "",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "27/12/2005"
            },
            "11": {
              "time": "02:28.24",
              "name": "דניאל סטשבסקי,בנימין צ׳רנובסקי, דוד רשקוב, יונתן קאירי",
              "club": "גורל, מכבי אשדוד",
              "country": "ISR",
              "record_date": "05/05/2023"
            },
            "12": {
              "time": "02:12.83",
              "name": "רון מרגוליס, נתאי רוזנברג , פלג ליין , יואב רותם",
              "club": "מכבי וייסגל רחובות",
              "country": "ISR",
              "record_date": "20/02/2018"
            },
            "13": {
              "time": "02:00.71",
              "name": "איתן שץ, גל אבדייאב, ניתי ארי, דב שטונובסקי",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "05/12/2025"
            },
            "14": {
              "time": "01:49.75",
              "name": "מרטין קרטאבי, דניאל יוסיפוב, בנימין פיקרסקי, לירן סימנדייב",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "28/12/2018"
            },
            "15": {
              "time": "01:46.37",
              "name": "עידן טל, אורן ברכר, מיכאל לוי, איתי רובינזון",
              "club": "מכבי מרום רמת גן",
              "country": "ISR",
              "record_date": "25/12/2025"
            },
            "16": {
              "time": "01:38.51",
              "name": "דניאל נג׳אר, מרק טלר, יהלי כהן, אסף סקל",
              "club": "מכבי מרום רמת גן",
              "country": "ISR",
              "record_date": "24/12/2025"
            },
            "17": {
              "time": "01:38.51",
              "name": "דניאל נג׳אר, מרק טלר, יהלי כהן, אסף סקל",
              "club": "מכבי מרום רמת גן",
              "country": "ISR",
              "record_date": "24/12/2025"
            },
            "18": {
              "time": "01:39.62",
              "name": "עידן דותן, אמיר חביב, אורי טרלצקי, גלב איאונצ׳ב",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "31/12/2018"
            },
            "ISR": {
              "time": "01:34.50",
              "name": "דוד גרצ׳יק, רון פולונסקי, גרג ליצ׳ינסקי, מירון חרותי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "21/12/2022"
            },
            "adults": {
              "time": "01:34.50",
              "name": "דוד גרצ׳יק, רון פולונסקי, גרג ליצ׳ינסקי, מירון חרותי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "21/12/2022"
            }
          },
          "4X100m": {
            "13": {
              "time": "04:41.58",
              "name": "",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "23/12/2005"
            },
            "14": {
              "time": "04:04.55",
              "name": "מרטין קרטאבי, דניאל יוסיפוב, בנימין פיקרסקי, חן מולר",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "28/12/2018"
            },
            "15": {
              "time": "04:04.55",
              "name": "מרטין קרטאבי, דניאל יוסיפוב, בנימין פיקרסקי, חן מולר",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "28/12/2018"
            },
            "16": {
              "time": "03:51.18",
              "name": "דניאל נג׳אר,עידו כאמון, יהונתן שילר,אסף סקל",
              "club": "מכבי מרום רמת גן",
              "country": "ISR",
              "record_date": "23/12/2023"
            },
            "17": {
              "time": "03:51.18",
              "name": "דניאל נג׳אר,עידו כאמון, יהונתן שילר,אסף סקל",
              "club": "מכבי מרום רמת גן",
              "country": "ISR",
              "record_date": "23/12/2023"
            },
            "18": {
              "time": "03:42.44",
              "name": "",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "19/02/2011"
            },
            "ISR": {
              "time": "03:30.75",
              "name": "יעקב טומרקין, כריס פיצ׳וגין, איתן בן שטרית, דיס לוקטב",
              "club": "נבחרת ישראל",
              "country": "ISR",
              "record_date": "21/12/2021"
            },
            "adults": {
              "time": "03:33.07",
              "name": "מייק מרדר, כריס פיצ׳וגין, ליור מזרחי, איתן בן שטרית",
              "club": "ירושלים רבתי",
              "country": "ISR",
              "record_date": "22/12/2023"
            }
          }
        }
      },
      "50m_pool": {
        "freestyle": {
          "50m": {
            "10": {
              "time": "30.25",
              "name": "נתניאל פושקה",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "24/07/2017"
            },
            "11": {
              "time": "28.66",
              "name": "יונתן חייטוב",
              "club": "הפועל פתח-תקוה",
              "country": "ISR",
              "record_date": "05/08/2004"
            },
            "12": {
              "time": "27.13",
              "name": "יונתן חייטוב",
              "club": "הפועל פתח-תקוה",
              "country": "ISR",
              "record_date": "30/07/2005"
            },
            "13": {
              "time": "25.71",
              "name": "מיכאל סמירנוב",
              "club": "הפועל בית שמש",
              "country": "ISR",
              "record_date": "23/07/2014"
            },
            "14": {
              "time": "24.50",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "28/07/2016"
            },
            "15": {
              "time": "23.86",
              "name": "בן פחאט",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "27/07/2023"
            },
            "16": {
              "time": "22.67",
              "name": "דיויד ריבינסקי",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "18/07/2016"
            },
            "17": {
              "time": "22.59",
              "name": "מיכאל פולבייאב",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "07/09/2023"
            },
            "18": {
              "time": "22.16",
              "name": "זיו קלונטרוב",
              "club": "הפועל עומר",
              "country": "ISR",
              "record_date": "27/06/2015"
            },
            "ISR": {
              "time": "21.60",
              "name": "מירון חרותי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "17/05/2025"
            }
          },
          "100m": {
            "10": {
              "time": "01:06.67",
              "name": "נתניאל פושקה",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "25/07/2017"
            },
            "11": {
              "time": "01:02.71",
              "name": "יונתן חייטוב",
              "club": "הפועל פתח-תקוה",
              "country": "ISR",
              "record_date": "04/08/2004"
            },
            "12": {
              "time": "59.93",
              "name": "יונתן חייטוב",
              "club": "הפועל פתח-תקוה",
              "country": "ISR",
              "record_date": "21/05/2005"
            },
            "13": {
              "time": "56.87",
              "name": "מיכאל סמירנוב",
              "club": "הפועל בית שמש",
              "country": "ISR",
              "record_date": "24/07/2014"
            },
            "14": {
              "time": "53.83",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "26/07/2016"
            },
            "15": {
              "time": "51.72",
              "name": "גל כהן גרומי",
              "club": "עירוני הוד השרון",
              "country": "ISR",
              "record_date": "24/06/2017"
            },
            "16": {
              "time": "50.95",
              "name": "זיו קלונטרוב",
              "club": "הפועל עומר",
              "country": "ISR",
              "record_date": ""
            },
            "17": {
              "time": "49.57",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "01/08/2019"
            },
            "18": {
              "time": "49.23",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "06/07/2018"
            },
            "ISR": {
              "time": "48.18",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "10/06/2023"
            }
          },
          "200m": {
            "10": {
              "time": "02:24.92",
              "name": "דניאל רבינוביץ",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "27/07/2016"
            },
            "11": {
              "time": "02:15.50",
              "name": "נתניאל פושקה",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "30/06/2018"
            },
            "12": {
              "time": "02:09.26",
              "name": "נתניאל פושקה",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "23/07/2019"
            },
            "13": {
              "time": "02:04.65",
              "name": "מיכאל סמירנוב",
              "club": "הפועל בית שמש",
              "country": "ISR",
              "record_date": "23/07/2014"
            },
            "14": {
              "time": "01:57.85",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "27/07/2016"
            },
            "15": {
              "time": "01:52.44",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "05/07/2015"
            },
            "16": {
              "time": "01:50.27",
              "name": "דניס לוקטב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "17/07/2016"
            },
            "17": {
              "time": "01:48.69",
              "name": "תומר פרנקל",
              "club": "ירושלים",
              "country": "ISR",
              "record_date": "02/07/2017"
            },
            "18": {
              "time": "01:47.16",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": ""
            },
            "ISR": {
              "time": "01:46.17",
              "name": "דניס לוקטב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "09/06/2023"
            }
          },
          "400m": {
            "10": {
              "time": "05:06.69",
              "name": "דניאל רבינוביץ",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "25/07/2016"
            },
            "11": {
              "time": "04:43.14",
              "name": "עידן ז׳ורבסקי",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "15/07/2018"
            },
            "12": {
              "time": "04:35.22",
              "name": "בנימין זלצמן",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "20/07/2015"
            },
            "13": {
              "time": "04:21.92",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "20/07/2015"
            },
            "14": {
              "time": "04:05.56",
              "name": "דניס לוקטב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "30/07/2014"
            },
            "15": {
              "time": "03:58.73",
              "name": "דניס לוקטב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "04/07/2015"
            },
            "16": {
              "time": "03:53.89",
              "name": "דניס לוקטב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "15/07/2016"
            },
            "17": {
              "time": "03:53.89",
              "name": "דניס לוקטב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "15/07/2016"
            },
            "18": {
              "time": "03:52.04",
              "name": "דניס לוקטב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "07/10/2018"
            },
            "ISR": {
              "time": "03:47.32",
              "name": "בר סולובייצ׳יק",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "06/06/2024"
            }
          },
          "800m": {
            "11": {
              "time": "10:32.75",
              "name": "אריה קרני",
              "club": "הפ. חולון",
              "country": "ISR",
              "record_date": "02/09/1977"
            },
            "12": {
              "time": "19:05.33",
              "name": "מודי זוהר",
              "club": "מכ. תל-אביב",
              "country": "ISR",
              "record_date": "24/09/1977"
            },
            "13": {
              "time": "17:30.00",
              "name": "אמיר גניאל",
              "club": "מכ. תל-אביב",
              "country": "ISR",
              "record_date": "02/09/1976"
            },
            "14": {
              "time": "16:12.25",
              "name": "שון פומברג",
              "club": "מכבי ביאליק",
              "country": "ISR",
              "record_date": "06/08/2024"
            },
            "15": {
              "time": "15:50.05",
              "name": "שון פומברג",
              "club": "מכבי ביאליק",
              "country": "ISR",
              "record_date": "22/07/2025"
            },
            "16": {
              "time": "15:33.72",
              "name": "מרק חינאוי",
              "club": "בת-ים",
              "country": "ISR",
              "record_date": "18/07/2013"
            },
            "17": {
              "time": "15:29.48",
              "name": "מרק חינאוי",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "10/07/2014"
            },
            "18": {
              "time": "15:22.04",
              "name": "יואב רומנו",
              "club": "מכבי שוהם",
              "country": "ISR",
              "record_date": ""
            },
            "ISR": {
              "time": "15:04.99",
              "name": "מתן רודיטי",
              "club": "בני הרצליה",
              "country": "ISR",
              "record_date": "08/06/2022"
            }
          },
          "4X100m": {
            "10": {
              "time": "02:14.90",
              "name": "רשקובן, בנימין צ׳רנובסקי, דניאל סטשבסקי, יונתן",
              "club": "קאירי גורל מכבי אשדוד",
              "country": "ISR",
              "record_date": "01/08/2022"
            },
            "11": {
              "time": "02:06.58",
              "name": "סטשבסקי, יונתן קאירי גורל, בנימין צ׳רנובסקי, דוד",
              "club": "רשקוב מכבי אשדוד",
              "country": "ISR",
              "record_date": "23/07/2023"
            },
            "12": {
              "time": "09:43.88",
              "name": "רבינוביץ, ליאם גיאולי, אלכס דולגיך, רוסלן",
              "club": "גבריאלוב הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "24/07/2017"
            },
            "13": {
              "time": "09:43.88",
              "name": "רבינוביץ, ליאם גיאולי, אלכס דולגיך, רוסלן",
              "club": "גבריאלוב הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "24/07/2017"
            },
            "14": {
              "time": "08:27.54",
              "name": "מרטין קרטאבי, חן מולר, רון שמילוב, דניאל יוסיפוב",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "26/07/2018"
            },
            "15": {
              "time": "08:19.08",
              "name": "דניאל קיסלוק, איתי גל, איתמר בילינסון, גרנט מיליקיאן",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "08/08/2024"
            },
            "16": {
              "time": "07:53.01",
              "name": "עידו הבר, גיא מוסקוביץ, איתי פילר, יגר דניאל",
              "club": "מכבי קרית-ביאליק",
              "country": "ISR",
              "record_date": "04/08/2011"
            },
            "17": {
              "time": "07:48.97",
              "name": "ארז דרור, מריאל בר און, אחמד פדידה, אשכול מזור",
              "club": "הפועל כפר סבא ב. ב.",
              "country": "ISR",
              "record_date": "08/08/2024"
            },
            "18": {
              "time": "07:38.11",
              "name": "ארז דרור, יואב גל, יותם ורשבסקי, אשכול מזור",
              "club": "הפועל כפר סבא ב. ב.",
              "country": "ISR",
              "record_date": "25/07/2025"
            },
            "ISR": {
              "time": "07:06.29",
              "name": "לוקטב, יואב רומנו, אלכסיי גליבינסקי, דניאל",
              "club": "קריציבסקי נבחרת ישראל",
              "country": "ISR",
              "record_date": "01/08/2025"
            },
            "adults": {
              "time": "07:27.78",
              "name": "פרנקל, גל כהן גרומי, אלכסיי גליבינסקי, סמיון",
              "club": "גריונטל הפועל ירושלים",
              "country": "ISR",
              "record_date": "10/06/2023"
            }
          }
        },
        "breaststroke": {
          "50m": {
            "10": {
              "time": "41.04",
              "name": "מיכאל מגרלישוילי",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "30/07/2003"
            },
            "11": {
              "time": "38.65",
              "name": "לביא גפן משיח",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "01/08/2022"
            },
            "12": {
              "time": "34.78",
              "name": "דוד מנשר",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "14/06/2014"
            },
            "13": {
              "time": "31.50",
              "name": "מרק טלר",
              "club": "מכבי כפר המכביה",
              "country": "ISR",
              "record_date": "23/07/2021"
            },
            "14": {
              "time": "30.42",
              "name": "מרק טלר",
              "club": "מכבי כפר המכביה",
              "country": "ISR",
              "record_date": "27/07/2022"
            },
            "15": {
              "time": "29.68",
              "name": "דניאל יוסיפוב",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "17/05/2019"
            },
            "16": {
              "time": "28.34",
              "name": "מרק טלר",
              "club": "מכבי מרום ר\"ג",
              "country": "ISR",
              "record_date": "02/07/2024"
            },
            "17": {
              "time": "27.76",
              "name": "מרק טלר",
              "club": "מכבי מרום ר\"ג",
              "country": "ISR",
              "record_date": "01/07/2024"
            },
            "18": {
              "time": "27.76",
              "name": "מרק טלר",
              "club": "מכבי מרום ר\"ג",
              "country": "ISR",
              "record_date": "01/07/2024"
            },
            "ISR": {
              "time": "27.02",
              "name": "כריסטיאן פיצ׳וגין",
              "club": "ירושלים רבתי",
              "country": "ISR",
              "record_date": "22/06/2024"
            }
          },
          "100m": {
            "10": {
              "time": "01:26.67",
              "name": "לביא גפן משיח",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "03/08/2021"
            },
            "11": {
              "time": "01:22.41",
              "name": "מיכאל מגרלישוילי",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "04/08/2004"
            },
            "12": {
              "time": "01:16.59",
              "name": "דוד מנשר",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "23/07/2014"
            },
            "13": {
              "time": "01:11.19",
              "name": "מרק טלר",
              "club": "מכבי כפר המכבייה",
              "country": "ISR",
              "record_date": "03/08/2021"
            },
            "14": {
              "time": "01:07.39",
              "name": "מרק טלר",
              "club": "מכבי כפר המכביה",
              "country": "ISR",
              "record_date": "29/07/2022"
            },
            "15": {
              "time": "01:04.95",
              "name": "דניאל יוסיפוב",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "26/07/2019"
            },
            "16": {
              "time": "01:02.17",
              "name": "מרק טלר",
              "club": "מכבי מרום ר\"ג",
              "country": "ISR",
              "record_date": "09/08/2024"
            },
            "17": {
              "time": "01:01.51",
              "name": "מרק טלר",
              "club": "מכבי מרום ר\"ג",
              "country": "ISR",
              "record_date": "06/07/2025"
            },
            "18": {
              "time": "01:01.51",
              "name": "מרק טלר",
              "club": "מכבי מרום ר\"ג",
              "country": "ISR",
              "record_date": ""
            },
            "ISR": {
              "time": "59.63",
              "name": "רון פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "09/08/2024"
            }
          },
          "200m": {
            "10": {
              "time": "03:07.53",
              "name": "לביא גפן משיח",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "02/08/2021"
            },
            "11": {
              "time": "02:58.23",
              "name": "דוד מנשר",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "31/07/2013"
            },
            "12": {
              "time": "02:43.46",
              "name": "דוד מנשר",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "22/07/2014"
            },
            "13": {
              "time": "02:31.58",
              "name": "יבגני רדצ׳נקו",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "31/07/2013"
            },
            "14": {
              "time": "02:26.49",
              "name": "דניאל יוסיפוב",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "26/07/2018"
            },
            "15": {
              "time": "02:19.83",
              "name": "דניאל יוסיפוב",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "23/07/2019"
            },
            "16": {
              "time": "02:18.16",
              "name": "רון פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "03/08/2017"
            },
            "17": {
              "time": "02:18.03",
              "name": "דניאל יוסיפוב",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "21/07/2021"
            },
            "18": {
              "time": "02:14.22",
              "name": "רון פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "13/12/2019"
            },
            "ISR": {
              "time": "02:11.44",
              "name": "תום בארי",
              "club": "מכבי קרית-אונו",
              "country": "ISR",
              "record_date": "12/08/2008"
            }
          }
        },
        "backstroke": {
          "50m": {
            "10": {
              "time": "01:16.07",
              "name": "רון מורגוליס",
              "club": "מכבי וייסגל רחובות",
              "country": "ISR",
              "record_date": "28/07/2016"
            },
            "11": {
              "time": "01:12.50",
              "name": "נתניאל פושקה",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "16/07/2018"
            },
            "12": {
              "time": "01:07.54",
              "name": "ערן גרובמן",
              "club": "מכבי וייסגל רחובות",
              "country": "ISR",
              "record_date": "23/07/2019"
            },
            "13": {
              "time": "01:04.04",
              "name": "אלעד סומינסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "30/07/2025"
            },
            "14": {
              "time": "59.62",
              "name": "מיכאל בכר",
              "club": "בפועל עמק חפר",
              "country": "ISR",
              "record_date": "26/07/2025"
            },
            "15": {
              "time": "56.66",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": ""
            },
            "16": {
              "time": "55.39",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "25/07/2023"
            },
            "17": {
              "time": "55.10",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "10/08/2024"
            },
            "18": {
              "time": "54.44",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "19/07/2025"
            },
            "ISR": {
              "time": "53.60",
              "name": "",
              "club": "",
              "country": "ISR",
              "record_date": ""
            }
          },
          "200m": {
            "10": {
              "time": "02:39.84",
              "name": "רון מורגוליס",
              "club": "מכבי וייסגל רחובות",
              "country": "ISR",
              "record_date": "06/07/2016"
            },
            "11": {
              "time": "02:33.73",
              "name": "דניאל רבינוביץ",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "23/07/2017"
            },
            "12": {
              "time": "02:23.11",
              "name": "ערן גרובמן",
              "club": "מכבי וייסגל רחובות",
              "country": "ISR",
              "record_date": "22/07/2019"
            },
            "13": {
              "time": "02:20.92",
              "name": "אדם מראענה",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "26/07/2016"
            },
            "14": {
              "time": "02:08.94",
              "name": "דניס לוקטב",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "22/07/2014"
            },
            "15": {
              "time": "02:03.16",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "13/05/2022"
            },
            "16": {
              "time": "02:00.20",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "06/07/2023"
            },
            "17": {
              "time": "02:00.20",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": ""
            },
            "18": {
              "time": "01:59.09",
              "name": "אוקאן גולדין",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "03/07/2025"
            },
            "ISR": {
              "time": "01:55.96",
              "name": "יעקב טומרקין",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "12/08/2015"
            }
          }
        },
        "butterfly": {
          "50m": {
            "10": {
              "time": "34.60",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "22/06/2012"
            },
            "11": {
              "time": "31.58",
              "name": "יונתן חייטוב",
              "club": "הפועל פתח-תקוה",
              "country": "ISR",
              "record_date": "05/08/2004"
            },
            "12": {
              "time": "28.70",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "04/07/2014"
            },
            "13": {
              "time": "27.44",
              "name": "דניאל דרבצוב",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "28/06/2019"
            },
            "14": {
              "time": "26.61",
              "name": "אורי נסים",
              "club": "הפועל באר שבע",
              "country": "ISR",
              "record_date": "09/08/2024"
            },
            "15": {
              "time": "24.74",
              "name": "דניאל דרבצוב",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "13/06/2021"
            },
            "16": {
              "time": "24.50",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "27/07/2018"
            },
            "17": {
              "time": "23.98",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "02/08/2017"
            },
            "18": {
              "time": "23.79",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "04/07/2018"
            },
            "ISR": {
              "time": "23.01",
              "name": "מירון חרותי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "14/04/2024"
            }
          },
          "100m": {
            "10": {
              "time": "01:16.13",
              "name": "אלון מרושצנקו",
              "club": "הפועל שחייני הנגב",
              "country": "ISR",
              "record_date": "21/07/2015"
            },
            "11": {
              "time": "01:12.50",
              "name": "אלון מרושצנקו",
              "club": "הפועל שחייני הנגב",
              "country": "ISR",
              "record_date": "26/07/2016"
            },
            "12": {
              "time": "01:04.12",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "22/07/2014"
            },
            "13": {
              "time": "59.65",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "21/07/2015"
            },
            "14": {
              "time": "57.15",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "17/07/2016"
            },
            "15": {
              "time": "54.26",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "14/08/2015"
            },
            "16": {
              "time": "53.76",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "07/04/2016"
            },
            "17": {
              "time": "52.93",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "21/06/2019"
            },
            "18": {
              "time": "52.25",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": ""
            },
            "ISR": {
              "time": "50.98",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "28/07/2023"
            }
          },
          "200m": {
            "10": {
              "time": "02:57.82",
              "name": "נמרוד חייט",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "08/08/2001"
            },
            "11": {
              "time": "02:44.01",
              "name": "אביטל מיטב",
              "club": "הפ. ק.ג. ת\"א",
              "country": "ISR",
              "record_date": "29/07/2000"
            },
            "12": {
              "time": "02:23.71",
              "name": "יואב שמיר",
              "club": "בני הרצליה",
              "country": "ISR",
              "record_date": "15/06/2024"
            },
            "13": {
              "time": "02:16.93",
              "name": "בנימין זלצמן",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "28/07/2016"
            },
            "14": {
              "time": "02:10.77",
              "name": "אלון שמי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "01/08/2013"
            },
            "15": {
              "time": "02:04.44",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "09/04/2017"
            },
            "16": {
              "time": "02:01.66",
              "name": "תום קרמר",
              "club": "מכבי קרית-ביאליק",
              "country": "ISR",
              "record_date": "23/07/2010"
            },
            "17": {
              "time": "02:00.52",
              "name": "תום קרמר",
              "club": "מכבי קרית-ביאליק",
              "country": "ISR",
              "record_date": "08/07/2011"
            },
            "18": {
              "time": "01:57.97",
              "name": "נמרוד חייט",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "10/07/2009"
            },
            "ISR": {
              "time": "01:57.02",
              "name": "גל נבו",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "28/07/2009"
            }
          }
        },
        "individual_medley": {
          "200m": {
            "10": {
              "time": "02:44.67",
              "name": "דניאל רבינוביץ",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "28/07/2016"
            },
            "11": {
              "time": "02:29.93",
              "name": "יונתן חייטוב",
              "club": "הפועל פתח-תקוה",
              "country": "ISR",
              "record_date": "05/08/2004"
            },
            "12": {
              "time": "02:25.50",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "24/07/2014"
            },
            "13": {
              "time": "02:17.49",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "22/07/2015"
            },
            "14": {
              "time": "02:12.72",
              "name": "גילי רותם",
              "club": "מכבי ראשון לציון",
              "country": "ISR",
              "record_date": "08/06/2023"
            },
            "15": {
              "time": "02:07.02",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "05/08/2017"
            },
            "16": {
              "time": "02:02.41",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "08/10/2018"
            },
            "17": {
              "time": "02:00.48",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "05/07/2019"
            },
            "18": {
              "time": "01:59.45",
              "name": "רון פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "13/12/2019"
            },
            "ISR": {
              "time": "01:57.01",
              "name": "רון פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "22/06/2024"
            }
          },
          "400m": {
            "10": {
              "time": "06:22.90",
              "name": "אביטל מיטב",
              "club": "",
              "country": "ISR",
              "record_date": "02/08/1999"
            },
            "11": {
              "time": "05:52.98",
              "name": "יורי בוגייב",
              "club": "מכבי תל-אביב/מכביה",
              "country": "ISR",
              "record_date": "24/07/1995"
            },
            "12": {
              "time": "05:19.16",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "02/05/2014"
            },
            "13": {
              "time": "04:55.70",
              "name": "תומר פרנקל",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "01/08/2013"
            },
            "14": {
              "time": "04:45.37",
              "name": "גל הדר",
              "club": "קרית אונו",
              "country": "ISR",
              "record_date": "22/07/2013"
            },
            "15": {
              "time": "04:31.74",
              "name": "גל כהן גרומי",
              "club": "הפועל עירוני הוד השרון",
              "country": "ISR",
              "record_date": "04/08/2017"
            },
            "16": {
              "time": "04:27.16",
              "name": "רון פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "04/08/2017"
            },
            "17": {
              "time": "04:27.16",
              "name": "רון פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "04/08/2017"
            },
            "18": {
              "time": "04:21.57",
              "name": "איתן בן שטרית",
              "club": "ירושלים רבתי",
              "country": "ISR",
              "record_date": ""
            },
            "ISR": {
              "time": "04:11.51",
              "name": "גל נבו",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "02/08/2009"
            }
          },
          "4X100m": {
            "10": {
              "time": "02:42.67",
              "name": "אלון אברמוביץ, ינאי נבו, יונתן מוקוליצקי, ינאי סופר",
              "club": "מכבי וייסגל רחובות",
              "country": "ISR",
              "record_date": "20/07/2024"
            },
            "11": {
              "time": "02:25.89",
              "name": "רודה, דניאל סטשבסקי, יונתן קאירי גורל, בנימין",
              "club": "צ׳רנובסקי מכבי אשדוד",
              "country": "ISR",
              "record_date": "23/07/2023"
            },
            "12": {
              "time": "02:08.81",
              "name": "ערן גרובמן, דניאל סובטוב, פלג קליין, אלן טרייבוך",
              "club": "מכבי וייסגל רחובות",
              "country": "ISR",
              "record_date": "24/07/2019"
            },
            "13": {
              "time": "04:57.45",
              "name": "קוצי מיכאל, רון פולונסקי, קורובוב אריאל, גרצ׳יק",
              "club": "דוד מכבי חיפה",
              "country": "ISR",
              "record_date": "01/08/2013"
            },
            "14": {
              "time": "04:11.79",
              "name": "סימנדייב, דניאל יוסיפוב, מרטין קרטאבי, רון",
              "club": "שמילוב הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "25/07/2018"
            },
            "15": {
              "time": "04:11.79",
              "name": "סימנדייב, דניאל יוסיפוב, מרטין קרטאבי, רון",
              "club": "שמילוב הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "25/07/2018"
            },
            "16": {
              "time": "04:07.28",
              "name": "לאו פיאסטרו, אשכול מזור, ארז דרור, אחמד פדילה",
              "club": "הפועל כפר סבא ב.ב.",
              "country": "ISR",
              "record_date": "08/06/2023"
            },
            "17": {
              "time": "04:07.28",
              "name": "לאו פיאסטרו, אשכול מזור, ארז דרור, אחמד פדילה",
              "club": "הפועל כפר סבא ב.ב.",
              "country": "ISR",
              "record_date": "08/06/2023"
            },
            "18": {
              "time": "04:07.28",
              "name": "לאו פיאסטרו, אשכול מזור, ארז דרור, אחמד פדילה",
              "club": "הפועל כפר סבא ב.ב.",
              "country": "ISR",
              "record_date": "08/06/2023"
            },
            "ISR": {
              "time": "03:32.04",
              "name": "ברנע גיא, מלניק דנית, נבו גל, גייבורונסקי דניס",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "08/08/2009"
            },
            "adults": {
              "time": "03:32.04",
              "name": "ברנע גיא, מלניק דנית, נבו גל, גייבורונסקי דניס",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "08/08/2009"
            }
          }
        }
      }
    },
    "female": {
      "25m_pool": {
        "freestyle": {
          "50m": {
            "10": {
              "time": "29.76",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "26/12/2003"
            },
            "11": {
              "time": "27.89",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "13/12/2004"
            },
            "12": {
              "time": "27.31",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "20/12/2005"
            },
            "13": {
              "time": "25.70",
              "name": "מיכל אוגינץ",
              "club": "הפועל בית שמש",
              "country": "ISR",
              "record_date": ""
            },
            "14": {
              "time": "25.70",
              "name": "מיכל אוגינץ",
              "club": "הפועל בית שמש",
              "country": "ISR",
              "record_date": "25/12/2025"
            },
            "15": {
              "time": "25.21",
              "name": "שאין גולנד",
              "club": "הפועל מ. א. משגב",
              "country": "ISR",
              "record_date": "19/12/2022"
            },
            "16": {
              "time": "24.79",
              "name": "דריה גולובטי",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "02/11/2021"
            },
            "17": {
              "time": "24.53",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": ""
            },
            "18": {
              "time": "24.53",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "22/08/2020"
            },
            "ISR": {
              "time": "24.46",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "19/12/2022"
            }
          },
          "100m": {
            "10": {
              "time": "01:04.79",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "26/12/2003"
            },
            "11": {
              "time": "01:00.92",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "03/12/2004"
            },
            "12": {
              "time": "58.38",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": ""
            },
            "13": {
              "time": "55.94",
              "name": "מיכל אוגינץ",
              "club": "הפועל בית שמש",
              "country": "ISR",
              "record_date": "24/12/2025"
            },
            "14": {
              "time": "55.94",
              "name": "מיכל אוגינץ",
              "club": "הפועל בית שמש",
              "country": "ISR",
              "record_date": "24/12/2025"
            },
            "15": {
              "time": "54.29",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "29/11/2018"
            },
            "16": {
              "time": "52.87",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "26/10/2019"
            },
            "17": {
              "time": "52.36",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "24/10/2020"
            },
            "18": {
              "time": "52.36",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "24/10/2020"
            },
            "ISR": {
              "time": "52.16",
              "name": "אנדראה מורז",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "09/11/2020"
            }
          },
          "200m": {
            "10": {
              "time": "02:22.81",
              "name": "אנג׳לה זאבורויב",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "26/11/2022"
            },
            "11": {
              "time": "02:17.10",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": ""
            },
            "12": {
              "time": "02:08.68",
              "name": "בקי פוזדנר",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "30/12/2016"
            },
            "13": {
              "time": "02:03.01",
              "name": "בקי פוזדנר",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "30/12/2017"
            },
            "14": {
              "time": "02:01.35",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "02/12/2017"
            },
            "15": {
              "time": "02:00.19",
              "name": "בקי פוזדנר",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "28/12/2019"
            },
            "16": {
              "time": "01:57.03",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "26/10/2019"
            },
            "17": {
              "time": "01:57.03",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "26/10/2019"
            },
            "18": {
              "time": "01:56.21",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "19/09/2021"
            },
            "ISR": {
              "time": "01:53.50",
              "name": "אנדראה מורז",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "16/11/2020"
            }
          },
          "400m": {
            "11": {
              "time": "04:48.22",
              "name": "שרון שטיימן",
              "club": "הפועל פליפר חדרה",
              "country": "ISR",
              "record_date": "01/12/2016"
            },
            "12": {
              "time": "04:25.36",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "22/12/2005"
            },
            "13": {
              "time": "04:16.61",
              "name": "בקי פוזדנר",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": ""
            },
            "14": {
              "time": "04:13.39",
              "name": "בקי פוזדנר",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "26/12/2018"
            },
            "15": {
              "time": "04:13.07",
              "name": "בקי פוזדנר",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "25/12/2019"
            },
            "16": {
              "time": "04:12.88",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "27/10/2019"
            },
            "17": {
              "time": "04:12.61",
              "name": "גלי זילברברג",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": ""
            },
            "18": {
              "time": "04:12.61",
              "name": "גלי זילברברג",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "26/12/2018"
            },
            "ISR": {
              "time": "04:07.21",
              "name": "אנדראה מורז",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "07/11/2015"
            }
          },
          "800m": {
            "10": {
              "time": "05:22.16",
              "name": "דריה גולובטי",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "09/12/2015"
            },
            "12": {
              "time": "09:09.63",
              "name": "דריה גולובטי",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "29/12/2017"
            },
            "13": {
              "time": "08:44.53",
              "name": "בקי פוזדנר",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "29/12/2017"
            },
            "14": {
              "time": "08:43.60",
              "name": "בקי פוזדנר",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "28/12/2018"
            },
            "15": {
              "time": "08:38.94",
              "name": "בקי פוזדנר",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "27/12/2019"
            },
            "16": {
              "time": "08:38.94",
              "name": "בקי פוזדנר",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "27/12/2019"
            },
            "17": {
              "time": "08:38.94",
              "name": "בקי פוזדנר",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "27/12/2019"
            },
            "18": {
              "time": "08:38.94",
              "name": "בקי פוזדנר",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "27/12/2019"
            },
            "ISR": {
              "time": "08:28.29",
              "name": "אולגה ברסנייבה",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "22/01/2005"
            }
          },
          "1500m": {
            "11": {
              "time": "09:56.36",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": ""
            },
            "13": {
              "time": "18:13.20",
              "name": "רבקה אנדרוביץ׳",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "21/12/2022"
            },
            "14": {
              "time": "17:40.19",
              "name": "איילה לוי",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "23/12/2025"
            },
            "15": {
              "time": "16:59.75",
              "name": "עומר שוורץ",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "21/12/2021"
            },
            "16": {
              "time": "16:50.28",
              "name": "עומר שוורץ",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "23/12/2022"
            },
            "17": {
              "time": "16:31.53",
              "name": "אמילי גולוס",
              "club": "SWIM TLV",
              "country": "ISR",
              "record_date": "23/12/2025"
            },
            "18": {
              "time": "16:31.53",
              "name": "אמילי גולוס",
              "club": "SWIM TLV",
              "country": "ISR",
              "record_date": "23/12/2025"
            },
            "ISR": {
              "time": "16:31.53",
              "name": "אמילי גולוס",
              "club": "SWIM TLV",
              "country": "ISR",
              "record_date": "23/12/2025"
            }
          },
          "4X50m": {
            "10": {
              "time": "02:20.20",
              "name": "",
              "club": "מכבי קרית-ביאליק",
              "country": "ISR",
              "record_date": "24/12/1995"
            },
            "11": {
              "time": "02:20.20",
              "name": "",
              "club": "מכבי קרית-ביאליק",
              "country": "ISR",
              "record_date": "24/12/1995"
            },
            "12": {
              "time": "01:59.63",
              "name": "דריה גולובטי, רומי חבחב, גטלמן אליס, סבשצ׳ינסקי אלכסיה",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "19/12/2017"
            },
            "13": {
              "time": "01:57.32",
              "name": "דנה ווזנסקי נח, סופי נחמין, דניאל יהודיאן, מרי פלייטמן",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "26/12/2025"
            },
            "14": {
              "time": "01:49.33",
              "name": "דריה גולובטי, רומי חבחב, אופיר רכאח, אלכסיה סבשצ׳נסקי",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "26/12/2019"
            },
            "15": {
              "time": "01:49.33",
              "name": "דריה גולובטי, רומי חבחב, אופיר רכאח, אלכסיה סבשצ׳נסקי",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": ""
            },
            "16": {
              "time": "01:45.22",
              "name": "דריה גולובטי, אופק אדיר, אלכסיה סבשצ׳נסקי, יובל סגל",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "26/11/2021"
            },
            "17": {
              "time": "01:43.59",
              "name": "שאין גולנד, אלמה גלסמן, רויטל ברנוט, מיטל פליקשטיין",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "27/12/2024"
            },
            "18": {
              "time": "01:43.59",
              "name": "שאין גולנד, אלמה גלסמן, רויטל ברנוט, מיטל פליקשטיין",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "27/12/2024"
            },
            "ISR": {
              "time": "01:38.53",
              "name": "זהר שיקלר, עמית עברי, קרן זיבנר, אנדראה מורז",
              "club": "נבחרת ישראל",
              "country": "ISR",
              "record_date": "04/12/2015"
            },
            "adults": {
              "time": "01:43.12",
              "name": "קרן זיבנר, אניה גוסטמלסקי, חיה זלבלודוף, זהר שיקלר",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": ""
            }
          },
          "4X100m": {
            "12": {
              "time": "04:21.38",
              "name": "",
              "club": "הפועל חולון",
              "country": "ISR",
              "record_date": "31/12/2011"
            },
            "13": {
              "time": "04:19.36",
              "name": "דנה ווזנסקי נח, סופי נחמין, דניאל יהודיאן, מרי פלייטמן",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "25/12/2025"
            },
            "14": {
              "time": "08:52.41",
              "name": "אילנית דימשיץ, איילה לוי, אנה גורבנקו, מיקה שטיפט",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": ""
            },
            "15": {
              "time": "08:52.41",
              "name": "אילנית דימשיץ, איילה לוי, אנה גורבנקו, מיקה שטיפט",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "04/12/2025"
            },
            "16": {
              "time": "08:23.48",
              "name": "רומי חביב, בקי פוזדנר, דריה גולובטי, יובל סגל",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "26/12/2020"
            },
            "17": {
              "time": "08:23.48",
              "name": "רומי חביב, בקי פוזדנר, דריה גולובטי, יובל סגל",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "26/12/2020"
            },
            "18": {
              "time": "08:23.48",
              "name": "רומי חביב, בקי פוזדנר, דריה גולובטי, יובל סגל",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "26/12/2020"
            },
            "ISR": {
              "time": "08:23.48",
              "name": "רומי חביב, בקי פוזדנר, דריה גולובטי, יובל סגל",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "26/12/2020"
            },
            "adults": {
              "time": "08:23.48",
              "name": "רומי חביב, בקי פוזדנר, דריה גולובטי, יובל סגל",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "26/12/2020"
            }
          }
        },
        "breaststroke": {
          "50m": {
            "10": {
              "time": "39.85",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "22/12/2003"
            },
            "11": {
              "time": "37.38",
              "name": "עדי ביכמן",
              "club": "הפועל גבעתיים",
              "country": "ISR",
              "record_date": "16/12/1994"
            },
            "12": {
              "time": "34.15",
              "name": "שירה גמליי",
              "club": "מכבי וייסגל רחובות",
              "country": "ISR",
              "record_date": "29/12/2018"
            },
            "13": {
              "time": "32.58",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": ""
            },
            "14": {
              "time": "32.58",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "28/12/2016"
            },
            "15": {
              "time": "32.04",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "29/12/2018"
            },
            "16": {
              "time": "31.01",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "28/11/2019"
            },
            "17": {
              "time": "30.20",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": ""
            },
            "18": {
              "time": "29.34",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "17/12/2021"
            },
            "ISR": {
              "time": "29.34",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "17/12/2021"
            }
          },
          "100m": {
            "10": {
              "time": "01:26.21",
              "name": "עדי ביכמן",
              "club": "הפועל גבעתיים",
              "country": "ISR",
              "record_date": "24/12/1993"
            },
            "11": {
              "time": "01:20.66",
              "name": "שירה גמליי",
              "club": "מכבי וייסגל רחובות",
              "country": "ISR",
              "record_date": "18/12/2017"
            },
            "12": {
              "time": "01:13.83",
              "name": "שירה גמליי",
              "club": "מכבי וייסגל רחובות",
              "country": "ISR",
              "record_date": ""
            },
            "13": {
              "time": "01:10.30",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "30/12/2016"
            },
            "14": {
              "time": "01:09.63",
              "name": "לאה פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "30/12/2016"
            },
            "15": {
              "time": "01:07.44",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "29/12/2018"
            },
            "16": {
              "time": "01:07.44",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "29/12/2018"
            },
            "17": {
              "time": "01:05.28",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "16/11/2020"
            },
            "18": {
              "time": "01:04.44",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "02/10/2021"
            },
            "ISR": {
              "time": "01:03.90",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "03/12/2025"
            }
          },
          "200m": {
            "10": {
              "time": "03:07.98",
              "name": "קרינה סוקולוב",
              "club": "הפועל באר שבע",
              "country": "ISR",
              "record_date": "14/12/2009"
            },
            "11": {
              "time": "02:50.67",
              "name": "עדי ביכמן",
              "club": "הפועל גבעתיים",
              "country": "ISR",
              "record_date": ""
            },
            "12": {
              "time": "02:42.74",
              "name": "עדי ביכמן",
              "club": "הפועל גבעתיים",
              "country": "ISR",
              "record_date": "28/12/1995"
            },
            "13": {
              "time": "02:30.32",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "29/12/2016"
            },
            "14": {
              "time": "02:30.25",
              "name": "לאה פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "29/12/2016"
            },
            "15": {
              "time": "02:24.91",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "27/12/2018"
            },
            "16": {
              "time": "02:24.91",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "27/12/2018"
            },
            "17": {
              "time": "02:22.70",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "19/08/2020"
            },
            "18": {
              "time": "02:19.22",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "09/09/2021"
            },
            "ISR": {
              "time": "02:19.22",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "09/09/2021"
            }
          }
        },
        "backstroke": {
          "50m": {
            "10": {
              "time": "35.64",
              "name": "עדי כהן",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "30/12/1995"
            },
            "11": {
              "time": "33.27",
              "name": "עדי כהן",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "21/12/1996"
            },
            "12": {
              "time": "31.23",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "02/04/2005"
            },
            "13": {
              "time": "30.04",
              "name": "שירה אשכנזי",
              "club": "מכבי קרית אונו",
              "country": "ISR",
              "record_date": ""
            },
            "14": {
              "time": "29.09",
              "name": "אור מלצר",
              "club": "הפועל ה.ה.ב.ב",
              "country": "ISR",
              "record_date": "13/02/2002"
            },
            "15": {
              "time": "27.96",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "29/12/2018"
            },
            "16": {
              "time": "27.96",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "29/12/2018"
            },
            "17": {
              "time": "27.88",
              "name": "מרסי אן נגירה",
              "club": "בני הרצליה",
              "country": "ISR",
              "record_date": ""
            },
            "18": {
              "time": "26.63",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "01/10/2021"
            },
            "ISR": {
              "time": "26.63",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "01/10/2021"
            }
          },
          "100m": {
            "10": {
              "time": "01:15.71",
              "name": "איה גליל",
              "club": "מכבי כפר המכבייה",
              "country": "ISR",
              "record_date": "29/10/2021"
            },
            "11": {
              "time": "01:12.53",
              "name": "טל קדרון",
              "club": "הפועל מ.א. משגב",
              "country": "ISR",
              "record_date": "29/12/2006"
            },
            "12": {
              "time": "01:07.68",
              "name": "נועה שוהם",
              "club": "הפועל עמק חפר",
              "country": "ISR",
              "record_date": ""
            },
            "13": {
              "time": "01:03.34",
              "name": "מרסי אן נגירה",
              "club": "בני הרצליה",
              "country": "ISR",
              "record_date": "28/12/2018"
            },
            "14": {
              "time": "01:01.35",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "11/11/2017"
            },
            "15": {
              "time": "01:00.15",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "21/12/2018"
            },
            "16": {
              "time": "59.88",
              "name": "אופיר שמחה",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "26/12/2025"
            },
            "17": {
              "time": "58.37",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "22/08/2020"
            },
            "18": {
              "time": "57.45",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "16/12/2021"
            },
            "ISR": {
              "time": "56.73",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "26/12/2025"
            }
          },
          "200m": {
            "10": {
              "time": "02:45.46",
              "name": "עדי כהן",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "30/12/1995"
            },
            "11": {
              "time": "02:33.12",
              "name": "טל קדרון",
              "club": "הפועל מ.א. משגב",
              "country": "ISR",
              "record_date": ""
            },
            "12": {
              "time": "02:23.60",
              "name": "ניצן כץ-ליכטנשטיין",
              "club": "מר׳ כוכב יאיר",
              "country": "ISR",
              "record_date": "29/12/2011"
            },
            "13": {
              "time": "02:16.92",
              "name": "אילנית דימשיץ",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "26/12/2024"
            },
            "14": {
              "time": "02:11.82",
              "name": "אביב ברזילי",
              "club": "הפועל מ.א. משגב",
              "country": "ISR",
              "record_date": "28/12/2016"
            },
            "15": {
              "time": "02:10.65",
              "name": "אביב ברזילי",
              "club": "הפועל מ.א. משגב",
              "country": "ISR",
              "record_date": "27/12/2017"
            },
            "16": {
              "time": "02:08.71",
              "name": "אופיר שמחה",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "25/12/2025"
            },
            "17": {
              "time": "02:08.15",
              "name": "אביב ברזילי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "25/12/2019"
            },
            "18": {
              "time": "02:05.36",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "26/11/2021"
            },
            "ISR": {
              "time": "02:04.40",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "19/12/2022"
            }
          }
        },
        "butterfly": {
          "50m": {
            "10": {
              "time": "32.88",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "24/05/2003"
            },
            "11": {
              "time": "29.59",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "15/12/2004"
            },
            "12": {
              "time": "28.70",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "29/12/2005"
            },
            "13": {
              "time": "28.25",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": ""
            },
            "14": {
              "time": "28.25",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "29/12/2006"
            },
            "15": {
              "time": "27.51",
              "name": "ורד בורוכובסקי",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "10/12/1999"
            },
            "16": {
              "time": "27.00",
              "name": "דריה גולובטי",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "24/12/2021"
            },
            "17": {
              "time": "27.00",
              "name": "דריה גולובטי",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": ""
            },
            "18": {
              "time": "26.38",
              "name": "ורד בורוכובסקי",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "05/04/2002"
            },
            "ISR": {
              "time": "25.74",
              "name": "אניה גוסטומלסקי",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "11/04/2008"
            }
          },
          "100m": {
            "10": {
              "time": "01:14.61",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "27/12/2003"
            },
            "11": {
              "time": "01:06.44",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "24/12/2004"
            },
            "12": {
              "time": "01:02.92",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": ""
            },
            "13": {
              "time": "01:02.92",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "28/12/2005"
            },
            "14": {
              "time": "01:01.76",
              "name": "לאה פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "28/12/2016"
            },
            "15": {
              "time": "59.61",
              "name": "לאה פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "27/12/2017"
            },
            "16": {
              "time": "59.37",
              "name": "לאה פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "26/12/2018"
            },
            "17": {
              "time": "58.34",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "19/08/2020"
            },
            "18": {
              "time": "58.34",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "19/08/2020"
            },
            "ISR": {
              "time": "56.75",
              "name": "עמית עברי",
              "club": "הפועל עמק חפר",
              "country": "ISR",
              "record_date": "24/12/2014"
            }
          },
          "200m": {
            "10": {
              "time": "02:43.84",
              "name": "אנג׳לה זאבורויב",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "26/11/2022"
            },
            "11": {
              "time": "02:39.66",
              "name": "שרון שטיימן",
              "club": "הפועל פליפר חדרה",
              "country": "ISR",
              "record_date": ""
            },
            "12": {
              "time": "02:17.73",
              "name": "שרון שטיימן",
              "club": "הפועל פליפר חדרה",
              "country": "ISR",
              "record_date": "28/12/2017"
            },
            "13": {
              "time": "02:17.40",
              "name": "שרון שטיימן",
              "club": "הפועל פליפר חדרה",
              "country": "ISR",
              "record_date": "27/12/2018"
            },
            "14": {
              "time": "02:14.71",
              "name": "שרון שטיימן",
              "club": "הפועל פליפר חדרה",
              "country": "ISR",
              "record_date": "26/12/2019"
            },
            "15": {
              "time": "02:14.57",
              "name": "לאה פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "02/12/2017"
            },
            "16": {
              "time": "02:10.00",
              "name": "לאה פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "27/12/2018"
            },
            "17": {
              "time": "02:10.00",
              "name": "לאה פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "27/12/2018"
            },
            "18": {
              "time": "02:10.00",
              "name": "לאה פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "27/12/2018"
            },
            "ISR": {
              "time": "02:09.69",
              "name": "קרן זיבנר",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "17/12/2015"
            }
          }
        },
        "individual_medley": {
          "100m": {
            "10": {
              "time": "01:16.70",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "24/12/2003"
            },
            "11": {
              "time": "01:09.60",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "03/12/2004"
            },
            "12": {
              "time": "01:06.48",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "29/12/2005"
            },
            "13": {
              "time": "01:04.47",
              "name": "מעיין גראור",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": ""
            },
            "14": {
              "time": "01:04.47",
              "name": "מעיין גראור",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "24/12/2025"
            },
            "15": {
              "time": "01:01.67",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "21/12/2018"
            },
            "16": {
              "time": "01:00.07",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "05/12/2019"
            },
            "17": {
              "time": "57.90",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": ""
            },
            "18": {
              "time": "57.80",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "19/12/2021"
            },
            "ISR": {
              "time": "57.17",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "04/12/2025"
            }
          },
          "200m": {
            "10": {
              "time": "02:40.29",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "27/12/2003"
            },
            "11": {
              "time": "02:27.97",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "24/12/2004"
            },
            "12": {
              "time": "02:23.35",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": ""
            },
            "13": {
              "time": "02:18.66",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "31/12/2016"
            },
            "14": {
              "time": "02:13.57",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "30/11/2017"
            },
            "15": {
              "time": "02:09.04",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "28/12/2018"
            },
            "16": {
              "time": "02:07.64",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "27/10/2019"
            },
            "17": {
              "time": "02:05.98",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "09/11/2020"
            },
            "18": {
              "time": "02:05.04",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "04/09/2021"
            },
            "ISR": {
              "time": "02:04.93",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "19/10/2025"
            }
          },
          "400m": {
            "10": {
              "time": "05:52.24",
              "name": "עדן פסקרה",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "23/12/2010"
            },
            "11": {
              "time": "05:14.12",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": ""
            },
            "12": {
              "time": "05:03.03",
              "name": "דריה גולובטי",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "30/12/2017"
            },
            "13": {
              "time": "04:54.83",
              "name": "דריה גולובטי",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "29/12/2018"
            },
            "14": {
              "time": "04:49.57",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "28/10/2017"
            },
            "15": {
              "time": "04:48.50",
              "name": "ורד בורוכובסקי",
              "club": "מכבי אשדוד",
              "country": "ISR",
              "record_date": "24/12/1999"
            },
            "16": {
              "time": "04:35.82",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "30/11/2019"
            },
            "17": {
              "time": "04:32.67",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "25/10/2020"
            },
            "18": {
              "time": "04:32.67",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "25/10/2020"
            },
            "ISR": {
              "time": "04:32.67",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "25/10/2020"
            }
          },
          "4X50m": {
            "10": {
              "time": "02:33.30",
              "name": "",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "24/12/1995"
            },
            "11": {
              "time": "02:33.30",
              "name": "",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "24/12/1995"
            },
            "12": {
              "time": "02:02.55",
              "name": "גלי קוקס-מעגן, שירה גמליי, ליליה אפשטיין,מיטל שרגין",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "22/01/2016"
            },
            "13": {
              "time": "02:02.55",
              "name": "גלי קוקס-מעגן, שירה גמליי, ליליה אפשטיין,מיטל שרגין",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "22/01/2016"
            },
            "14": {
              "time": "02:00.00",
              "name": "ליזה קרסיוב, אילי בן דוד, איה גליל, רות רייס",
              "club": "מכבי מרום רמת גן",
              "country": "ISR",
              "record_date": "26/12/2024"
            },
            "15": {
              "time": "02:00.00",
              "name": "ליזה קרסיוב, אילי בן דוד, איה גליל, רות רייס",
              "club": "מכבי מרום רמת גן",
              "country": "ISR",
              "record_date": ""
            },
            "16": {
              "time": "01:56.72",
              "name": "דריה גולובטי, רומי חביב, נועה יעיש, יובל סגל",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "25/12/2021"
            },
            "17": {
              "time": "01:55.06",
              "name": "מיטל פליקשטיין, אלמה גלסמן, רויטל ברנוט, שאין גולנד",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "25/12/2024"
            },
            "18": {
              "time": "01:53.93",
              "name": "אביב ברזילי, לאה פולונסקי, רז הראל, רוני קלט",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "28/12/2019"
            },
            "ISR": {
              "time": "01:50.51",
              "name": "אנדראה מורז, עמית עברי ,קרן זיבנר, זהר שיקלר",
              "club": "נבחרת ישראל",
              "country": "ISR",
              "record_date": "06/12/2015"
            },
            "adults": {
              "time": "01:53.73",
              "name": "אניה גוסטמלסקי, זהר שיקלר, קרן זיבנר, חיה זבלודוף",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": ""
            }
          },
          "4X100m": {
            "12": {
              "time": "04:46.42",
              "name": "",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "30/12/2011"
            },
            "13": {
              "time": "04:46.42",
              "name": "",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "30/12/2011"
            },
            "14": {
              "time": "04:27.95",
              "name": "אלכסיה סבשצינסקי, רומי חביב, אופיר רכאח, דריה גולובטי",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "29/11/2019"
            },
            "15": {
              "time": "04:27.95",
              "name": "אלכסיה סבשצינסקי, רומי חביב, אופיר רכאח, דריה גולובטי",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "29/11/2019"
            },
            "16": {
              "time": "04:17.65",
              "name": "דריה גולובטי, רומי חביב, נועה יעיש, יובל סגל",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "26/11/2021"
            },
            "17": {
              "time": "04:17.65",
              "name": "דריה גולובטי, רומי חביב, נועה יעיש, יובל סגל",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "26/11/2021"
            },
            "18": {
              "time": "04:15.71",
              "name": "מיניס, קרן אייזברוך, אליסיה מושקוביץ, לוריין לונגו-קליבלנד",
              "club": "מכבי ראשון לציון",
              "country": "ISR",
              "record_date": "23/12/2023"
            },
            "ISR": {
              "time": "04:09.21",
              "name": "אנאל וולפמן, אנסטסיה קורוטקוב, קרן זיבנר, אניה גוסטמלסקי",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "15/02/2014"
            },
            "adults": {
              "time": "04:09.21",
              "name": "אנאל וולפמן, אנסטסיה קורוטקוב, קרן זיבנר, אניה גוסטמלסקי",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "15/02/2014"
            }
          }
        }
      },
      "50m_pool": {
        "freestyle": {
          "50m": {
            "10": {
              "time": "31.18",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "29/07/2003"
            },
            "11": {
              "time": "29.11",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "03/08/2004"
            },
            "12": {
              "time": "28.07",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "20/05/2005"
            },
            "13": {
              "time": "27.44",
              "name": "מיכל אוגינץ",
              "club": "",
              "country": "ISR",
              "record_date": ""
            },
            "14": {
              "time": "26.51",
              "name": "שאין גולנד",
              "club": "הפועל מ. א. משגב",
              "country": "ISR",
              "record_date": "19/07/2021"
            },
            "15": {
              "time": "25.92",
              "name": "דריה גולובטי",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "18/12/2020"
            },
            "16": {
              "time": "25.76",
              "name": "שאין גולנד",
              "club": "הפועל מ. א. משגב",
              "country": "ISR",
              "record_date": "08/09/2023"
            },
            "17": {
              "time": "25.03",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "18/12/2020"
            },
            "18": {
              "time": "25.03",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "11/06/2021"
            },
            "ISR": {
              "time": "25.03",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "11/06/2021"
            }
          },
          "100m": {
            "10": {
              "time": "01:07.83",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "30/07/2003"
            },
            "11": {
              "time": "01:03.53",
              "name": "שרון שטיימן",
              "club": "הפועל פליפר חדרה",
              "country": "ISR",
              "record_date": "26/07/2016"
            },
            "12": {
              "time": "01:01.21",
              "name": "ענת זימין",
              "club": "מכבי קרית-ביאליק",
              "country": "ISR",
              "record_date": "21/05/2005"
            },
            "13": {
              "time": "59.82",
              "name": "ענת זימין",
              "club": "מכבי קרית-ביאליק",
              "country": "ISR",
              "record_date": "10/08/2006"
            },
            "14": {
              "time": "57.68",
              "name": "מרטינה מרקס",
              "club": "הפועל גבעתיים",
              "country": "ISR",
              "record_date": "06/08/2009"
            },
            "15": {
              "time": "55.88",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "09/10/2018"
            },
            "16": {
              "time": "55.60",
              "name": "דריה גולובטי",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "06/07/2021"
            },
            "17": {
              "time": "54.38",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "18/12/2020"
            },
            "18": {
              "time": "54.38",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "18/12/2020"
            },
            "ISR": {
              "time": "54.06",
              "name": "אנדראה מורז",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "28/07/2021"
            }
          },
          "200m": {
            "10": {
              "time": "02:28.90",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": ""
            },
            "11": {
              "time": "02:17.68",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "18/06/2004"
            },
            "12": {
              "time": "02:11.83",
              "name": "ענת זימין",
              "club": "מכבי קרית-ביאליק",
              "country": "ISR",
              "record_date": "06/05/2005"
            },
            "13": {
              "time": "02:07.41",
              "name": "בקי פוזדנר",
              "club": "בת-ים",
              "country": "ISR",
              "record_date": "10/07/2017"
            },
            "14": {
              "time": "02:03.38",
              "name": "דריה גולובטי",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "25/07/2019"
            },
            "15": {
              "time": "02:03.04",
              "name": "בקי פוזדנר",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "03/08/2019"
            },
            "16": {
              "time": "02:00.83",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "26/05/2019"
            },
            "17": {
              "time": "01:59.38",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "18/12/2020"
            },
            "18": {
              "time": "01:58.24",
              "name": "דריה גולובטי",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "09/06/2023"
            },
            "ISR": {
              "time": "01:56.74",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "17/06/2024"
            }
          },
          "400m": {
            "11": {
              "time": "04:50.01",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "05/08/2004"
            },
            "12": {
              "time": "04:40.37",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "04/06/2005"
            },
            "13": {
              "time": "04:24.34",
              "name": "בקי פוזדנר",
              "club": "בת-ים",
              "country": "ISR",
              "record_date": "24/06/2017"
            },
            "14": {
              "time": "04:20.03",
              "name": "מור פליישמן",
              "club": "מכבי וייסגל רחובות",
              "country": "ISR",
              "record_date": "25/06/2004"
            },
            "15": {
              "time": "04:17.74",
              "name": "בקי פוזדנר",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": ""
            },
            "16": {
              "time": "04:17.74",
              "name": "בקי פוזדנר",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "24/07/2019"
            },
            "17": {
              "time": "04:17.74",
              "name": "בקי פוזדנר",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "24/07/2019"
            },
            "18": {
              "time": "04:11.40",
              "name": "דריה גולובטי",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "07/06/2023"
            },
            "ISR": {
              "time": "04:11.40",
              "name": "דריה גולובטי",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "07/06/2023"
            }
          },
          "800m": {
            "10": {
              "time": "05:08.32",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "31/07/2003"
            },
            "11": {
              "time": "10:08.59",
              "name": "הדר קלינמן",
              "club": "מכ. קרית -אונו",
              "country": "ISR",
              "record_date": "01/01/1981"
            },
            "12": {
              "time": "09:45.38",
              "name": "ויטה זיגלבוים",
              "club": "מכבי קרית אונו",
              "country": "ISR",
              "record_date": "05/06/2015"
            },
            "13": {
              "time": "18:25.38",
              "name": "יעל דניאלי",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "21/07/2010"
            },
            "14": {
              "time": "17:08.77",
              "name": "בקי פוזדנר",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "26/04/2018"
            },
            "15": {
              "time": "17:04.67",
              "name": "בקי פוזדנר",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "30/07/2019"
            },
            "16": {
              "time": "17:04.67",
              "name": "בקי פוזדנר",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "30/07/2019"
            },
            "17": {
              "time": "16:44.61",
              "name": "גלי זילברברג",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "06/07/2018"
            },
            "18": {
              "time": "16:44.61",
              "name": "גלי זילברברג",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "06/07/2018"
            },
            "ISR": {
              "time": "16:44.61",
              "name": "גלי זילברברג",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "06/07/2018"
            }
          },
          "4X100m": {
            "10": {
              "time": "02:24.26",
              "name": "",
              "club": "מכבי קרית אונו",
              "country": "ISR",
              "record_date": ""
            },
            "11": {
              "time": "02:15.73",
              "name": "דטנו, אוליביה ימפולסקי׳, זוהר קופליאנסקי, מאיה",
              "club": "זגדון בני הרצליה",
              "country": "ISR",
              "record_date": "20/07/2024"
            },
            "12": {
              "time": "04:29.94",
              "name": "",
              "club": "מכבי נהריה",
              "country": "ISR",
              "record_date": "31/07/2006"
            },
            "13": {
              "time": "01:58.55",
              "name": "פוזדנר, אלכסיה סבשצ׳ינסקי, רוני עוז, דריה",
              "club": "גולובטי הפועל בת-ים",
              "country": "ISR",
              "record_date": "23/07/2017"
            },
            "14": {
              "time": "09:01.94",
              "name": "רוני עוז, הילה שובל, רומי חביב, מיקה ביבטקו",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": ""
            },
            "15": {
              "time": "08:58.47",
              "name": "ליהי לב, אביה בלומברג, תהל אלבז, זהר כהן הרפניסט",
              "club": "מכבי מרום ר\"ג",
              "country": "ISR",
              "record_date": "08/08/2024"
            },
            "16": {
              "time": "08:43.76",
              "name": "אלמה גלסמן, שאין גולנד, מיטל פליקשטיין, איילה",
              "club": "שהם הפועל מ. א. משגב",
              "country": "ISR",
              "record_date": "10/06/2023"
            },
            "17": {
              "time": "08:43.76",
              "name": "אלמה גלסמן, שאין גולנד, מיטל פליקשטיין, איילה",
              "club": "שהם הפועל מ. א. משגב",
              "country": "ISR",
              "record_date": "10/06/2023"
            },
            "18": {
              "time": "08:24.20",
              "name": "דריה גולובטי, יובל סגל, אדיר אופק, בקי פוזנר",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "29/07/2022"
            },
            "ISR": {
              "time": "07:51.83",
              "name": "אנסטסיה גורבנקו, דריה גולובטי, איילה שפיץ, לאה",
              "club": "פולונסקי נבחרת ישראל",
              "country": "ISR",
              "record_date": "18/06/2024"
            },
            "adults": {
              "time": "08:22.45",
              "name": "אנדראה מורז, ג׳סיקה אנטילס, מרטינה מרקס, רוני",
              "club": "בווה הפועל ירושלים",
              "country": "ISR",
              "record_date": "03/08/2017"
            }
          }
        },
        "breaststroke": {
          "50m": {
            "10": {
              "time": "41.13",
              "name": "מרסי אן נגירה",
              "club": "בני הרצליה",
              "country": "ISR",
              "record_date": "05/06/2015"
            },
            "11": {
              "time": "37.10",
              "name": "ענת זימין",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "01/05/2004"
            },
            "12": {
              "time": "36.16",
              "name": "מרסי אן נגירה",
              "club": "בני הרצליה",
              "country": "ISR",
              "record_date": "04/08/2017"
            },
            "13": {
              "time": "34.55",
              "name": "מרסי אן נגירה",
              "club": "בני הרצליה",
              "country": "ISR",
              "record_date": "25/07/2018"
            },
            "14": {
              "time": "34.03",
              "name": "גלי פסקרה",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "04/08/2017"
            },
            "15": {
              "time": "33.23",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": ""
            },
            "16": {
              "time": "31.73",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "03/08/2019"
            },
            "17": {
              "time": "31.73",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "03/08/2019"
            },
            "18": {
              "time": "31.33",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "18/05/2021"
            },
            "ISR": {
              "time": "30.30",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "02/08/2025"
            }
          },
          "100m": {
            "10": {
              "time": "01:28.05",
              "name": "יעל נרודיצקי",
              "club": "הפועל דולפין נהריה",
              "country": "ISR",
              "record_date": ""
            },
            "11": {
              "time": "01:23.01",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "04/08/2004"
            },
            "12": {
              "time": "01:18.00",
              "name": "עדי ביכמן",
              "club": "הפועל גבעתיים",
              "country": "ISR",
              "record_date": "04/08/1995"
            },
            "13": {
              "time": "01:14.33",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "25/06/2016"
            },
            "14": {
              "time": "01:12.29",
              "name": "לאה פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "25/06/2016"
            },
            "15": {
              "time": "01:09.44",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "04/08/2018"
            },
            "16": {
              "time": "01:09.28",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "31/07/2019"
            },
            "17": {
              "time": "01:08.93",
              "name": "יוליה בנך",
              "club": "הפועל אילת",
              "country": "ISR",
              "record_date": "27/02/2009"
            },
            "18": {
              "time": "01:06.74",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "18/05/2021"
            },
            "ISR": {
              "time": "01:06.15",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "18/06/2024"
            }
          },
          "200m": {
            "10": {
              "time": "03:10.73",
              "name": "יעל נרודיצקי",
              "club": "הפועל דולפין נהריה",
              "country": "ISR",
              "record_date": "01/08/2006"
            },
            "11": {
              "time": "02:58.31",
              "name": "קרינה סוקולוב",
              "club": "הפועל באר-שבע",
              "country": "ISR",
              "record_date": "28/07/2010"
            },
            "12": {
              "time": "02:47.48",
              "name": "עדי ביכמן",
              "club": "הפועל גבעתיים",
              "country": "ISR",
              "record_date": ""
            },
            "13": {
              "time": "02:38.80",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "26/06/2016"
            },
            "14": {
              "time": "02:35.94",
              "name": "אנסטסיה גורבנקו",
              "club": "קרית ביאליק",
              "country": "ISR",
              "record_date": "25/06/2017"
            },
            "15": {
              "time": "02:29.17",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "05/07/2018"
            },
            "16": {
              "time": "02:28.78",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "24/05/2019"
            },
            "17": {
              "time": "02:28.78",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "24/05/2019"
            },
            "18": {
              "time": "02:25.20",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "13/06/2021"
            },
            "ISR": {
              "time": "02:25.20",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "13/06/2021"
            }
          }
        },
        "backstroke": {
          "50m": {
            "10": {
              "time": "34.08",
              "name": "מירה מירוסלבה אושקובה",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "20/07/2025"
            },
            "11": {
              "time": "34.08",
              "name": "מירה מירוסלבה אושקובה",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "20/07/2025"
            },
            "12": {
              "time": "32.23",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "21/05/2005"
            },
            "13": {
              "time": "31.10",
              "name": "שירה אשכנזי",
              "club": "מכבי קרית אונו",
              "country": "ISR",
              "record_date": "16/07/2016"
            },
            "14": {
              "time": "30.17",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "29/04/2017"
            },
            "15": {
              "time": "29.80",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": ""
            },
            "16": {
              "time": "28.21",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "03/07/2019"
            },
            "17": {
              "time": "28.21",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "03/07/2019"
            },
            "18": {
              "time": "28.21",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "03/07/2019"
            },
            "ISR": {
              "time": "27.55",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "18/05/2025"
            }
          },
          "200m": {
            "10": {
              "time": "02:51.15",
              "name": "איה גליל",
              "club": "מכבי כפר המכביה",
              "country": "ISR",
              "record_date": "02/08/2021"
            },
            "11": {
              "time": "02:35.78",
              "name": "עופרי קמר",
              "club": "הפועל חולון",
              "country": "ISR",
              "record_date": "15/07/2018"
            },
            "12": {
              "time": "02:27.45",
              "name": "שני סיילוב",
              "club": "מר׳ כוכב יאיר",
              "country": "ISR",
              "record_date": "29/06/1995"
            },
            "13": {
              "time": "02:24.75",
              "name": "אילנית דימשיץ",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "08/08/2024"
            },
            "14": {
              "time": "02:19.94",
              "name": "גיא שילון",
              "club": "מכבי פ.מ. רעות",
              "country": "ISR",
              "record_date": "27/07/2011"
            },
            "15": {
              "time": "02:14.24",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "29/10/2018"
            },
            "16": {
              "time": "02:13.50",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "16/03/2019"
            },
            "17": {
              "time": "02:11.91",
              "name": "אביב ברזילי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "27/08/2019"
            },
            "18": {
              "time": "02:10.86",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "10/04/2021"
            },
            "ISR": {
              "time": "02:08.54",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "29/05/2024"
            }
          }
        },
        "butterfly": {
          "50m": {
            "10": {
              "time": "34.27",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "25/04/2003"
            },
            "11": {
              "time": "30.65",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "01/05/2004"
            },
            "12": {
              "time": "28.98",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "20/05/2005"
            },
            "13": {
              "time": "28.43",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "11/08/2006"
            },
            "14": {
              "time": "27.43",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "07/08/2007"
            },
            "15": {
              "time": "27.43",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": ""
            },
            "16": {
              "time": "26.70",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "26/07/2019"
            },
            "17": {
              "time": "26.70",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "26/07/2019"
            },
            "18": {
              "time": "26.70",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "26/07/2019"
            },
            "ISR": {
              "time": "26.13",
              "name": "עמית עברי",
              "club": "הפועל עמק-חפר",
              "country": "ISR",
              "record_date": "18/08/2014"
            }
          },
          "100m": {
            "10": {
              "time": "01:16.05",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": ""
            },
            "11": {
              "time": "01:07.13",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "04/08/2004"
            },
            "12": {
              "time": "01:04.34",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "29/07/2005"
            },
            "13": {
              "time": "01:03.09",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "30/06/2006"
            },
            "14": {
              "time": "01:01.74",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "10/08/2007"
            },
            "15": {
              "time": "01:01.08",
              "name": "ורד בורוכובסקי",
              "club": "מכ. אשדוד",
              "country": "ISR",
              "record_date": "17/07/1999"
            },
            "16": {
              "time": "59.67",
              "name": "ורד בורוכובסקי",
              "club": "מכ. אשדוד",
              "country": "ISR",
              "record_date": "06/08/2000"
            },
            "17": {
              "time": "59.63",
              "name": "ורד בורוכובסקי",
              "club": "מכ. אשדוד",
              "country": "ISR",
              "record_date": "27/02/2001"
            },
            "18": {
              "time": "58.23",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "24/07/2021"
            },
            "ISR": {
              "time": "58.21",
              "name": "עמית עברי",
              "club": "הפועל עמק-חפר",
              "country": "ISR",
              "record_date": "08/08/2009"
            }
          },
          "200m": {
            "10": {
              "time": "03:06.52",
              "name": "לי ראובני",
              "club": "",
              "country": "ISR",
              "record_date": "03/08/1999"
            },
            "11": {
              "time": "02:47.06",
              "name": "ענבר רשף",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": "29/07/2005"
            },
            "12": {
              "time": "02:26.61",
              "name": "ניצן כץ-ליכטנשטיין",
              "club": "הפועל ירושלים",
              "country": "ISR",
              "record_date": ""
            },
            "13": {
              "time": "02:17.99",
              "name": "שרון שטיימן",
              "club": "הפועל פליפר חדרה",
              "country": "ISR",
              "record_date": "26/07/2018"
            },
            "14": {
              "time": "02:14.45",
              "name": "שרון שטיימן",
              "club": "הפועל פליפר חדרה",
              "country": "ISR",
              "record_date": "24/07/2019"
            },
            "15": {
              "time": "02:14.45",
              "name": "שרון שטיימן",
              "club": "הפועל פליפר חדרה",
              "country": "ISR",
              "record_date": "24/07/2019"
            },
            "16": {
              "time": "02:14.45",
              "name": "שרון שטיימן",
              "club": "הפועל פליפר חדרה",
              "country": "ISR",
              "record_date": "24/07/2019"
            },
            "17": {
              "time": "02:14.22",
              "name": "מאי לווי",
              "club": "מכבי קרית אונו",
              "country": "ISR",
              "record_date": "04/05/2018"
            },
            "18": {
              "time": "02:12.82",
              "name": "לאה פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "09/02/2020"
            },
            "ISR": {
              "time": "02:10.80",
              "name": "לאה פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "02/12/2023"
            }
          }
        },
        "individual_medley": {
          "200m": {
            "10": {
              "time": "02:45.00",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "31/07/2003"
            },
            "11": {
              "time": "02:35.37",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "05/08/2004"
            },
            "12": {
              "time": "02:29.91",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "07/05/2005"
            },
            "13": {
              "time": "02:23.88",
              "name": "ענת זימין",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "20/05/2006"
            },
            "14": {
              "time": "02:18.91",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "05/08/2017"
            },
            "15": {
              "time": "02:12.88",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": ""
            },
            "16": {
              "time": "02:11.92",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "21/07/2019"
            },
            "17": {
              "time": "02:11.92",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "21/07/2019"
            },
            "18": {
              "time": "02:09.99",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "22/05/2021"
            },
            "ISR": {
              "time": "02:08.55",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "29/05/2024"
            }
          },
          "400m": {
            "10": {
              "time": "06:08.01",
              "name": "",
              "club": "",
              "country": "ISR",
              "record_date": "02/08/1999"
            },
            "11": {
              "time": "05:52.66",
              "name": "לי ראובני",
              "club": "הפ. ק.ג. ת\"א",
              "country": "ISR",
              "record_date": "27/07/2000"
            },
            "12": {
              "time": "05:21.18",
              "name": "דריה גולובטי",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "24/07/2017"
            },
            "13": {
              "time": "05:07.05",
              "name": "דריה גולובטי",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "25/07/2018"
            },
            "14": {
              "time": "05:00.02",
              "name": "לאה פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "17/07/2016"
            },
            "15": {
              "time": "04:53.81",
              "name": "לאה פולונסקי",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "04/08/2017"
            },
            "16": {
              "time": "04:47.58",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "23/03/2019"
            },
            "17": {
              "time": "04:41.48",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "08/02/2020"
            },
            "18": {
              "time": "04:41.48",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "08/02/2020"
            },
            "ISR": {
              "time": "04:34.87",
              "name": "אנסטסיה גורבנקו",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "01/06/2024"
            }
          },
          "4X100m": {
            "10": {
              "time": "02:38.29",
              "name": "",
              "club": "מכבי קרית -אונו",
              "country": "ISR",
              "record_date": ""
            },
            "11": {
              "time": "02:36.85",
              "name": "ג׳וליה דטנו, שירה גוטהילף, מאיה זגדון, אוליביה",
              "club": "ימפולסקי בני הרצליה",
              "country": "ISR",
              "record_date": "20/07/2024"
            },
            "12": {
              "time": "05:12.00",
              "name": "גוני שלום ידפת , מרסי אן נגירה, ליה גונן, דנה מאיטלס",
              "club": "בני הרצליה",
              "country": "ISR",
              "record_date": "03/06/2016"
            },
            "13": {
              "time": "05:12.00",
              "name": "גוני שלום ידפת , מרסי אן נגירה, ליה גונן, דנה מאיטלס",
              "club": "בני הרצליה",
              "country": "ISR",
              "record_date": "03/06/2016"
            },
            "14": {
              "time": "04:45.59",
              "name": "",
              "club": "הפועל גבעתיים",
              "country": "ISR",
              "record_date": "05/08/1996"
            },
            "15": {
              "time": "04:29.26",
              "name": "ליהי לב, גולצוב אוה, תהל אלבז, זהר כהן הרפניסט",
              "club": "מכבי מרום ר\"ג",
              "country": "ISR",
              "record_date": "10/08/2024"
            },
            "16": {
              "time": "04:28.19",
              "name": "פליקשטיין, אלמה גלסמן, שאין גולנד, אביגיל",
              "club": "סטרוגצקי הפועל מ.א משגב",
              "country": "ISR",
              "record_date": "21/07/2023"
            },
            "17": {
              "time": "04:25.94",
              "name": "מיטל פליקשטיין, אלמה גלסמן, יובל פרלמן, שאין",
              "club": "גולנד הפועל מ.א משגב",
              "country": "ISR",
              "record_date": "24/02/2024"
            },
            "18": {
              "time": "04:19.09",
              "name": "מיטל פליקשטיין, אלמה כלסמן, רויטל ברנוט, שאין",
              "club": "גולנד מכבי חיפה",
              "country": "ISR",
              "record_date": "28/07/2025"
            },
            "ISR": {
              "time": "04:02.43",
              "name": "ברזילי, אנסטסיה גורבנקו, אריאל חיון, לאה",
              "club": "פולונסקי נבחרת ישראל",
              "country": "ISR",
              "record_date": "03/08/2025"
            },
            "adults": {
              "time": "04:10.57",
              "name": "אביב ברזילי, לאה פולונסקי, אריאל חיון, איילה שפיץ",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "08/06/2023"
            }
          }
        }
      }
    },
    "mix": {
      "25m_pool": {
        "freestyle": {
          "4X50m": {
            "12": {
              "time": "01:56.02",
              "name": "תומר איזבקוב, עומר כשריאל, עדן שץ, ליאור איליאגויב",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "06/12/2025"
            },
            "13": {
              "time": "01:56.02",
              "name": "תומר איזבקוב, עומר כשריאל, עדן שץ, ליאור איליאגויב",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "06/12/2025"
            },
            "14": {
              "time": "01:43.24",
              "name": "שגיא כהן, ירין שמאי, דוריה גורלסקי, שי וקסמן נעמן",
              "club": "מכבי ראשון לציון",
              "country": "ISR",
              "record_date": "23/12/2022"
            },
            "15": {
              "time": "01:43.24",
              "name": "שגיא כהן, ירין שמאי, דוריה גורלסקי, שי וקסמן נעמן",
              "club": "מכבי ראשון לציון",
              "country": "ISR",
              "record_date": "23/12/2022"
            },
            "16": {
              "time": "01:43.24",
              "name": "שגיא כהן, ירין שמאי, דוריה גורלסקי, שי וקסמן נעמן",
              "club": "מכבי ראשון לציון",
              "country": "ISR",
              "record_date": "23/12/2022"
            },
            "17": {
              "time": "01:43.24",
              "name": "שגיא כהן, ירין שמאי, דוריה גורלסקי, שי וקסמן נעמן",
              "club": "מכבי ראשון לציון",
              "country": "ISR",
              "record_date": "23/12/2022"
            },
            "18": {
              "time": "01:39.58",
              "name": "דניאל רבינוביץ׳, גל סחרוב, אופק אדיר, יובל בגל",
              "club": "הפועל בת ים",
              "country": "ISR",
              "record_date": "23/12/2022"
            },
            "ISR": {
              "time": "01:32.55",
              "name": "זיו קולונטרוב, אור סבטייה, זהר שיקלר, אנדראה מורז",
              "club": "נבחרת ישראל",
              "country": "ISR",
              "record_date": "05/12/2015"
            },
            "adults": {
              "time": "01:33.69",
              "name": "מרקוס ג׳ון שלזינגר, זהר שיקלר, קרן זיבנר, אהרון גרינברג",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "12/06/2021"
            }
          },
          "4X100m": {
            "12": {
              "time": "09:15.62",
              "name": "",
              "club": "הפועל חולון",
              "country": "ISR",
              "record_date": "30/12/2011"
            },
            "13": {
              "time": "09:15.62",
              "name": "",
              "club": "הפועל חולון",
              "country": "ISR",
              "record_date": "30/12/2011"
            },
            "14": {
              "time": "04:03.20",
              "name": "דוד דמיטרייב, איילה לוי, אילנית דימשיץ, שון פומברג",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "07/03/2024"
            },
            "15": {
              "time": "04:03.20",
              "name": "",
              "club": "",
              "country": "ISR",
              "record_date": "07/03/2024"
            },
            "16": {
              "time": "04:03.20",
              "name": "דוד דמיטרייב, איילה לוי, אילנית דימשיץ, שון פומברג",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "07/03/2024"
            },
            "17": {
              "time": "04:03.20",
              "name": "דוד דמיטרייב, איילה לוי, אילנית דימשיץ, שון פומברג",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "07/03/2024"
            },
            "18": {
              "time": "04:03.20",
              "name": "דוד דמיטרייב, איילה לוי, אילנית דימשיץ, שון פומברג",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "07/03/2024"
            },
            "ISR": {
              "time": "04:03.20",
              "name": "דוד דמיטרייב, איילה לוי, אילנית דימשיץ, שון פומברג",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "07/03/2024"
            },
            "adults": {
              "time": "04:03.20",
              "name": "",
              "club": "",
              "country": "ISR",
              "record_date": "07/03/2024"
            }
          }
        },
        "individual_medley": {
          "4X50m": {
            "12": {
              "time": "02:13.76",
              "name": "ליאור אליאגויב, תומר איזבקוב, עומר כשריאן, עדן שץ",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "04/12/2025"
            },
            "13": {
              "time": "02:04.66",
              "name": "אביב פרידמן, ולדי פיסחוב, מרי פלייטון, סופי נחמין",
              "club": "הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "27/12/2025"
            },
            "14": {
              "time": "01:55.78",
              "name": "אלעד סומינסקי, מוניר אבו ח׳ליס, מעיין גראות, תהל רוט",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "04/12/2025"
            },
            "15": {
              "time": "01:50.96",
              "name": "רפאל יוסקוביץ-לב ארי, שחר כשריאל, תומר רוזנר, נורית",
              "club": "מקליס מכבי א.ס. רמת השרון",
              "country": "ISR",
              "record_date": "27/12/2025"
            },
            "16": {
              "time": "01:50.96",
              "name": "רפאל יוסקוביץ-לב ארי, שחר כשריאל, תומר רוזנר, נורית",
              "club": "מקליס מכבי א.ס. רמת השרון",
              "country": "ISR",
              "record_date": "27/12/2025"
            },
            "17": {
              "time": "01:50.96",
              "name": "רפאל יוסקוביץ-לב ארי, שחר כשריאל, תומר רוזנר, נורית",
              "club": "מקליס מכבי א.ס. רמת השרון",
              "country": "ISR",
              "record_date": "27/12/2025"
            },
            "18": {
              "time": "01:48.48",
              "name": "אלמה גלסמן, יונתם גרציוב, דניאל ברנדינר, שאין גולנד",
              "club": "מכבי חיפה",
              "country": "ISR",
              "record_date": "28/12/2024"
            },
            "ISR": {
              "time": "01:40.48",
              "name": "גיא ברנע, שחף יהב, עמית עברי, אנדראה מורז",
              "club": "נבחרת ישראל",
              "country": "ISR",
              "record_date": "03/12/2015"
            },
            "adults": {
              "time": "01:43.93",
              "name": "ליברמן, אהרון גרינברג סמואל, תומר פרנקל , אנדראה",
              "club": "מורז הפועל ירושלים",
              "country": "ISR",
              "record_date": "27/12/2019"
            }
          },
          "4X100m": {
            "12": {
              "time": "04:43.23",
              "name": "עומר כשריאן, עדן שץ, תומר איזבקוב, ליאור איליאגויב",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "04/12/2025"
            },
            "13": {
              "time": "04:43.23",
              "name": "עומר כשריאן, עדן שץ, תומר איזבקוב, ליאור איליאגויב",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "04/12/2025"
            },
            "14": {
              "time": "04:43.23",
              "name": "",
              "club": "",
              "country": "ISR",
              "record_date": "04/12/2025"
            },
            "15": {
              "time": "04:43.23",
              "name": "עומר כשריאן, עדן שץ, תומר איזבקוב, ליאור איליאגויב",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "04/12/2025"
            },
            "16": {
              "time": "04:43.23",
              "name": "עומר כשריאן, עדן שץ, תומר איזבקוב, ליאור איליאגויב",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "04/12/2025"
            },
            "17": {
              "time": "04:43.23",
              "name": "עומר כשריאן, עדן שץ, תומר איזבקוב, ליאור איליאגויב",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "04/12/2025"
            },
            "18": {
              "time": "04:43.23",
              "name": "עומר כשריאן, עדן שץ, תומר איזבקוב, ליאור איליאגויב",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "04/12/2025"
            },
            "ISR": {
              "time": "04:43.23",
              "name": "עומר כשריאן, עדן שץ, תומר איזבקוב, ליאור איליאגויב",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "04/12/2025"
            },
            "adults": {
              "time": "04:43.23",
              "name": "עומר כשריאן, עדן שץ, תומר איזבקוב, ליאור איליאגויב",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "04/12/2025"
            },
            "": {
              "time": "04:43.23",
              "name": "",
              "club": "הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "04/12/2025"
            }
          }
        }
      },
      "50m_pool": {
        "freestyle": {
          "4X100m": {
            "12": {
              "time": "09:55.22",
              "name": "גוני שלום יופת, ליה גונן, יובל גד, דנה מאיטלס",
              "club": "בני הרצליה",
              "country": "ISR",
              "record_date": "16/07/2016"
            },
            "13": {
              "time": "09:55.22",
              "name": "גוני שלום יופת, ליה גונן, יובל גד, דנה מאיטלס",
              "club": "בני הרצליה",
              "country": "ISR",
              "record_date": "16/07/2016"
            },
            "14": {
              "time": "04:05.51",
              "name": "אילנית דימשיץ, שון פומברג, איילה לוי, דוד דמיטרייב",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "24/07/2024"
            },
            "15": {
              "time": "04:05.51",
              "name": "אילנית דימשיץ, שון פומברג, איילה לוי, דוד דמיטרייב",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "24/07/2024"
            },
            "16": {
              "time": "04:05.51",
              "name": "אילנית דימשיץ, שון פומברג, איילה לוי, דוד דמיטרייב",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "24/07/2024"
            },
            "17": {
              "time": "04:05.51",
              "name": "אילנית דימשיץ, שון פומברג, איילה לוי, דוד דמיטרייב",
              "club": "מכבי קרית ביאליק",
              "country": "ISR",
              "record_date": "24/07/2024"
            },
            "18": {
              "time": "03:54.14",
              "name": "יוסיפוב, אדם מושקוביץ, מאי דניאלוב, מילנה",
              "club": "ליאפוסטין הפועל אולימפ נתניה",
              "country": "ISR",
              "record_date": "13/06/2021"
            },
            "ISR": {
              "time": "07:32.96",
              "name": "לוקטב, רון פולונסקי, אנדראה מורז, אנסטסיה",
              "club": "גורבנקו נבחרת ישראל",
              "country": "ISR",
              "record_date": "18/05/2021"
            },
            "adults": {
              "time": "03:34.98",
              "name": "מירון חרותי, רון פולונסקי, לאה פולונסקי, אביב",
              "club": "ברזילי",
              "country": "ISR",
              "record_date": "13/06/2021"
            }
          }
        },
        "individual_medley": {
          "4X100m": {
            "12": {
              "time": "02:12.66",
              "name": "ליאור איליאגויב, עדן שץ, תומר איזבקוב, מילנה",
              "club": "יודולוביץ הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "31/07/2025"
            },
            "13": {
              "time": "02:12.66",
              "name": "ליאור איליאגויב, עדן שץ, תומר איזבקוב, מילנה",
              "club": "יודולוביץ הפועל דולפין נתניה",
              "country": "ISR",
              "record_date": "31/07/2025"
            },
            "14": {
              "time": "04:11.73",
              "name": "קרן אייזברוך, דוריה גורלסקי, דותן אלון, דניאל סובטוב",
              "club": "מכבי ראשון לציון",
              "country": "ISR",
              "record_date": "29/07/2022"
            },
            "15": {
              "time": "04:11.73",
              "name": "קרן אייזברוך, דוריה גורלסקי, דותן אלון, דניאל סובטוב",
              "club": "מכבי ראשון לציון",
              "country": "ISR",
              "record_date": "29/07/2022"
            },
            "16": {
              "time": "04:09.15",
              "name": "דניאל נג׳אר, מרק טלר, זהר כהן הרפניסט, אוה",
              "club": "גולצוב מכבי מרום ר\"ג",
              "country": "ISR",
              "record_date": "09/08/2024"
            },
            "17": {
              "time": "04:06.52",
              "name": "דניאל נג׳אר, מרק טלר, טומי ליטאי, אוה גולצוב",
              "club": "מכבי מרום ר\"ג",
              "country": "ISR",
              "record_date": "27/07/2025"
            },
            "18": {
              "time": "04:06.29",
              "name": "דניאל רבינוביץ, גל סחרוב, אופיר רכאח, דריה גולובטי",
              "club": "הפועל בת-ים",
              "country": "ISR",
              "record_date": "07/06/2023"
            },
            "ISR": {
              "time": "03:43.94",
              "name": "אנסטסיה גורבנקו, איתי גולדפדן, גל כהן גרומי, אנדראה",
              "club": "מורז נבחרת ישראל",
              "country": "ISR",
              "record_date": "29/07/2021"
            },
            "adults": {
              "time": "03:52.68",
              "name": "אדם מראענה, רו ם יהונת ן, לאה פולונסקי, איילה",
              "club": "שפיץ מכבי חיפה",
              "country": "ISR",
              "record_date": "07/06/2023"
            },
            "": {
              "time": "03:55.40",
              "name": "",
              "club": "נבחרת ישראל",
              "country": "ISR",
              "record_date": "04/07/2025"
            }
          }
        }
      }
    }
  }
};